*** crates/casm-cli/src/cli.rs:103:9: replace DiagramFormat::renderer_id -> &'static str with ""

*** mutation diff:
--- crates/casm-cli/src/cli.rs
+++ replace DiagramFormat::renderer_id -> &'static str with ""
@@ -95,21 +95,17 @@
     /// Plain text, readable in a CI log.
     Ascii,
 }
 
 impl DiagramFormat {
     /// The renderer identifier this format selects.
     #[must_use]
     pub(crate) const fn renderer_id(self) -> &'static str {
-        match self {
-            Self::Mermaid => "mermaid",
-            Self::Dot => "dot",
-            Self::Ascii => "ascii",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Where an inventory of real infrastructure comes from.
 #[derive(Clone, Copy, Debug, PartialEq, Eq, ValueEnum)]
 pub(crate) enum InventorySource {
     /// CASIMIR's own inventory schema.
     Native,

---- cli::tests::diagram_formats_map_onto_renderer_ids stdout ----

thread 'cli::tests::diagram_formats_map_onto_renderer_ids' (324547) panicked at crates/casm-cli/src/cli.rs:563:9:
assertion `left == right` failed
  left: ""
 right: "mermaid"

---- cli::tests::every_diagram_format_resolves_to_a_real_backend stdout ----

thread 'cli::tests::every_diagram_format_resolves_to_a_real_backend' (324550) panicked at crates/casm-cli/src/cli.rs:575:13:
Mermaid names no backend

---- commands::tests::generate_writes_a_diagram_to_disk stdout ----

thread 'commands::tests::generate_writes_a_diagram_to_disk' (324584) panicked at crates/casm-cli/src/commands.rs:1126:9:
assertion failed: generate(&source, DiagramFormat::Mermaid, Some(&target)).is_ok()

failures:
    cli::tests::diagram_formats_map_onto_renderer_ids
    cli::tests::every_diagram_format_resolves_to_a_real_backend
    commands::tests::generate_writes_a_diagram_to_disk

test result: FAILED. 72 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
