*** crates/casm-core/src/pattern.rs:159:9: replace Requirement::min_security_controls -> usize with 0

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Requirement::min_security_controls -> usize with 0
@@ -151,17 +151,17 @@
     pub fn description(&self) -> Option<&str> {
         self.description.as_deref()
     }
 
     /// The fewest security controls required.
     #[inline]
     #[must_use]
     pub const fn min_security_controls(&self) -> usize {
-        self.min_security_controls
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Control types the node must declare.
     #[inline]
     #[must_use]
     pub fn required_control_types(&self) -> &[ControlType] {
         &self.required_control_types
     }

---- conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision stdout ----

thread 'conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision' (484482) panicked at crates/casm-core/src/conformance.rs:787:9:
assertion `left == right` failed
  left: 1
 right: 2

---- conformance::tests::every_unmet_variant_renders_a_message_naming_its_role stdout ----

thread 'conformance::tests::every_unmet_variant_renders_a_message_naming_its_role' (484481) panicked at crates/casm-core/src/conformance.rs:811:9:
assertion `left == right` failed
  left: 2
 right: 3

---- conformance::tests::too_few_security_controls_is_reported_with_both_counts stdout ----

thread 'conformance::tests::too_few_security_controls_is_reported_with_both_counts' (484485) panicked at crates/casm-core/src/conformance.rs:648:9:
assertion failed: matches!(report.unmet(),
    [Unmet::TooFewControls { required: 5, declared: 2, .. }])

failures:
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::too_few_security_controls_is_reported_with_both_counts
    pattern::tests::a_fingerprint_changes_when_the_shape_changes

test result: FAILED. 184 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
