*** crates/casm-core/src/pattern.rs:159:9: replace Requirement::min_security_controls -> usize with 1

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Requirement::min_security_controls -> usize with 1
@@ -151,17 +151,17 @@
     pub fn description(&self) -> Option<&str> {
         self.description.as_deref()
     }
 
     /// The fewest security controls required.
     #[inline]
     #[must_use]
     pub const fn min_security_controls(&self) -> usize {
-        self.min_security_controls
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Control types the node must declare.
     #[inline]
     #[must_use]
     pub fn required_control_types(&self) -> &[ControlType] {
         &self.required_control_types
     }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (485863) panicked at crates/casm-core/src/conformance.rs:519:9:
[TooFewControls { role: "application", node: "orders", required: 1, declared: 0 }]

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (485862) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (485867) panicked at crates/casm-core/src/conformance.rs:723:22:
expected MissingRelationship, got [TooFewControls { role: "application", node: "orders", required: 1, declared: 0 }, MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "async" }]

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::too_few_security_controls_is_reported_with_both_counts
    pattern::tests::a_fingerprint_changes_when_the_shape_changes

test result: FAILED. 180 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
