*** crates/casm-formal/src/alloy.rs:106:5: replace signature_of -> &'static str with ""

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace signature_of -> &'static str with ""
@@ -98,28 +98,17 @@
         .map_or_else(
             || "N_unknown".to_owned(),
             |(identifier, _)| identifier.clone(),
         )
 }
 
 /// The Alloy signature name for a node type.
 const fn signature_of(node_type: NodeType) -> &'static str {
-    match node_type {
-        NodeType::Service => "Service",
-        NodeType::Database => "Database",
-        NodeType::Queue => "Queue",
-        NodeType::Cache => "Cache",
-        NodeType::Gateway => "Gateway",
-        NodeType::Storage => "Storage",
-        NodeType::ExternalSystem => "ExternalSystem",
-        NodeType::Legacy => "Legacy",
-        NodeType::Human => "Human",
-        NodeType::Boundary => "Boundary",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts an architecture name into a legal Alloy module name.
 #[must_use]
 pub fn module_name(architecture_name: &str) -> String {
     let sanitised: String = architecture_name
         .chars()
         .map(|character| {

---- alloy::tests::only_the_node_types_in_use_are_declared stdout ----

thread 'alloy::tests::only_the_node_types_in_use_are_declared' (563436) panicked at crates/casm-formal/src/alloy.rs:470:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

failures:
    alloy::tests::only_the_node_types_in_use_are_declared

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
