*** crates/casm-cli/src/cli.rs:446:9: replace Command::name -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-cli/src/cli.rs
+++ replace Command::name -> &'static str with "xyzzy"
@@ -438,33 +438,17 @@
 impl Command {
     /// The subcommand's name, as a span and metric label.
     ///
     /// Spelled out rather than derived from `Debug`: these strings are the dimension a
     /// telemetry backend groups by, so they are a contract, and a rename would silently
     /// split one series into two.
     #[must_use]
     pub(crate) const fn name(&self) -> &'static str {
-        match self {
-            Self::Init { .. } => "init",
-            Self::Validate { .. } => "validate",
-            Self::Generate { .. } => "generate",
-            Self::Diff { .. } => "diff",
-            Self::Check { .. } => "check",
-            Self::Evolve { .. } => "evolve",
-            Self::Evidence { .. } => "evidence",
-            Self::Fmt { .. } => "fmt",
-            Self::Drift { .. } => "drift",
-            Self::Log { .. } => "log",
-            Self::Blame { .. } => "blame",
-            Self::Checkout { .. } => "checkout",
-            Self::Formal { .. } => "formal",
-            Self::Hook { .. } => "hook",
-            Self::Rules { .. } => "rules",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- cli::tests::every_subcommand_has_a_telemetry_name_matching_its_command_line_name stdout ----

thread 'cli::tests::every_subcommand_has_a_telemetry_name_matching_its_command_line_name' (325618) panicked at crates/casm-cli/src/cli.rs:632:17:
assertion `left == right` failed
  left: "xyzzy"
 right: "init"

---- tests::every_run_is_instrumented_even_without_the_flag stdout ----
9 built-in rule(s):

  no-dependency-cycles
      blocking dependencies (sync, depends-on, composed, quantum-entangled) must be acyclic
  no-publicly-exposed-datastores
      external systems and humans must not connect directly to a database, queue, or store
  critical-path-within-budget
      the summed latency budget along the longest blocking path must stay within the SLO
  services-require-security-controls
      each service and gateway must declare at least the configured number of security controls
  stateful-nodes-require-controls
      nodes that hold state must declare at least one control
  boundary-crossings-require-controls

failures:
    cli::tests::every_subcommand_has_a_telemetry_name_matching_its_command_line_name
    tests::every_run_is_instrumented_even_without_the_flag

test result: FAILED. 73 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
