*** crates/casm-cli/src/commands.rs:102:27: delete ! in init

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ delete ! in init
@@ -94,17 +94,17 @@
     }
 }
 
 /// The result of running a subcommand.
 pub(crate) type CommandResult = Result<ExitCode, CommandError>;
 
 /// Scaffolds a new architecture file.
 pub(crate) fn init(name: &str, output: &Path, force: bool) -> CommandResult {
-    if output.exists() && !force {
+    if output.exists() &&  /* ~ changed by cargo-mutants ~ */force {
         return Err(CommandError(format!(
             "'{}' already exists; pass --force to overwrite it",
             output.display()
         )));
     }
 
     let contents = TEMPLATE.replace("{{NAME}}", name);
     std::fs::write(output, &contents)

---- commands::tests::init_writes_a_file_and_refuses_to_clobber_it stdout ----
created '/tmp/casm-cli-init-019fd1cc-40b8-70e2-afce-535ee29dd4df/architecture.yaml' (3 nodes)
  next: casm validate /tmp/casm-cli-init-019fd1cc-40b8-70e2-afce-535ee29dd4df/architecture.yaml
created '/tmp/casm-cli-init-019fd1cc-40b8-70e2-afce-535ee29dd4df/architecture.yaml' (3 nodes)
  next: casm validate /tmp/casm-cli-init-019fd1cc-40b8-70e2-afce-535ee29dd4df/architecture.yaml

thread 'commands::tests::init_writes_a_file_and_refuses_to_clobber_it' (326532) panicked at crates/casm-cli/src/commands.rs:960:9:
init must not overwrite without --force

failures:
    commands::tests::init_writes_a_file_and_refuses_to_clobber_it

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
