*** crates/casm-cli/src/commands.rs:132:5: replace validator_config -> ValidatorConfig with Default::default()

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace validator_config -> ValidatorConfig with Default::default()
@@ -124,29 +124,17 @@
 }
 
 /// Builds a validator configuration from command-line overrides.
 fn validator_config(
     allow: &[String],
     max_critical_path_ms: Option<u64>,
     min_security_controls: Option<usize>,
 ) -> ValidatorConfig {
-    let mut config = ValidatorConfig::new();
-
-    if let Some(ceiling) = max_critical_path_ms {
-        config = config.max_critical_path_ms(ceiling);
-    }
-    if let Some(minimum) = min_security_controls {
-        config = config.min_security_controls_per_service(minimum);
-    }
-    for rule in allow {
-        config = config.allowing(rule.clone());
-    }
-
-    config
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Validates one architecture file.
 pub(crate) fn validate(
     file: &Path,
     format: OutputFormat,
     strict: bool,
     allow: &[String],

---- commands::tests::command_line_overrides_reach_the_validator_config stdout ----

thread 'commands::tests::command_line_overrides_reach_the_validator_config' (326871) panicked at crates/casm-cli/src/commands.rs:979:9:
assertion `left == right` failed
  left: 1000
 right: 250

failures:
    commands::tests::command_line_overrides_reach_the_validator_config

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
