*** crates/casm-lsp/src/actions.rs:95:9: delete match arm "services-require-security-controls" in quick_fixes

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ delete match arm "services-require-security-controls" in quick_fixes
@@ -87,23 +87,17 @@
 /// Builds the quick-fixes available for `diagnostic`.
 #[must_use]
 pub fn quick_fixes(index: &DocumentIndex, diagnostic: &Diagnostic) -> Vec<CodeAction> {
     let Some(node) = node_at(index, diagnostic.span) else {
         return Vec::new();
     };
 
     match diagnostic.code.as_str() {
-        "services-require-security-controls" => vec![add_controls(
-            index,
-            node,
-            &diagnostic.code,
-            "Add the missing security controls",
-            SECURITY_CONTROLS,
-        )],
+         /* ~ changed by cargo-mutants ~ */
         "stateful-nodes-require-controls" => vec![add_controls(
             index,
             node,
             &diagnostic.code,
             "Add controls for this datastore",
             DATASTORE_CONTROLS,
         )],
         _ => Vec::new(),

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (631766) panicked at crates/casm-lsp/src/actions.rs:333:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (631769) panicked at crates/casm-lsp/src/actions.rs:333:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::adding_security_controls_actually_clears_the_diagnostic stdout ----

thread 'actions::tests::adding_security_controls_actually_clears_the_diagnostic' (631773) panicked at crates/casm-lsp/src/actions.rs:333:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented

test result: FAILED. 206 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
