*** crates/casm-cli/src/commands.rs:299:32: replace > with == in check

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace > with == in check
@@ -291,17 +291,17 @@
                 recorder.count("casm.documents.checked", 1);
                 println!("{}: {}", file.display(), report.summary());
 
                 for diagnostic in &report.diagnostics {
                     println!("  {}", diagnostic.render().replace('\n', "\n  "));
                 }
 
                 let code = exit_code_for(&report, strict);
-                if code.code() > worst.code() {
+                if code.code() == /* ~ changed by cargo-mutants ~ */ worst.code() {
                     worst = code;
                 }
             }
             Err(error) => {
                 // A file that fails to parse is reported and the sweep continues: a
                 // single broken file must not hide findings in every other one.
                 println!("{}: FAILED TO PARSE\n  {}", file.display(), error.render());
                 worst = ExitCode::Failure;

*** result: Success
