*** crates/casm-validator/src/rules.rs:174:9: replace <impl Rule for ServicesRequireSecurityControls>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for ServicesRequireSecurityControls>::id -> &'static str with ""
@@ -166,17 +166,17 @@
     }
 }
 
 /// Every service must declare a minimum number of security controls.
 pub struct ServicesRequireSecurityControls;
 
 impl Rule for ServicesRequireSecurityControls {
     fn id(&self) -> &'static str {
-        "services-require-security-controls"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "each service and gateway must declare at least the configured number of security controls"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         let required = context.config.min_security_controls_per_service;

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (1980668) panicked at crates/casm-validator/src/rules.rs:659:9:
assertion failed: has(&architecture, "services-require-security-controls")

failures:
    rules::tests::a_service_without_security_controls_warns

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
