*** crates/casm-validator/src/rules.rs:178:9: replace <impl Rule for ServicesRequireSecurityControls>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for ServicesRequireSecurityControls>::description -> &'static str with ""
@@ -170,17 +170,17 @@
 pub struct ServicesRequireSecurityControls;
 
 impl Rule for ServicesRequireSecurityControls {
     fn id(&self) -> &'static str {
         "services-require-security-controls"
     }
 
     fn description(&self) -> &'static str {
-        "each service and gateway must declare at least the configured number of security controls"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         let required = context.config.min_security_controls_per_service;
         if required == 0 {
             return;
         }

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1980780) panicked at crates/casm-validator/src/rules.rs:937:13:
services-require-security-controls has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
