*** crates/casm-validator/src/rules.rs:182:9: replace <impl Rule for ServicesRequireSecurityControls>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for ServicesRequireSecurityControls>::check with ()
@@ -174,45 +174,17 @@
         "services-require-security-controls"
     }
 
     fn description(&self) -> &'static str {
         "each service and gateway must declare at least the configured number of security controls"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
-        let required = context.config.min_security_controls_per_service;
-        if required == 0 {
-            return;
-        }
-
-        for node in context.architecture.nodes() {
-            if !matches!(node.node_type(), NodeType::Service | NodeType::Gateway) {
-                continue;
-            }
-
-            let declared = node.controls_of_type(ControlType::Security);
-            if declared >= required {
-                continue;
-            }
-
-            report.push(
-                Diagnostic::new(
-                    self.id(),
-                    Severity::Warning,
-                    RuleContext::subject(node),
-                    format!("declares {declared} security control(s) but {required} are required"),
-                )
-                .with_suggestion(format!(
-                    "add {} more control(s) with 'type: security' describing how this \
-                     node is authenticated, authorised, and encrypted",
-                    required.saturating_sub(declared)
-                )),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Stateful nodes must declare at least one control.
 ///
 /// A database with no declared controls is a database nobody has thought about backing
 /// up, encrypting, or restricting.
 pub struct StatefulNodesRequireControls;

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (1982111) panicked at crates/casm-validator/src/rules.rs:631:9:
assertion failed: has(&architecture, "services-require-security-controls")

failures:
    rules::tests::a_service_without_security_controls_warns

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
