*** crates/casm-cli/src/commands.rs:321:8: delete ! in fmt

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ delete ! in fmt
@@ -313,17 +313,17 @@
     Ok(worst)
 }
 
 /// Reformats or converts an architecture file.
 pub(crate) fn fmt(file: &Path, format: DocumentFormat, write: bool) -> CommandResult {
     let architecture = parse_file(file)?;
     let rendered = emit_str(&architecture, format.as_parser_format())?;
 
-    if !write {
+    if  /* ~ changed by cargo-mutants ~ */write {
         print!("{rendered}");
         return Ok(ExitCode::Success);
     }
 
     let target = target_path(file, format.as_parser_format());
     std::fs::write(&target, &rendered)
         .map_err(|error| CommandError(format!("cannot write '{}': {error}", target.display())))?;

---- commands::tests::fmt_converts_between_formats_on_disk stdout ----
{
  "name": "demo",
  "version": "0.1.0",
  "description": "Describe what this system does, in one sentence.",
  "nodes": [
    {
      "name": "gateway",
      "type": "gateway",
      "id": "019fd1cc-a91c-7ba2-a615-e4f2ec3a7f30",
      "description": "Public entry point.",
      "interfaces": [
        {
          "name": "public-api",

failures:
    commands::tests::fmt_converts_between_formats_on_disk

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
