*** crates/casm-cli/src/commands.rs:336:5: replace target_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace target_path -> PathBuf with Default::default()
@@ -328,22 +328,17 @@
         .map_err(|error| CommandError(format!("cannot write '{}': {error}", target.display())))?;
 
     println!("wrote {}", target.display());
     Ok(ExitCode::Success)
 }
 
 /// Chooses the output path when `fmt --write` changes the format.
 fn target_path(file: &Path, format: Format) -> PathBuf {
-    let extension = match format {
-        Format::Yaml => "yaml",
-        Format::Json => "json",
-        Format::Toml => "toml",
-    };
-    file.with_extension(extension)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Exports the architecture as a formal specification.
 pub(crate) fn formal(file: &Path, target: FormalTarget, output: Option<&Path>) -> CommandResult {
     let architecture = parse_file(file)?;
     let model = casm_formal::FormalModel::of(&architecture);
 
     let mut written: Vec<(String, String)> = Vec::new();

---- commands::tests::fmt_target_path_follows_the_chosen_format stdout ----

thread 'commands::tests::fmt_target_path_follows_the_chosen_format' (330724) panicked at crates/casm-cli/src/commands.rs:1000:9:
assertion `left == right` failed
  left: ""
 right: "systems/checkout.json"

---- commands::tests::fmt_converts_between_formats_on_disk stdout ----

thread 'commands::tests::fmt_converts_between_formats_on_disk' (330723) panicked at crates/casm-cli/src/commands.rs:1134:9:
assertion failed: fmt(&source, DocumentFormat::Json, true).is_ok()

failures:
    commands::tests::fmt_converts_between_formats_on_disk
    commands::tests::fmt_target_path_follows_the_chosen_format

test result: FAILED. 73 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
