*** crates/casm-validator/src/rules.rs:183:21: replace == with != in <impl Rule for ServicesRequireSecurityControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace == with != in <impl Rule for ServicesRequireSecurityControls>::check
@@ -175,17 +175,17 @@
     }
 
     fn description(&self) -> &'static str {
         "each service and gateway must declare at least the configured number of security controls"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         let required = context.config.min_security_controls_per_service;
-        if required == 0 {
+        if required != /* ~ changed by cargo-mutants ~ */ 0 {
             return;
         }
 
         for node in context.architecture.nodes() {
             if !matches!(node.node_type(), NodeType::Service | NodeType::Gateway) {
                 continue;
             }

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (1132861) panicked at crates/casm-validator/src/rules.rs:659:9:
assertion failed: has(&architecture, "services-require-security-controls")

failures:
    rules::tests::a_service_without_security_controls_warns

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
