*** crates/casm-validator/src/rules.rs:193:25: replace >= with < in <impl Rule for ServicesRequireSecurityControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace >= with < in <impl Rule for ServicesRequireSecurityControls>::check
@@ -185,17 +185,17 @@
         }
 
         for node in context.architecture.nodes() {
             if !matches!(node.node_type(), NodeType::Service | NodeType::Gateway) {
                 continue;
             }
 
             let declared = node.controls_of_type(ControlType::Security);
-            if declared >= required {
+            if declared < /* ~ changed by cargo-mutants ~ */ required {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,
                     RuleContext::subject(node),

---- rules::tests::a_service_with_enough_security_controls_is_quiet stdout ----

thread 'rules::tests::a_service_with_enough_security_controls_is_quiet' (1134453) panicked at crates/casm-validator/src/rules.rs:677:9:
assertion failed: !has(&architecture, "services-require-security-controls")

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (1134454) panicked at crates/casm-validator/src/rules.rs:659:9:
assertion failed: has(&architecture, "services-require-security-controls")

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (1134482) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
warning[services-require-security-controls]: node 'gateway': declares 2 security control(s) but 2 are required
  help: add 0 more control(s) with 'type: security' describing how this node is authenticated, authorised, and encrypted
warning[services-require-security-controls]: node 'orders': declares 2 security control(s) but 2 are required
  help: add 0 more control(s) with 'type: security' describing how this node is authenticated, authorised, and encrypted

failures:
    rules::tests::a_service_with_enough_security_controls_is_quiet
    rules::tests::a_service_without_security_controls_warns
    tests::a_healthy_architecture_produces_a_clean_report

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
