*** crates/casm-core/src/control.rs:49:9: replace ControlType::is_auditable -> bool with true

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace ControlType::is_auditable -> bool with true
@@ -41,20 +41,17 @@
             Self::Operational => "operational",
             Self::DataGovernance => "data-governance",
         }
     }
 
     /// Returns `true` if absence of this control is an audit finding rather than a risk.
     #[must_use]
     pub const fn is_auditable(self) -> bool {
-        match self {
-            Self::Compliance | Self::DataGovernance => true,
-            Self::Security | Self::Operational => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for ControlType {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.label())
     }
 }

---- control::tests::auditability_is_classified_per_control_type stdout ----

thread 'control::tests::auditability_is_classified_per_control_type' (1796855) panicked at crates/casm-core/src/control.rs:298:9:
assertion failed: !ControlType::Security.is_auditable()

failures:
    control::tests::auditability_is_classified_per_control_type

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
