*** crates/casm-cli/src/commands.rs:553:20: replace == with != in evolve

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace == with != in evolve
@@ -545,17 +545,17 @@
             continue;
         };
 
         let report = conformance::check(&architecture, pattern, claim);
         unmet_total = unmet_total.saturating_add(report.unmet().len());
         print_conformance(&reference, &report, &architecture);
     }
 
-    if unmet_total == 0 {
+    if unmet_total != /* ~ changed by cargo-mutants ~ */ 0 {
         println!("conforms to every pattern claimed");
         return Ok(ExitCode::Success);
     }
 
     println!("{unmet_total} requirement(s) unmet");
     if strict {
         return Ok(ExitCode::ValidationErrors);
     }

---- commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim stdout ----
/tmp/casm-cli-evolve-to-019fd1cc-c832-73b3-8778-1f3900579112/architecture.yaml: 1 pattern(s)

scaffold-shape@1.0.0: conforms
0 requirement(s) unmet

thread 'commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim' (332593) panicked at crates/casm-cli/src/commands.rs:1225:9:
assertion `left == right` failed
  left: 2
 right: 0

---- commands::tests::evolve_reports_a_pattern_the_library_does_not_hold stdout ----
/tmp/casm-cli-evolve-missing-019fd1cc-c833-73c0-a4f9-8683d224e20c/architecture.yaml: 1 pattern(s)

nonexistent@1.0.0: not found in '/tmp/casm-cli-evolve-missing-019fd1cc-c833-73c0-a4f9-8683d224e20c/patterns'
conforms to every pattern claimed

thread 'commands::tests::evolve_reports_a_pattern_the_library_does_not_hold' (332596) panicked at crates/casm-cli/src/commands.rs:1256:9:
assertion `left == right` failed
  left: 0
 right: 2

---- commands::tests::evolve_fails_under_strict_when_a_requirement_is_unmet stdout ----
/tmp/casm-cli-evolve-unmet-019fd1cc-c834-7be2-a3b0-1437a4fa27dc/architecture.yaml: 1 pattern(s)

scaffold-shape@1.0.0: 1 unmet
  decide: no node of type 'queue' can fill role 'bus'

conforms to every pattern claimed

thread 'commands::tests::evolve_fails_under_strict_when_a_requirement_is_unmet' (332594) panicked at crates/casm-cli/src/commands.rs:1241:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim
    commands::tests::evolve_fails_under_strict_when_a_requirement_is_unmet
    commands::tests::evolve_reports_a_pattern_the_library_does_not_hold
    commands::tests::evolve_reports_conformance_for_a_claim_the_architecture_satisfies
    commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one

test result: FAILED. 70 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
