*** crates/casm-validator/src/rules.rs:174:9: replace <impl Rule for ServicesRequireSecurityControls>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for ServicesRequireSecurityControls>::id -> &'static str with "xyzzy"
@@ -166,17 +166,17 @@
     }
 }
 
 /// Every service must declare a minimum number of security controls.
 pub struct ServicesRequireSecurityControls;
 
 impl Rule for ServicesRequireSecurityControls {
     fn id(&self) -> &'static str {
-        "services-require-security-controls"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "each service and gateway must declare at least the configured number of security controls"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         let required = context.config.min_security_controls_per_service;

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (2053332) panicked at crates/casm-validator/src/rules.rs:659:9:
assertion failed: has(&architecture, "services-require-security-controls")

---- rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract stdout ----

thread 'rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract' (2053364) panicked at crates/casm-validator/src/rules.rs:917:9:
assertion `left == right` failed: the identifiers and the order they are reported in are both a contract: SARIF output and `casm rules` are read by machines
  left: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "xyzzy", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces", "patterns-are-satisfied"]
 right: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nod

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2053362) panicked at crates/casm-validator/src/rules.rs:895:36:
no rule with id "services-require-security-controls"

failures:
    rules::tests::a_service_without_security_controls_warns
    rules::tests::every_rule_describes_itself_rather_than_something_else
    rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract

test result: FAILED. 84 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
