*** crates/casm-cli/src/commands.rs:573:5: replace evolve_targets -> Result<Vec<casm_core::Conformance>, CommandError> with Ok(vec![])

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace evolve_targets -> Result<Vec<casm_core::Conformance>, CommandError> with Ok(vec![])
@@ -565,49 +565,17 @@
 /// Decides which claims `casm evolve` should report on.
 ///
 /// With `--to`, exactly that pattern, whether or not the architecture already claims it —
 /// that is the migration case. Without it, everything already claimed.
 fn evolve_targets(
     architecture: &Architecture,
     to: Option<&str>,
 ) -> Result<Vec<casm_core::Conformance>, CommandError> {
-    let Some(wanted) = to else {
-        return Ok(architecture.conformance().cloned().collect());
-    };
-
-    let reference = casm_core::PatternRef::parse(wanted)
-        .map_err(|error| CommandError(format!("--to: {error}")))?;
-
-    // An existing claim carries the author's bindings, and discarding them would report
-    // back an ambiguity they have already resolved. Any version of the same pattern will
-    // do: migrating from 1.0.0 to 2.0.0 is precisely the case where the bindings written
-    // for the old version are the ones worth reusing. Roles the new version does not have
-    // are reported rather than dropped, which is the honest outcome — a binding that no
-    // longer means anything is a thing the author should be told about.
-    let inherited = architecture
-        .conformance()
-        .find(|claim| claim.pattern() == &reference)
-        .or_else(|| {
-            architecture
-                .conformance()
-                .find(|claim| claim.pattern().name() == reference.name())
-        });
-
-    let Some(existing) = inherited else {
-        return Ok(vec![casm_core::Conformance::new(reference)]);
-    };
-
-    let mut claim = casm_core::Conformance::new(reference);
-    for (role, node) in existing.bindings() {
-        claim = claim
-            .binding(role.as_str(), *node)
-            .map_err(|error| CommandError(format!("--to: {error}")))?;
-    }
-    Ok(vec![claim])
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Prints one conformance report.
 fn print_conformance(
     reference: &str,
     report: &casm_core::ConformanceReport,
     architecture: &Architecture,
 ) {

---- commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one stdout ----
/tmp/casm-cli-evolve-migrate-019fd1cc-cc5c-7a63-8d2e-00d4a86958f2/architecture.yaml: claims no patterns, and none was requested with --to

thread 'commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one' (332868) panicked at crates/casm-cli/src/commands.rs:1289:9:
assertion `left == right` failed: two services must be ambiguous without a binding
  left: 0
 right: 2

---- commands::tests::evolve_reports_a_pattern_the_library_does_not_hold stdout ----
/tmp/casm-cli-evolve-missing-019fd1cc-cc59-7b60-ae52-85a3e0e27019/architecture.yaml: claims no patterns, and none was requested with --to

thread 'commands::tests::evolve_reports_a_pattern_the_library_does_not_hold' (332866) panicked at crates/casm-cli/src/commands.rs:1224:9:
assertion `left == right` failed
  left: 0
 right: 2

---- commands::tests::evolve_rejects_a_malformed_pattern_reference stdout ----
/tmp/casm-cli-evolve-malformed-019fd1cc-cc59-7b60-ae52-85958b3e6f76/architecture.yaml: claims no patterns, and none was requested with --to

thread 'commands::tests::evolve_rejects_a_malformed_pattern_reference' (332865) panicked at crates/casm-cli/src/commands.rs:1231:9:
assertion failed: evolve(&file, &patterns, Some("no-version"), false).is_err()

failures:
    commands::tests::evolve_fails_under_strict_when_a_requirement_is_unmet
    commands::tests::evolve_rejects_a_malformed_pattern_reference
    commands::tests::evolve_reports_a_pattern_the_library_does_not_hold
    commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one

test result: FAILED. 71 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
