*** crates/casm-validator/src/rules.rs:188:16: delete ! in <impl Rule for ServicesRequireSecurityControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for ServicesRequireSecurityControls>::check
@@ -180,17 +180,17 @@
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         let required = context.config.min_security_controls_per_service;
         if required == 0 {
             return;
         }
 
         for node in context.architecture.nodes() {
-            if !matches!(node.node_type(), NodeType::Service | NodeType::Gateway) {
+            if  /* ~ changed by cargo-mutants ~ */matches!(node.node_type(), NodeType::Service | NodeType::Gateway) {
                 continue;
             }
 
             let declared = node.controls_of_type(ControlType::Security);
             if declared >= required {
                 continue;
             }

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (2054904) panicked at crates/casm-validator/src/rules.rs:659:9:
assertion failed: has(&architecture, "services-require-security-controls")

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (2054978) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
warning[services-require-security-controls]: node 'orders-db': declares 1 security control(s) but 2 are required
  help: add 1 more control(s) with 'type: security' describing how this node is authenticated, authorised, and encrypted

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (2054996) panicked at crates/casm-validator/src/lib.rs:307:9:
still reported:
warning[services-require-security-controls]: node 'db': declares 0 security control(s) but 2 are required
  help: add 2 more control(s) with 'type: security' describing how this node is authenticated, authorised, and encrypted

failures:
    rules::tests::a_service_without_security_controls_warns
    tests::a_healthy_architecture_produces_a_clean_report
    tests::suppressed_rules_do_not_fire

test result: FAILED. 84 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
