*** crates/casm-cli/src/commands.rs:693:15: replace && with || in evidence

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace && with || in evidence
@@ -685,17 +685,17 @@
         }
         EvidenceFormat::Json => {
             let json = serde_json::to_string_pretty(&pack)
                 .map_err(|error| CommandError(format!("cannot serialise the register: {error}")))?;
             println!("{json}");
         }
     }
 
-    if strict && pack.outstanding() > 0 {
+    if strict || /* ~ changed by cargo-mutants ~ */ pack.outstanding() > 0 {
         return Ok(ExitCode::ValidationErrors);
     }
     Ok(ExitCode::Success)
 }
 
 /// Reads whatever Git can tell us about where an architecture came from.
 ///
 /// A file outside a repository, or one Git cannot read, yields

---- commands::tests::an_architecture_outside_a_repository_still_produces_a_register stdout ----
# Control claims register — audited v1.0.0

> This is a register of the controls this architecture CLAIMS, assembled from the file and its history. CASIMIR verified the structure, not the reality: nothing here is evidence that a control is implemented.

| | |
|---|---|
| Fingerprint | `57f55bc212764f9c1807fe3f4f480cd849c3bd7caa6a43904029fc231b46e273` |
| Provenance | not under version control, or history was not read |
| Source | `/tmp/casm-cli-evidence-nogit-019fd1cc-dd64-7a33-b745-490286a38bc6/architecture.yaml` |

## ISO27001-A.10.1

1 claim(s), **1 outstanding**.

---- commands::tests::no_history_skips_git_entirely stdout ----
{
  "architecture": "audited",
  "version": "1.0.0",
  "fingerprint": "57f55bc212764f9c1807fe3f4f480cd849c3bd7caa6a43904029fc231b46e273",
  "provenance": {
    "source": "/tmp/casm-cli-evidence-nohistory-019fd1cc-dd6e-7781-ad07-1b5190c39514/architecture.yaml"
  },
  "standards": [
    {
      "standard": "ISO27001-A.10.1",
      "claims": [
        {
          "node": "orders-db",

---- commands::tests::the_evidence_register_lists_claims_and_counts_what_is_outstanding stdout ----
Control claims register — audited v1.0.0

This is a register of the controls this architecture CLAIMS, assembled from the file and its history. CASIMIR verified the structure, not the reality: nothing here is evidence that a control is implemented.

  fingerprint  57f55bc212764f9c1807fe3f4f480cd849c3bd7caa6a43904029fc231b46e273
  provenance   not under version control, or history was not read

ISO27001-A.10.1  (1 claim(s), 1 outstanding)
  ! orders-db            compliance       Encrypted at rest

PITR-35D  (1 claim(s), 0 outstanding)
    orders-db            operational      Point-in-time recovery for 35 days

failures:
    commands::tests::an_architecture_outside_a_repository_still_produces_a_register
    commands::tests::no_history_skips_git_entirely
    commands::tests::strict_evidence_passes_when_nothing_is_flagged
    commands::tests::the_evidence_register_lists_claims_and_counts_what_is_outstanding

test result: FAILED. 71 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
