*** crates/casm-cli/src/commands.rs:693:37: replace > with < in evidence

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace > with < in evidence
@@ -685,17 +685,17 @@
         }
         EvidenceFormat::Json => {
             let json = serde_json::to_string_pretty(&pack)
                 .map_err(|error| CommandError(format!("cannot serialise the register: {error}")))?;
             println!("{json}");
         }
     }
 
-    if strict && pack.outstanding() > 0 {
+    if strict && pack.outstanding() < /* ~ changed by cargo-mutants ~ */ 0 {
         return Ok(ExitCode::ValidationErrors);
     }
     Ok(ExitCode::Success)
 }
 
 /// Reads whatever Git can tell us about where an architecture came from.
 ///
 /// A file outside a repository, or one Git cannot read, yields

---- commands::tests::strict_evidence_fails_when_a_claim_is_outstanding stdout ----
{
  "architecture": "audited",
  "version": "1.0.0",
  "fingerprint": "57f55bc212764f9c1807fe3f4f480cd849c3bd7caa6a43904029fc231b46e273",
  "provenance": {
    "source": "/tmp/casm-cli-evidence-strict-019fd1cc-e11c-7541-89d0-e158bc5595c3/architecture.yaml"
  },
  "standards": [
    {
      "standard": "ISO27001-A.10.1",
      "claims": [
        {
          "node": "orders-db",

failures:
    commands::tests::strict_evidence_fails_when_a_claim_is_outstanding

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
