*** crates/casm-cli/src/commands.rs:728:5: replace attribution_of -> Attribution with Default::default()

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace attribution_of -> Attribution with Default::default()
@@ -720,23 +720,17 @@
         (Some(latest), Some(first)) => base.at(latest).introduced_by(first),
         (Some(latest), None) => base.at(latest),
         (None, _) => base,
     }
 }
 
 /// Projects a revision onto the attribution an evidence register carries.
 fn attribution_of(revision: &casm_git::Revision) -> Attribution {
-    Attribution {
-        commit: revision.commit.clone(),
-        author: revision.author.clone(),
-        email: revision.email.clone(),
-        date: revision.dated().to_date(),
-        summary: revision.summary.clone(),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Shows the commits at which the architecture's meaning changed.
 pub(crate) fn log(file: &Path, limit: usize, format: OutputFormat) -> CommandResult {
     let repository = repository_for(file)?;
     let options = casm_git::HistoryOptions::default().with_max_revisions(limit);
 
     let revisions = repository

*** result: Success
