*** crates/casm-cli/src/commands.rs:784:5: replace print_revisions with ()

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace print_revisions with ()
@@ -776,46 +776,17 @@
         OutputFormat::Human => print_revisions(file, revisions, node),
     }
 
     Ok(ExitCode::Success)
 }
 
 /// Prints revisions as prose.
 fn print_revisions(file: &Path, revisions: &[casm_git::Revision], node: Option<&str>) {
-    let subject = node.map_or_else(
-        || file.display().to_string(),
-        |name| format!("node '{name}' in {}", file.display()),
-    );
-
-    if revisions.is_empty() {
-        println!("no semantic changes recorded for {subject}");
-        return;
-    }
-
-    println!("{subject}\n");
-    for revision in revisions {
-        println!(
-            "{}  {}  {}",
-            revision.short_commit(),
-            revision.dated().to_date(),
-            revision.summary
-        );
-        println!("    {} <{}>", revision.author, revision.email);
-        println!("    fingerprint {}", revision.fingerprint.abbreviated(12));
-
-        if revision.introduced {
-            println!("    introduced here");
-        } else if !revision.changed_nodes.is_empty() {
-            println!("    nodes: {}", revision.changed_nodes.join(", "));
-        }
-        println!();
-    }
-
-    println!("{} semantic change(s)", revisions.len());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Prints an architecture as it was at a past revision.
 pub(crate) fn checkout(revision: &str, file: &Path, validate_it: bool) -> CommandResult {
     let repository = repository_for(file)?;
     let source = repository
         .read_at(revision, file)
         .map_err(|error| CommandError(error.to_string()))?;

*** result: Success
