*** crates/casm-cli/src/commands.rs:876:5: replace walk -> Result<(), CommandError> with Ok(())

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace walk -> Result<(), CommandError> with Ok(())
@@ -868,39 +868,17 @@
 /// The maximum directory depth `check` will descend.
 ///
 /// NASA Rule 4: the recursion needs a statically provable bound. Eight levels reaches
 /// any sanely-organised repository and cannot be driven into a symlink loop.
 const MAX_WALK_DEPTH: usize = 8;
 
 /// Recursively collects architecture files, bounded by [`MAX_WALK_DEPTH`].
 fn walk(directory: &Path, depth: usize, found: &mut Vec<PathBuf>) -> Result<(), CommandError> {
-    if depth > MAX_WALK_DEPTH {
-        return Ok(());
-    }
-
-    let entries = std::fs::read_dir(directory)
-        .map_err(|error| CommandError(format!("cannot read '{}': {error}", directory.display())))?;
-
-    for entry in entries.flatten() {
-        let path = entry.path();
-        let name = entry.file_name().to_string_lossy().to_string();
-
-        if name.starts_with('.') || name == "target" || name == "node_modules" {
-            continue;
-        }
-
-        if path.is_dir() {
-            walk(&path, depth.saturating_add(1), found)?;
-        } else if Format::from_path(&path).is_some() && is_architecture_file(&path) {
-            found.push(path);
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns `true` if `path` looks like a CASIMIR architecture rather than any old YAML.
 ///
 /// Checked by content, not by filename: a repository is full of YAML that is not an
 /// architecture, and `check` reporting parse failures for every CI workflow file would
 /// make it useless.
 fn is_architecture_file(path: &Path) -> bool {

---- commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span stdout ----
no architecture files found under '/tmp/casm-cli-check-telemetry-broken-019fd1cd-00b3-70e0-9de4-b0270b883e69'

thread 'commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span' (336992) panicked at crates/casm-cli/src/commands.rs:1458:9:
assertion `left == right` failed
  left: 0
 right: 1

---- commands::tests::check_reports_a_failure_for_an_unparseable_file stdout ----
no architecture files found under '/tmp/casm-cli-broken-019fd1cd-00b3-70e0-9de4-b03176dc7e66'

thread 'commands::tests::check_reports_a_failure_for_an_unparseable_file' (336996) panicked at crates/casm-cli/src/commands.rs:1092:9:
assertion `left == right` failed
  left: 0
 right: 3

---- commands::tests::discovery_descends_into_subdirectories stdout ----

thread 'commands::tests::discovery_descends_into_subdirectories' (336999) panicked at crates/casm-cli/src/commands.rs:1046:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span
    commands::tests::check_reports_a_failure_for_an_unparseable_file
    commands::tests::discovery_descends_into_subdirectories
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml
    commands::tests::discovery_reports_an_unreadable_directory
    commands::tests::the_check_sweep_records_a_span_for_every_file

test result: FAILED. 69 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
