*** crates/casm-cli/src/commands.rs:887:54: replace || with && in walk

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace || with && in walk
@@ -879,17 +879,17 @@
 
     let entries = std::fs::read_dir(directory)
         .map_err(|error| CommandError(format!("cannot read '{}': {error}", directory.display())))?;
 
     for entry in entries.flatten() {
         let path = entry.path();
         let name = entry.file_name().to_string_lossy().to_string();
 
-        if name.starts_with('.') || name == "target" || name == "node_modules" {
+        if name.starts_with('.') || name == "target" && /* ~ changed by cargo-mutants ~ */ name == "node_modules" {
             continue;
         }
 
         if path.is_dir() {
             walk(&path, depth.saturating_add(1), found)?;
         } else if Format::from_path(&path).is_some() && is_architecture_file(&path) {
             found.push(path);
         }

---- commands::tests::discovery_skips_build_and_dot_directories stdout ----

thread 'commands::tests::discovery_skips_build_and_dot_directories' (337875) panicked at crates/casm-cli/src/commands.rs:1053:9:
assertion failed: discover(&dir).unwrap().is_empty()

failures:
    commands::tests::discovery_skips_build_and_dot_directories

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
