*** crates/casm-cli/src/commands.rs:887:62: replace == with != in walk

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace == with != in walk
@@ -879,17 +879,17 @@
 
     let entries = std::fs::read_dir(directory)
         .map_err(|error| CommandError(format!("cannot read '{}': {error}", directory.display())))?;
 
     for entry in entries.flatten() {
         let path = entry.path();
         let name = entry.file_name().to_string_lossy().to_string();
 
-        if name.starts_with('.') || name == "target" || name == "node_modules" {
+        if name.starts_with('.') || name == "target" || name != /* ~ changed by cargo-mutants ~ */ "node_modules" {
             continue;
         }
 
         if path.is_dir() {
             walk(&path, depth.saturating_add(1), found)?;
         } else if Format::from_path(&path).is_some() && is_architecture_file(&path) {
             found.push(path);
         }

---- commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span stdout ----
no architecture files found under '/tmp/casm-cli-check-telemetry-broken-019fd1cd-1770-7702-bb5e-00bfe6e776f9'

thread 'commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span' (339129) panicked at crates/casm-cli/src/commands.rs:1480:9:
assertion `left == right` failed
  left: 0
 right: 1

---- commands::tests::check_reports_a_failure_for_an_unparseable_file stdout ----
no architecture files found under '/tmp/casm-cli-broken-019fd1cd-1771-71e2-a408-1caf60892d0c'

thread 'commands::tests::check_reports_a_failure_for_an_unparseable_file' (339143) panicked at crates/casm-cli/src/commands.rs:1114:9:
assertion `left == right` failed
  left: 0
 right: 3

---- commands::tests::discovery_descends_into_subdirectories stdout ----

thread 'commands::tests::discovery_descends_into_subdirectories' (339148) panicked at crates/casm-cli/src/commands.rs:1068:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span
    commands::tests::check_reports_a_failure_for_an_unparseable_file
    commands::tests::discovery_descends_into_subdirectories
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml
    commands::tests::the_check_sweep_records_a_span_for_every_file

test result: FAILED. 70 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
