*** crates/casm-cli/src/commands.rs:893:54: replace && with || in walk

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace && with || in walk
@@ -885,17 +885,17 @@
         let name = entry.file_name().to_string_lossy().to_string();
 
         if name.starts_with('.') || name == "target" || name == "node_modules" {
             continue;
         }
 
         if path.is_dir() {
             walk(&path, depth.saturating_add(1), found)?;
-        } else if Format::from_path(&path).is_some() && is_architecture_file(&path) {
+        } else if Format::from_path(&path).is_some() || /* ~ changed by cargo-mutants ~ */ is_architecture_file(&path) {
             found.push(path);
         }
     }
 
     Ok(())
 }
 
 /// Returns `true` if `path` looks like a CASIMIR architecture rather than any old YAML.

---- commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml stdout ----

thread 'commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml' (339090) panicked at crates/casm-cli/src/commands.rs:1034:9:
assertion `left == right` failed: found ["/tmp/casm-cli-discover-019fd1cd-1764-7260-8dc6-1b97a3902768/architecture.yaml", "/tmp/casm-cli-discover-019fd1cd-1764-7260-8dc6-1b97a3902768/ci.yaml"]
  left: 2
 right: 1

failures:
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
