*** crates/casm-cli/src/commands.rs:907:5: replace is_architecture_file -> bool with false

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace is_architecture_file -> bool with false
@@ -899,20 +899,17 @@
 }
 
 /// Returns `true` if `path` looks like a CASIMIR architecture rather than any old YAML.
 ///
 /// Checked by content, not by filename: a repository is full of YAML that is not an
 /// architecture, and `check` reporting parse failures for every CI workflow file would
 /// make it useless.
 fn is_architecture_file(path: &Path) -> bool {
-    let Ok(source) = std::fs::read_to_string(path) else {
-        return false;
-    };
-    source.contains("nodes") && (source.contains("relationships") || source.contains("name"))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- commands::tests::check_reports_a_failure_for_an_unparseable_file stdout ----
no architecture files found under '/tmp/casm-cli-broken-019fd1cd-1a67-7f43-8a47-c68ab3a5a6dc'

thread 'commands::tests::check_reports_a_failure_for_an_unparseable_file' (339345) panicked at crates/casm-cli/src/commands.rs:1111:9:
assertion `left == right` failed
  left: 0
 right: 3

---- commands::tests::discovery_descends_into_subdirectories stdout ----

thread 'commands::tests::discovery_descends_into_subdirectories' (339348) panicked at crates/casm-cli/src/commands.rs:1065:9:
assertion `left == right` failed
  left: 0
 right: 1

---- commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml stdout ----

thread 'commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml' (339349) panicked at crates/casm-cli/src/commands.rs:1031:9:
assertion `left == right` failed: found []
  left: 0
 right: 1

failures:
    commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span
    commands::tests::check_reports_a_failure_for_an_unparseable_file
    commands::tests::discovery_descends_into_subdirectories
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml
    commands::tests::the_check_sweep_records_a_span_for_every_file

test result: FAILED. 70 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
