*** crates/casm-cli/src/exit.rs:35:9: replace ExitCode::code -> i32 with 0

*** mutation diff:
--- crates/casm-cli/src/exit.rs
+++ replace ExitCode::code -> i32 with 0
@@ -27,17 +27,17 @@
     /// wrong" apart from "the tool could not run", which need different responses.
     Failure = 3,
 }
 
 impl ExitCode {
     /// The numeric status to hand to the operating system.
     #[must_use]
     pub(crate) const fn code(self) -> i32 {
-        self as i32
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Maps a validator report's code onto an `ExitCode`.
     ///
     /// The mapping lives here rather than in the validator so that the CLI is the only
     /// place that knows about process semantics.
     #[must_use]
     pub(crate) const fn from_report_code(code: i32) -> Self {

---- exit::tests::codes_match_the_documented_contract stdout ----

thread 'exit::tests::codes_match_the_documented_contract' (340315) panicked at crates/casm-cli/src/exit.rs:65:9:
assertion `left == right` failed
  left: 0
 right: 1

---- exit::tests::tool_failure_is_distinguishable_from_validation_failure stdout ----

thread 'exit::tests::tool_failure_is_distinguishable_from_validation_failure' (340317) panicked at crates/casm-cli/src/exit.rs:87:9:
assertion `left != right` failed
  left: 0
 right: 0

---- commands::tests::validate_checks_conformance_when_patterns_are_supplied stdout ----
/tmp/casm-cli-validate-patterns-019fd1cd-233a-7fe3-9989-55d5569b1a24/architecture.yaml: demo v0.1.0 — 3 node(s), 2 relationship(s)

warning[services-require-security-controls]: node 'orders': declares 0 security control(s) but 2 are required
  help: add 2 more control(s) with 'type: security' describing how this node is authenticated, authorised, and encrypted

warning[stateful-nodes-require-controls]: node 'orders-db': is a database holding persistent state but declares no controls
  help: declare controls covering encryption at rest, backup and restore, and access restriction

0 error(s), 2 warning(s), 0 info

thread 'commands::tests::validate_checks_conformance_when_patterns_are_supplied' (340312) panicked at crates/casm-cli/src/commands.rs:1290:9:
assertion `left != right` failed
  left: 0

failures:
    commands::tests::validate_checks_conformance_when_patterns_are_supplied
    exit::tests::codes_match_the_documented_contract
    exit::tests::tool_failure_is_distinguishable_from_validation_failure

test result: FAILED. 72 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
