*** crates/casm-cli/src/exit.rs:35:9: replace ExitCode::code -> i32 with 1

*** mutation diff:
--- crates/casm-cli/src/exit.rs
+++ replace ExitCode::code -> i32 with 1
@@ -27,17 +27,17 @@
     /// wrong" apart from "the tool could not run", which need different responses.
     Failure = 3,
 }
 
 impl ExitCode {
     /// The numeric status to hand to the operating system.
     #[must_use]
     pub(crate) const fn code(self) -> i32 {
-        self as i32
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Maps a validator report's code onto an `ExitCode`.
     ///
     /// The mapping lives here rather than in the validator so that the CLI is the only
     /// place that knows about process semantics.
     #[must_use]
     pub(crate) const fn from_report_code(code: i32) -> Self {

---- commands::tests::check_returns_success_when_nothing_is_found stdout ----
no architecture files found under '/tmp/casm-cli-empty-019fd1cd-2543-78a0-b9df-a30426e551d5'

thread 'commands::tests::check_returns_success_when_nothing_is_found' (340386) panicked at crates/casm-cli/src/commands.rs:1096:9:
assertion `left == right` failed
  left: 1
 right: 0

---- commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim stdout ----
/tmp/casm-cli-evolve-to-019fd1cd-2544-7073-b9ec-90828578319c/architecture.yaml: 1 pattern(s)

scaffold-shape@1.0.0: conforms
conforms to every pattern claimed

thread 'commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim' (340393) panicked at crates/casm-cli/src/commands.rs:1225:9:
assertion `left == right` failed
  left: 1
 right: 0

---- commands::tests::evolve_reports_conformance_for_a_claim_the_architecture_satisfies stdout ----
/tmp/casm-cli-evolve-ok-019fd1cd-2544-7073-b9ec-90a8efa872ad/architecture.yaml: 1 pattern(s)

scaffold-shape@1.0.0: conforms
conforms to every pattern claimed

thread 'commands::tests::evolve_reports_conformance_for_a_claim_the_architecture_satisfies' (340397) panicked at crates/casm-cli/src/commands.rs:1207:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    commands::tests::check_returns_success_when_nothing_is_found
    commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim
    commands::tests::evolve_fails_under_strict_when_a_requirement_is_unmet
    commands::tests::evolve_reports_conformance_for_a_claim_the_architecture_satisfies
    commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one
    commands::tests::evolve_with_no_claims_and_no_target_succeeds_quietly
    commands::tests::validate_checks_conformance_when_patterns_are_supplied
    exit::tests::codes_match_the_documented_contract
    exit::tests::tool_failure_is_distinguishable_from_validation_failure
    tests::dispatch_routes_the_rules_command

test result: FAILED. 65 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
