*** crates/casm-cli/src/exit.rs:35:9: replace ExitCode::code -> i32 with -1

*** mutation diff:
--- crates/casm-cli/src/exit.rs
+++ replace ExitCode::code -> i32 with -1
@@ -27,17 +27,17 @@
     /// wrong" apart from "the tool could not run", which need different responses.
     Failure = 3,
 }
 
 impl ExitCode {
     /// The numeric status to hand to the operating system.
     #[must_use]
     pub(crate) const fn code(self) -> i32 {
-        self as i32
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Maps a validator report's code onto an `ExitCode`.
     ///
     /// The mapping lives here rather than in the validator so that the CLI is the only
     /// place that knows about process semantics.
     #[must_use]
     pub(crate) const fn from_report_code(code: i32) -> Self {

---- commands::tests::check_returns_success_when_nothing_is_found stdout ----
no architecture files found under '/tmp/casm-cli-empty-019fd1cd-2d22-7ad1-afd1-10e77cb749e4'

thread 'commands::tests::check_returns_success_when_nothing_is_found' (341252) panicked at crates/casm-cli/src/commands.rs:1096:9:
assertion `left == right` failed
  left: -1
 right: 0

---- commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim stdout ----
/tmp/casm-cli-evolve-to-019fd1cd-2d29-7d63-9001-f99886111c76/architecture.yaml: 1 pattern(s)

scaffold-shape@1.0.0: conforms
conforms to every pattern claimed

thread 'commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim' (341259) panicked at crates/casm-cli/src/commands.rs:1225:9:
assertion `left == right` failed
  left: -1
 right: 0

---- commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one stdout ----
/tmp/casm-cli-evolve-migrate-019fd1cd-2d34-7280-a2a3-2c7ebb083a05/architecture.yaml: 1 pattern(s)

shape@2.0.0: 1 unmet
  decide: role 'application' requires a 'service' and 2 could fill it: orders, payments

1 requirement(s) unmet
/tmp/casm-cli-evolve-migrate-019fd1cd-2d34-7280-a2a3-2c7ebb083a05/architecture.yaml: 1 pattern(s)

shape@2.0.0: conforms
conforms to every pattern claimed

thread 'commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one' (341264) panicked at crates/casm-cli/src/commands.rs:1334:9:
assertion `left == right` failed: the 1.0.0 binding should carry over to 2.0.0

failures:
    commands::tests::check_returns_success_when_nothing_is_found
    commands::tests::evolve_checks_a_pattern_the_architecture_does_not_yet_claim
    commands::tests::evolve_fails_under_strict_when_a_requirement_is_unmet
    commands::tests::evolve_reports_conformance_for_a_claim_the_architecture_satisfies
    commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one
    commands::tests::evolve_with_no_claims_and_no_target_succeeds_quietly
    commands::tests::validate_checks_conformance_when_patterns_are_supplied
    exit::tests::codes_match_the_documented_contract
    exit::tests::tool_failure_is_distinguishable_from_validation_failure
    tests::dispatch_routes_the_rules_command
    tests::every_exit_code_survives_the_narrowing_conversion

test result: FAILED. 64 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
