*** crates/casm-cli/src/exit.rs:45:13: delete match arm 0 in ExitCode::from_report_code

*** mutation diff:
--- crates/casm-cli/src/exit.rs
+++ delete match arm 0 in ExitCode::from_report_code
@@ -37,17 +37,17 @@
 
     /// Maps a validator report's code onto an `ExitCode`.
     ///
     /// The mapping lives here rather than in the validator so that the CLI is the only
     /// place that knows about process semantics.
     #[must_use]
     pub(crate) const fn from_report_code(code: i32) -> Self {
         match code {
-            0 => Self::Success,
+             /* ~ changed by cargo-mutants ~ */
             1 => Self::Warnings,
             _ => Self::ValidationErrors,
         }
     }
 }
 
 #[cfg(test)]
 #[allow(

---- commands::tests::strict_mode_does_not_promote_a_clean_report stdout ----

thread 'commands::tests::strict_mode_does_not_promote_a_clean_report' (341197) panicked at crates/casm-cli/src/commands.rs:985:9:
assertion `left == right` failed
  left: ValidationErrors
 right: Success

---- commands::tests::the_check_sweep_records_a_span_for_every_file stdout ----
/tmp/casm-cli-check-telemetry-019fd1cd-2d06-7542-b07a-bcee812dea12/a.yaml: architecture is valid: 0 errors, 0 warnings
/tmp/casm-cli-check-telemetry-019fd1cd-2d06-7542-b07a-bcee812dea12/b.yaml: architecture is valid: 0 errors, 0 warnings

checked 2 of 2 file(s)

thread 'commands::tests::the_check_sweep_records_a_span_for_every_file' (341199) panicked at crates/casm-cli/src/commands.rs:1449:9:
assertion `left == right` failed
  left: ValidationErrors
 right: Success

---- exit::tests::report_codes_map_onto_exit_codes stdout ----

thread 'exit::tests::report_codes_map_onto_exit_codes' (341206) panicked at crates/casm-cli/src/exit.rs:72:9:
assertion `left == right` failed
  left: ValidationErrors
 right: Success

failures:
    commands::tests::strict_mode_does_not_promote_a_clean_report
    commands::tests::the_check_sweep_records_a_span_for_every_file
    exit::tests::report_codes_map_onto_exit_codes

test result: FAILED. 72 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
