*** crates/casm-cli/src/exit.rs:46:13: delete match arm 1 in ExitCode::from_report_code

*** mutation diff:
--- crates/casm-cli/src/exit.rs
+++ delete match arm 1 in ExitCode::from_report_code
@@ -38,17 +38,17 @@
     /// Maps a validator report's code onto an `ExitCode`.
     ///
     /// The mapping lives here rather than in the validator so that the CLI is the only
     /// place that knows about process semantics.
     #[must_use]
     pub(crate) const fn from_report_code(code: i32) -> Self {
         match code {
             0 => Self::Success,
-            1 => Self::Warnings,
+             /* ~ changed by cargo-mutants ~ */
             _ => Self::ValidationErrors,
         }
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,

---- commands::tests::strict_mode_promotes_warnings_to_a_failing_exit_code stdout ----

thread 'commands::tests::strict_mode_promotes_warnings_to_a_failing_exit_code' (341356) panicked at crates/casm-cli/src/commands.rs:979:9:
assertion `left == right` failed
  left: ValidationErrors
 right: Warnings

---- exit::tests::report_codes_map_onto_exit_codes stdout ----

thread 'exit::tests::report_codes_map_onto_exit_codes' (341364) panicked at crates/casm-cli/src/exit.rs:73:9:
assertion `left == right` failed
  left: ValidationErrors
 right: Warnings

failures:
    commands::tests::strict_mode_promotes_warnings_to_a_failing_exit_code
    exit::tests::report_codes_map_onto_exit_codes

test result: FAILED. 73 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
