*** crates/casm-cli/src/hook.rs:106:5: replace make_executable -> std::io::Result<()> with Ok(())

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ replace make_executable -> std::io::Result<()> with Ok(())
@@ -98,20 +98,17 @@
 }
 
 /// Makes a file executable on Unix.
 ///
 /// Git ignores a hook that is not executable, silently — so an install that skipped this
 /// would appear to succeed and do nothing.
 #[cfg(unix)]
 fn make_executable(path: &Path) -> std::io::Result<()> {
-    use std::os::unix::fs::PermissionsExt as _;
-    let mut permissions = std::fs::metadata(path)?.permissions();
-    permissions.set_mode(0o755);
-    std::fs::set_permissions(path, permissions)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Windows has no executable bit; Git runs hooks through its bundled shell regardless.
 #[cfg(not(unix))]
 fn make_executable(_path: &Path) -> std::io::Result<()> {
     Ok(())
 }

---- hook::tests::the_installed_hook_is_executable stdout ----

thread 'hook::tests::the_installed_hook_is_executable' (342531) panicked at crates/casm-cli/src/hook.rs:217:9:
assertion `left == right` failed: mode was 100664
  left: 0
 right: 73

failures:
    hook::tests::the_installed_hook_is_executable

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
