*** crates/casm-cli/src/hook.rs:127:17: replace == with != in install

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ replace == with != in install
@@ -119,17 +119,17 @@
 ///
 /// # Errors
 ///
 /// Returns a human-readable message if a foreign hook is present without `force`, or if
 /// the file cannot be written.
 pub(crate) fn install(git_dir: &Path, force: bool) -> Result<Status, String> {
     let existing = status(git_dir);
 
-    if existing == Status::Foreign && !force {
+    if existing != /* ~ changed by cargo-mutants ~ */ Status::Foreign && !force {
         return Err(format!(
             "'{}' already exists and was not written by CASIMIR.\n\
              Inspect it first, then pass --force to replace it.",
             hook_path(git_dir).display()
         ));
     }
 
     let directory = hooks_directory(git_dir);

---- hook::tests::a_foreign_hook_is_never_clobbered_without_force stdout ----

thread 'hook::tests::a_foreign_hook_is_never_clobbered_without_force' (343449) panicked at crates/casm-cli/src/hook.rs:245:48:
called `Result::unwrap_err()` on an `Ok` value: Foreign

---- hook::tests::installing_creates_the_hook_and_reports_it stdout ----

thread 'hook::tests::installing_creates_the_hook_and_reports_it' (343452) panicked at crates/casm-cli/src/hook.rs:200:9:
assertion `left == right` failed
  left: Err("'/tmp/casm-hook-install-019fd1cd-4614-7490-982a-a3b23c60c33e/hooks/pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it.")
 right: Ok(Absent)

---- hook::tests::installing_twice_is_idempotent stdout ----

thread 'hook::tests::installing_twice_is_idempotent' (343453) panicked at crates/casm-cli/src/hook.rs:228:36:
called `Result::unwrap()` on an `Err` value: "'/tmp/casm-hook-twice-019fd1cd-4617-76d3-a45f-c416714ad42b/hooks/pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it."

failures:
    hook::tests::a_foreign_hook_is_never_clobbered_without_force
    hook::tests::installing_creates_the_hook_and_reports_it
    hook::tests::installing_twice_is_idempotent
    hook::tests::the_installed_hook_is_executable
    hook::tests::the_installed_script_is_accepted_by_the_shell
    hook::tests::uninstalling_removes_only_our_own_hook

test result: FAILED. 69 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
