*** crates/casm-cli/src/hook.rs:127:36: replace && with || in install

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ replace && with || in install
@@ -119,17 +119,17 @@
 ///
 /// # Errors
 ///
 /// Returns a human-readable message if a foreign hook is present without `force`, or if
 /// the file cannot be written.
 pub(crate) fn install(git_dir: &Path, force: bool) -> Result<Status, String> {
     let existing = status(git_dir);
 
-    if existing == Status::Foreign && !force {
+    if existing == Status::Foreign || /* ~ changed by cargo-mutants ~ */ !force {
         return Err(format!(
             "'{}' already exists and was not written by CASIMIR.\n\
              Inspect it first, then pass --force to replace it.",
             hook_path(git_dir).display()
         ));
     }
 
     let directory = hooks_directory(git_dir);

---- hook::tests::installing_twice_is_idempotent stdout ----

thread 'hook::tests::installing_twice_is_idempotent' (343353) panicked at crates/casm-cli/src/hook.rs:228:36:
called `Result::unwrap()` on an `Err` value: "'/tmp/casm-hook-twice-019fd1cd-4549-7e91-b379-a3220731b1af/hooks/pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it."

---- hook::tests::force_replaces_a_foreign_hook stdout ----

thread 'hook::tests::force_replaces_a_foreign_hook' (343351) panicked at crates/casm-cli/src/hook.rs:263:9:
assertion `left == right` failed
  left: Err("'/tmp/casm-hook-force-019fd1cd-4549-7e91-b379-a31304e1a5e0/hooks/pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it.")
 right: Ok(Foreign)

---- hook::tests::installing_creates_the_hook_and_reports_it stdout ----

thread 'hook::tests::installing_creates_the_hook_and_reports_it' (343352) panicked at crates/casm-cli/src/hook.rs:200:9:
assertion `left == right` failed
  left: Err("'/tmp/casm-hook-install-019fd1cd-454b-7070-91a3-cb33cc31983e/hooks/pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it.")
 right: Ok(Absent)

failures:
    hook::tests::force_replaces_a_foreign_hook
    hook::tests::installing_creates_the_hook_and_reports_it
    hook::tests::installing_twice_is_idempotent
    hook::tests::the_installed_hook_is_executable
    hook::tests::the_installed_script_is_accepted_by_the_shell
    hook::tests::uninstalling_removes_only_our_own_hook

test result: FAILED. 69 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
