*** crates/casm-cli/src/hook.rs:127:39: delete ! in install

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ delete ! in install
@@ -119,17 +119,17 @@
 ///
 /// # Errors
 ///
 /// Returns a human-readable message if a foreign hook is present without `force`, or if
 /// the file cannot be written.
 pub(crate) fn install(git_dir: &Path, force: bool) -> Result<Status, String> {
     let existing = status(git_dir);
 
-    if existing == Status::Foreign && !force {
+    if existing == Status::Foreign &&  /* ~ changed by cargo-mutants ~ */force {
         return Err(format!(
             "'{}' already exists and was not written by CASIMIR.\n\
              Inspect it first, then pass --force to replace it.",
             hook_path(git_dir).display()
         ));
     }
 
     let directory = hooks_directory(git_dir);

---- hook::tests::a_foreign_hook_is_never_clobbered_without_force stdout ----

thread 'hook::tests::a_foreign_hook_is_never_clobbered_without_force' (343610) panicked at crates/casm-cli/src/hook.rs:245:48:
called `Result::unwrap_err()` on an `Ok` value: Foreign

---- hook::tests::force_replaces_a_foreign_hook stdout ----

thread 'hook::tests::force_replaces_a_foreign_hook' (343612) panicked at crates/casm-cli/src/hook.rs:263:9:
assertion `left == right` failed
  left: Err("'/tmp/casm-hook-force-019fd1cd-4a0b-71b2-81dc-588975199edf/hooks/pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it.")
 right: Ok(Foreign)

failures:
    hook::tests::a_foreign_hook_is_never_clobbered_without_force
    hook::tests::force_replaces_a_foreign_hook

test result: FAILED. 73 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
