*** crates/casm-cli/src/hook.rs:71:5: replace hooks_directory -> PathBuf with Default::default()

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ replace hooks_directory -> PathBuf with Default::default()
@@ -63,17 +63,17 @@
 fi
 
 exit 0
 "#;
 
 /// Where a repository keeps its hooks.
 #[must_use]
 pub(crate) fn hooks_directory(git_dir: &Path) -> PathBuf {
-    git_dir.join("hooks")
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The pre-commit hook's path within a repository.
 #[must_use]
 pub(crate) fn hook_path(git_dir: &Path) -> PathBuf {
     hooks_directory(git_dir).join("pre-commit")
 }

---- hook::tests::a_foreign_hook_is_never_clobbered_without_force stdout ----

thread 'hook::tests::a_foreign_hook_is_never_clobbered_without_force' (341465) panicked at crates/casm-cli/src/hook.rs:247:9:
the existing hook was modified

---- hook::tests::installing_creates_the_hook_and_reports_it stdout ----

thread 'hook::tests::installing_creates_the_hook_and_reports_it' (341468) panicked at crates/casm-cli/src/hook.rs:200:9:
assertion `left == right` failed
  left: Err("'pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it.")
 right: Ok(Absent)

---- hook::tests::a_fresh_repository_has_no_hook stdout ----

thread 'hook::tests::a_fresh_repository_has_no_hook' (341466) panicked at crates/casm-cli/src/hook.rs:192:9:
assertion `left == right` failed
  left: Installed
 right: Absent

failures:
    hook::tests::a_foreign_hook_is_never_clobbered_without_force
    hook::tests::a_fresh_repository_has_no_hook
    hook::tests::installing_creates_the_hook_and_reports_it
    hook::tests::uninstalling_removes_only_our_own_hook
    hook::tests::uninstalling_when_absent_is_not_an_error

test result: FAILED. 70 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
