*** crates/casm-cli/src/hook.rs:77:5: replace hook_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ replace hook_path -> PathBuf with Default::default()
@@ -69,17 +69,17 @@
 #[must_use]
 pub(crate) fn hooks_directory(git_dir: &Path) -> PathBuf {
     git_dir.join("hooks")
 }
 
 /// The pre-commit hook's path within a repository.
 #[must_use]
 pub(crate) fn hook_path(git_dir: &Path) -> PathBuf {
-    hooks_directory(git_dir).join("pre-commit")
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// What is currently installed at the hook path.
 #[derive(Clone, Copy, Debug, PartialEq, Eq)]
 pub(crate) enum Status {
     /// No pre-commit hook exists.
     Absent,
     /// CASIMIR's hook is installed.

---- hook::tests::installing_twice_is_idempotent stdout ----

thread 'hook::tests::installing_twice_is_idempotent' (342255) panicked at crates/casm-cli/src/hook.rs:228:36:
called `Result::unwrap()` on an `Err` value: "cannot write '': No such file or directory (os error 2)"

---- hook::tests::installing_creates_the_hook_and_reports_it stdout ----

thread 'hook::tests::installing_creates_the_hook_and_reports_it' (342254) panicked at crates/casm-cli/src/hook.rs:200:9:
assertion `left == right` failed
  left: Err("cannot write '': No such file or directory (os error 2)")
 right: Ok(Absent)

---- hook::tests::the_installed_hook_is_executable stdout ----

thread 'hook::tests::the_installed_hook_is_executable' (342256) panicked at crates/casm-cli/src/hook.rs:214:36:
called `Result::unwrap()` on an `Err` value: "cannot write '': No such file or directory (os error 2)"

failures:
    hook::tests::a_foreign_hook_is_never_clobbered_without_force
    hook::tests::force_replaces_a_foreign_hook
    hook::tests::installing_creates_the_hook_and_reports_it
    hook::tests::installing_twice_is_idempotent
    hook::tests::the_installed_hook_is_executable
    hook::tests::the_installed_script_is_accepted_by_the_shell
    hook::tests::uninstalling_refuses_to_remove_a_foreign_hook
    hook::tests::uninstalling_removes_only_our_own_hook

test result: FAILED. 67 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
