*** crates/casm-cli/src/hook.rs:95:25: replace match guard contents.contains(MARKER) with true in status

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ replace match guard contents.contains(MARKER) with true in status
@@ -87,17 +87,17 @@
     /// Someone else's hook is installed.
     Foreign,
 }
 
 /// Inspects the hook at `git_dir`.
 pub(crate) fn status(git_dir: &Path) -> Status {
     match std::fs::read_to_string(hook_path(git_dir)) {
         Err(_) => Status::Absent,
-        Ok(contents) if contents.contains(MARKER) => Status::Installed,
+        Ok(contents) if true /* ~ changed by cargo-mutants ~ */ => Status::Installed,
         Ok(_) => Status::Foreign,
     }
 }
 
 /// Makes a file executable on Unix.
 ///
 /// Git ignores a hook that is not executable, silently — so an install that skipped this
 /// would appear to succeed and do nothing.

---- hook::tests::a_foreign_hook_is_never_clobbered_without_force stdout ----

thread 'hook::tests::a_foreign_hook_is_never_clobbered_without_force' (342341) panicked at crates/casm-cli/src/hook.rs:244:9:
assertion `left == right` failed
  left: Installed
 right: Foreign

---- hook::tests::force_replaces_a_foreign_hook stdout ----

thread 'hook::tests::force_replaces_a_foreign_hook' (342343) panicked at crates/casm-cli/src/hook.rs:263:9:
assertion `left == right` failed
  left: Ok(Installed)
 right: Ok(Foreign)

---- hook::tests::uninstalling_refuses_to_remove_a_foreign_hook stdout ----

thread 'hook::tests::uninstalling_refuses_to_remove_a_foreign_hook' (342352) panicked at crates/casm-cli/src/hook.rs:287:9:
assertion failed: uninstall(&directory).is_err()

failures:
    hook::tests::a_foreign_hook_is_never_clobbered_without_force
    hook::tests::force_replaces_a_foreign_hook
    hook::tests::uninstalling_refuses_to_remove_a_foreign_hook

test result: FAILED. 72 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
