*** crates/casm-cli/src/hook.rs:95:25: replace match guard contents.contains(MARKER) with false in status

*** mutation diff:
--- crates/casm-cli/src/hook.rs
+++ replace match guard contents.contains(MARKER) with false in status
@@ -87,17 +87,17 @@
     /// Someone else's hook is installed.
     Foreign,
 }
 
 /// Inspects the hook at `git_dir`.
 pub(crate) fn status(git_dir: &Path) -> Status {
     match std::fs::read_to_string(hook_path(git_dir)) {
         Err(_) => Status::Absent,
-        Ok(contents) if contents.contains(MARKER) => Status::Installed,
+        Ok(contents) if false /* ~ changed by cargo-mutants ~ */ => Status::Installed,
         Ok(_) => Status::Foreign,
     }
 }
 
 /// Makes a file executable on Unix.
 ///
 /// Git ignores a hook that is not executable, silently — so an install that skipped this
 /// would appear to succeed and do nothing.

---- hook::tests::force_replaces_a_foreign_hook stdout ----

thread 'hook::tests::force_replaces_a_foreign_hook' (342423) panicked at crates/casm-cli/src/hook.rs:264:9:
assertion `left == right` failed
  left: Foreign
 right: Installed

---- hook::tests::installing_creates_the_hook_and_reports_it stdout ----

thread 'hook::tests::installing_creates_the_hook_and_reports_it' (342424) panicked at crates/casm-cli/src/hook.rs:201:9:
assertion `left == right` failed
  left: Foreign
 right: Installed

---- hook::tests::installing_twice_is_idempotent stdout ----

thread 'hook::tests::installing_twice_is_idempotent' (342425) panicked at crates/casm-cli/src/hook.rs:229:9:
assertion `left == right` failed
  left: Err("'/tmp/casm-hook-twice-019fd1cd-38d4-7642-b601-6ef3c36f3e43/hooks/pre-commit' already exists and was not written by CASIMIR.\nInspect it first, then pass --force to replace it.")
 right: Ok(Installed)

failures:
    hook::tests::force_replaces_a_foreign_hook
    hook::tests::installing_creates_the_hook_and_reports_it
    hook::tests::installing_twice_is_idempotent
    hook::tests::uninstalling_removes_only_our_own_hook

test result: FAILED. 71 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
