*** crates/casm-cli/src/main.rs:110:5: replace summarise -> String with String::new()

*** mutation diff:
--- crates/casm-cli/src/main.rs
+++ replace summarise -> String with String::new()
@@ -102,20 +102,17 @@
         Ok(ExitCode::Success) => Severity::Info,
         Ok(ExitCode::Warnings) => Severity::Warn,
         Ok(ExitCode::ValidationErrors | ExitCode::Failure) | Err(_) => Severity::Error,
     }
 }
 
 /// One line describing how the command ended, for a log stream.
 fn summarise(name: &'static str, result: &CommandResult) -> String {
-    match result {
-        Ok(code) => format!("{name} finished with exit code {}", code.code()),
-        Err(error) => format!("{name} failed: {}", error.0),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Narrows an exit code into the byte the operating system accepts.
 ///
 /// Every code CASIMIR produces is already in `0..=3`; the clamp exists so the conversion
 /// is total and cannot panic (NASA Rule 3).
 fn clamp(code: i32) -> u8 {
     u8::try_from(code).unwrap_or(u8::MAX)

---- tests::every_run_records_one_event_correlated_with_its_span stdout ----
9 built-in rule(s):

  no-dependency-cycles
      blocking dependencies (sync, depends-on, composed, quantum-entangled) must be acyclic
  no-publicly-exposed-datastores
      external systems and humans must not connect directly to a database, queue, or store
  critical-path-within-budget
      the summed latency budget along the longest blocking path must stay within the SLO
  services-require-security-controls
      each service and gateway must declare at least the configured number of security controls
  stateful-nodes-require-controls
      nodes that hold state must declare at least one control
  boundary-crossings-require-controls

failures:
    tests::every_run_records_one_event_correlated_with_its_span

test result: FAILED. 74 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
