*** crates/casm-cli/src/main.rs:121:5: replace clamp -> u8 with 0

*** mutation diff:
--- crates/casm-cli/src/main.rs
+++ replace clamp -> u8 with 0
@@ -113,17 +113,17 @@
     }
 }
 
 /// Narrows an exit code into the byte the operating system accepts.
 ///
 /// Every code CASIMIR produces is already in `0..=3`; the clamp exists so the conversion
 /// is total and cannot panic (NASA Rule 3).
 fn clamp(code: i32) -> u8 {
-    u8::try_from(code).unwrap_or(u8::MAX)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Routes a parsed command line to its implementation.
 fn dispatch(cli: Cli, recorder: &mut Recorder) -> CommandResult {
     match cli.command {
         Command::Init {
             name,
             output,

---- tests::every_exit_code_survives_the_narrowing_conversion stdout ----

thread 'tests::every_exit_code_survives_the_narrowing_conversion' (323574) panicked at crates/casm-cli/src/main.rs:248:13:
assertion `left == right` failed: Warnings did not survive
  left: 0
 right: 1

---- tests::clamping_is_total_for_out_of_range_input stdout ----

thread 'tests::clamping_is_total_for_out_of_range_input' (323571) panicked at crates/casm-cli/src/main.rs:255:9:
assertion `left == right` failed
  left: 0
 right: 255

failures:
    tests::clamping_is_total_for_out_of_range_input
    tests::every_exit_code_survives_the_narrowing_conversion

test result: FAILED. 73 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
