*** crates/casm-cli/src/main.rs:88:5: replace outcome_of -> Outcome with Default::default()

*** mutation diff:
--- crates/casm-cli/src/main.rs
+++ replace outcome_of -> Outcome with Default::default()
@@ -80,20 +80,17 @@
 }
 
 /// How a command's result reads as a span outcome.
 ///
 /// Validation findings are *not* an error: the command did its job and reported what it
 /// found. Only a command that could not run is an error, which keeps a trace searchable
 /// for real failures rather than for architectures that need work.
 fn outcome_of(result: &CommandResult) -> Outcome {
-    match result {
-        Ok(_) => Outcome::Ok,
-        Err(_) => Outcome::Error,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// How a command's result reads as an event severity.
 ///
 /// Deliberately different from [`outcome_of`]. The span outcome answers "did the tool
 /// work"; the event severity answers "what did it find", which is what somebody filtering
 /// a log stream is asking. An architecture with errors is a healthy run of `casm` and an
 /// `ERROR` line in the log, and both readings are correct.

---- tests::a_failing_command_is_an_error_outcome_but_findings_are_not stdout ----

thread 'tests::a_failing_command_is_an_error_outcome_but_findings_are_not' (330960) panicked at crates/casm-cli/src/main.rs:333:9:
assertion `left == right` failed
  left: Unset
 right: Ok

---- tests::event_severity_reports_findings_where_the_span_outcome_reports_health stdout ----

thread 'tests::event_severity_reports_findings_where_the_span_outcome_reports_health' (330963) panicked at crates/casm-cli/src/main.rs:326:9:
assertion `left == right` failed
  left: Unset
 right: Ok

failures:
    tests::a_failing_command_is_an_error_outcome_but_findings_are_not
    tests::event_severity_reports_findings_where_the_span_outcome_reports_health

test result: FAILED. 73 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
