*** crates/casm-core/src/architecture.rs:103:9: replace ArchitectureConfig::conformance -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace ArchitectureConfig::conformance -> Self with Default::default()
@@ -95,18 +95,17 @@
     pub fn relationship(mut self, relationship: Relationship) -> Self {
         self.relationships.push(relationship);
         self
     }
 
     /// Stages a claim that this architecture conforms to a pattern.
     #[must_use]
     pub fn conformance(mut self, conformance: Conformance) -> Self {
-        self.conformance.push(conformance);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Attaches an arbitrary key/value annotation.
     #[must_use]
     pub fn metadata(mut self, key: impl Into<String>, value: impl Into<String>) -> Self {
         self.metadata.insert(key.into(), value.into());
         self
     }

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1526310) panicked at crates/casm-core/src/architecture.rs:1041:56:
called `Result::unwrap_err()` on an `Ok` value: None

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
