*** crates/casm-core/src/architecture.rs:247:9: replace Architecture::node_count -> usize with 1

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::node_count -> usize with 1
@@ -239,17 +239,17 @@
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }
 
     /// How many nodes this architecture contains.
     #[inline]
     #[must_use]
     pub fn node_count(&self) -> usize {
-        self.nodes.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many relationships this architecture contains.
     #[inline]
     #[must_use]
     pub fn relationship_count(&self) -> usize {
         self.relationships.len()
     }

---- architecture::tests::consuming_builders_compose stdout ----

thread 'architecture::tests::consuming_builders_compose' (1533447) panicked at crates/casm-core/src/architecture.rs:956:9:
assertion `left == right` failed
  left: 1
 right: 2

---- architecture::tests::removing_a_referenced_node_is_refused_with_a_count stdout ----

thread 'architecture::tests::removing_a_referenced_node_is_refused_with_a_count' (1533464) panicked at crates/casm-core/src/architecture.rs:818:9:
assertion `left == right` failed: the removal must not have happened
  left: 1
 right: 2

---- architecture::tests::removing_an_unreferenced_node_succeeds stdout ----

thread 'architecture::tests::removing_an_unreferenced_node_succeeds' (1533466) panicked at crates/casm-core/src/architecture.rs:834:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    architecture::tests::consuming_builders_compose
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count
    architecture::tests::removing_an_unreferenced_node_succeeds

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
