*** crates/casm-core/src/architecture.rs:254:9: replace Architecture::relationship_count -> usize with 1

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::relationship_count -> usize with 1
@@ -246,17 +246,17 @@
     pub fn node_count(&self) -> usize {
         self.nodes.len()
     }
 
     /// How many relationships this architecture contains.
     #[inline]
     #[must_use]
     pub fn relationship_count(&self) -> usize {
-        self.relationships.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the architecture contains no nodes.
     #[inline]
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.nodes.is_empty()
     }

---- architecture::tests::the_same_pair_may_be_connected_with_different_semantics stdout ----

thread 'architecture::tests::the_same_pair_may_be_connected_with_different_semantics' (354516) panicked at crates/casm-core/src/architecture.rs:767:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    architecture::tests::the_same_pair_may_be_connected_with_different_semantics

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
