*** crates/casm-core/src/architecture.rs:266:9: replace Architecture::nodes -> impl Iterator<Item =&Node> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::nodes -> impl Iterator<Item =&Node> with ::std::iter::empty()
@@ -258,17 +258,17 @@
     #[inline]
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.nodes.is_empty()
     }
 
     /// Iterates the nodes in insertion order.
     pub fn nodes(&self) -> impl Iterator<Item = &Node> {
-        self.nodes.values()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterates the relationships in insertion order.
     pub fn relationships(&self) -> impl Iterator<Item = &Relationship> {
         self.relationships.iter()
     }
 
     /// Iterates the pattern-conformance claims, in declaration order.

---- architecture::tests::node_iteration_order_is_stable_across_runs stdout ----

thread 'architecture::tests::node_iteration_order_is_stable_across_runs' (1538221) panicked at crates/casm-core/src/architecture.rs:850:9:
assertion `left == right` failed: insertion order must be preserved
  left: []
 right: ["api", "orders-db"]

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1538232) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1538233) panicked at crates/casm-core/src/conformance.rs:519:9:
[NoCandidate { role: "edge", node_type: "gateway" }, NoCandidate { role: "application", node_type: "service" }]

failures:
    architecture::tests::node_iteration_order_is_stable_across_runs
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_

test result: FAILED. 187 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
