*** crates/casm-core/src/architecture.rs:271:9: replace Architecture::relationships -> impl Iterator<Item =&Relationship> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::relationships -> impl Iterator<Item =&Relationship> with ::std::iter::empty()
@@ -263,17 +263,17 @@
 
     /// Iterates the nodes in insertion order.
     pub fn nodes(&self) -> impl Iterator<Item = &Node> {
         self.nodes.values()
     }
 
     /// Iterates the relationships in insertion order.
     pub fn relationships(&self) -> impl Iterator<Item = &Relationship> {
-        self.relationships.iter()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterates the pattern-conformance claims, in declaration order.
     pub fn conformance(&self) -> impl Iterator<Item = &Conformance> {
         self.conformance.iter()
     }
 
     /// How many patterns this architecture claims to conform to.

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1538947) panicked at crates/casm-core/src/conformance.rs:519:9:
[MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "sync" }]

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1538954) panicked at crates/casm-core/src/conformance.rs:583:9:
[MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "sync" }]

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (1539020) panicked at crates/casm-core/src/merkle.rs:871:9:
assertion `left != right` failed
  left: Fingerprint(bbd9b9036231…)
 right: Fingerprint(bbd9b9036231…)

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint
    merkle::tests::every_relationship_gets_its_own_entry_keyed_by_what_it_connects

test result: FAILED. 200 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
