*** crates/casm-core/src/architecture.rs:283:9: replace Architecture::conformance_count -> usize with 1

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::conformance_count -> usize with 1
@@ -275,17 +275,17 @@
     pub fn conformance(&self) -> impl Iterator<Item = &Conformance> {
         self.conformance.iter()
     }
 
     /// How many patterns this architecture claims to conform to.
     #[inline]
     #[must_use]
     pub fn conformance_count(&self) -> usize {
-        self.conformance.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Looks up a node by identifier.
     #[must_use]
     pub fn node(&self, id: NodeId) -> Option<&Node> {
         self.nodes.get(&id)
     }

---- architecture::tests::two_versions_of_one_pattern_may_both_be_claimed stdout ----

thread 'architecture::tests::two_versions_of_one_pattern_may_both_be_claimed' (1540729) panicked at crates/casm-core/src/architecture.rs:1023:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    architecture::tests::two_versions_of_one_pattern_may_both_be_claimed

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
