*** crates/casm-core/src/architecture.rs:320:47: replace == with != in Architecture::incoming

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::incoming
@@ -312,17 +312,17 @@
             .iter()
             .filter(move |edge| edge.source() == id)
     }
 
     /// Iterates the relationships terminating at `id`.
     pub fn incoming(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
         self.relationships
             .iter()
-            .filter(move |edge| edge.target() == id)
+            .filter(move |edge| edge.target() != /* ~ changed by cargo-mutants ~ */ id)
     }
 
     /// Counts every relationship touching `id` in either direction.
     #[must_use]
     pub fn degree(&self, id: NodeId) -> usize {
         self.relationships
             .iter()
             .filter(|edge| edge.source() == id || edge.target() == id)

---- architecture::tests::incoming_and_outgoing_partition_the_edges stdout ----

thread 'architecture::tests::incoming_and_outgoing_partition_the_edges' (365213) panicked at crates/casm-core/src/architecture.rs:786:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    architecture::tests::incoming_and_outgoing_partition_the_edges

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
