*** crates/casm-core/src/architecture.rs:326:9: replace Architecture::degree -> usize with 1

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::degree -> usize with 1
@@ -318,20 +318,17 @@
         self.relationships
             .iter()
             .filter(move |edge| edge.target() == id)
     }
 
     /// Counts every relationship touching `id` in either direction.
     #[must_use]
     pub fn degree(&self, id: NodeId) -> usize {
-        self.relationships
-            .iter()
-            .filter(|edge| edge.source() == id || edge.target() == id)
-            .count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the nodes with no relationships at all.
     ///
     /// An isolated node is usually either a modelling mistake or a component nobody
     /// remembers owning — both worth surfacing.
     #[must_use]
     pub fn isolated_nodes(&self) -> Vec<&Node> {

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1548459) panicked at crates/casm-core/src/architecture.rs:1040:9:
assertion failed: matches!(error, ArchitectureError::NodeStillReferenced { count: 1, .. })

---- architecture::tests::isolated_nodes_are_identified stdout ----

thread 'architecture::tests::isolated_nodes_are_identified' (1548474) panicked at crates/casm-core/src/architecture.rs:804:9:
assertion `left == right` failed
  left: 0
 right: 1

---- architecture::tests::removing_an_absent_node_is_not_an_error stdout ----

thread 'architecture::tests::removing_an_absent_node_is_not_an_error' (1548478) panicked at crates/casm-core/src/architecture.rs:837:57:
called `Result::unwrap()` on an `Err` value: NodeStillReferenced { id: "019fd215-3e36-7781-8055-14663a1ef265", count: 1 }

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::isolated_nodes_are_identified
    architecture::tests::removing_an_absent_node_is_not_an_error
    architecture::tests::removing_an_unreferenced_node_succeeds

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
