*** crates/casm-core/src/architecture.rs:328:42: replace == with != in Architecture::degree

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::degree
@@ -320,17 +320,17 @@
             .filter(move |edge| edge.target() == id)
     }
 
     /// Counts every relationship touching `id` in either direction.
     #[must_use]
     pub fn degree(&self, id: NodeId) -> usize {
         self.relationships
             .iter()
-            .filter(|edge| edge.source() == id || edge.target() == id)
+            .filter(|edge| edge.source() != /* ~ changed by cargo-mutants ~ */ id || edge.target() == id)
             .count()
     }
 
     /// Returns the nodes with no relationships at all.
     ///
     /// An isolated node is usually either a modelling mistake or a component nobody
     /// remembers owning — both worth surfacing.
     #[must_use]

---- architecture::tests::isolated_nodes_are_identified stdout ----

thread 'architecture::tests::isolated_nodes_are_identified' (367292) panicked at crates/casm-core/src/architecture.rs:801:9:
assertion failed: architecture.isolated_nodes().is_empty()

---- architecture::tests::degree_counts_both_directions stdout ----

thread 'architecture::tests::degree_counts_both_directions' (367288) panicked at crates/casm-core/src/architecture.rs:794:9:
assertion `left == right` failed
  left: 0
 right: 1

---- architecture::tests::removing_a_referenced_node_is_refused_with_a_count stdout ----

thread 'architecture::tests::removing_a_referenced_node_is_refused_with_a_count' (367295) panicked at crates/casm-core/src/architecture.rs:816:22:
expected NodeStillReferenced, got Ok(Some(Node { id: NodeId(019fd1ce-5f31-7432-884a-322f896da0fc), name: Name("api"), node_type: Service, description: None, interfaces: [], controls: [], metadata: {} }))

failures:
    architecture::tests::degree_counts_both_directions
    architecture::tests::isolated_nodes_are_identified
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count
    architecture::tests::removing_an_absent_node_is_not_an_error
    architecture::tests::removing_an_unreferenced_node_succeeds

test result: FAILED. 183 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
