*** crates/casm-core/src/architecture.rs:328:65: replace == with != in Architecture::degree

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::degree
@@ -320,17 +320,17 @@
             .filter(move |edge| edge.target() == id)
     }
 
     /// Counts every relationship touching `id` in either direction.
     #[must_use]
     pub fn degree(&self, id: NodeId) -> usize {
         self.relationships
             .iter()
-            .filter(|edge| edge.source() == id || edge.target() == id)
+            .filter(|edge| edge.source() == id || edge.target() != /* ~ changed by cargo-mutants ~ */ id)
             .count()
     }
 
     /// Returns the nodes with no relationships at all.
     ///
     /// An isolated node is usually either a modelling mistake or a component nobody
     /// remembers owning — both worth surfacing.
     #[must_use]

---- architecture::tests::degree_counts_both_directions stdout ----

thread 'architecture::tests::degree_counts_both_directions' (1550321) panicked at crates/casm-core/src/architecture.rs:795:9:
assertion `left == right` failed
  left: 0
 right: 1

---- architecture::tests::isolated_nodes_are_identified stdout ----

thread 'architecture::tests::isolated_nodes_are_identified' (1550327) panicked at crates/casm-core/src/architecture.rs:801:9:
assertion failed: architecture.isolated_nodes().is_empty()

---- architecture::tests::removing_an_absent_node_is_not_an_error stdout ----

thread 'architecture::tests::removing_an_absent_node_is_not_an_error' (1550337) panicked at crates/casm-core/src/architecture.rs:840:57:
called `Result::unwrap()` on an `Err` value: NodeStillReferenced { id: "019fd215-4795-7771-97a9-918a9b2dd417", count: 1 }

failures:
    architecture::tests::degree_counts_both_directions
    architecture::tests::isolated_nodes_are_identified
    architecture::tests::removing_an_absent_node_is_not_an_error
    architecture::tests::removing_an_unreferenced_node_succeeds

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
