*** crates/casm-core/src/architecture.rs:351:9: replace Architecture::add_node -> Result<(), ArchitectureError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::add_node -> Result<(), ArchitectureError> with Ok(())
@@ -343,32 +343,17 @@
 
     /// Inserts a node, enforcing name and identifier uniqueness.
     ///
     /// # Errors
     ///
     /// - [`ArchitectureError::DuplicateId`] if the identifier is already present.
     /// - [`ArchitectureError::DuplicateName`] if the name is already taken.
     pub fn add_node(&mut self, node: Node) -> Result<(), ArchitectureError> {
-        if self.nodes.contains_key(&node.id()) {
-            return Err(ArchitectureError::DuplicateId {
-                id: node.id().to_string(),
-                architecture: self.name.as_str().to_owned(),
-            });
-        }
-
-        if self.node_by_name(node.name().as_str()).is_some() {
-            return Err(ArchitectureError::DuplicateName {
-                name: node.name().as_str().to_owned(),
-                architecture: self.name.as_str().to_owned(),
-            });
-        }
-
-        self.nodes.insert(node.id(), node);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Inserts a relationship, enforcing referential integrity and uniqueness.
     ///
     /// # Errors
     ///
     /// - [`ArchitectureError::DanglingReference`] if either endpoint is absent. The
     ///   `endpoint` field names which end failed, so the caller can point at it.

---- architecture::tests::a_binding_to_an_absent_node_is_rejected stdout ----

thread 'architecture::tests::a_binding_to_an_absent_node_is_rejected' (370893) panicked at crates/casm-core/src/architecture.rs:608:14:
sample architecture is valid: DanglingReference { endpoint: "source", id: "019fd1ce-6f14-73f1-b954-a9b779b31899", architecture: "checkout" }

---- architecture::tests::a_dangling_target_is_rejected_and_named_as_such stdout ----

thread 'architecture::tests::a_dangling_target_is_rejected_and_named_as_such' (370897) panicked at crates/casm-core/src/architecture.rs:723:9:
assertion failed: matches!(err, ArchitectureError::DanglingReference { endpoint: "target", .. })

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (370894) panicked at crates/casm-core/src/architecture.rs:984:14:
called `Result::unwrap()` on an `Err` value: DanglingBinding { pattern: "p@1.0.0", role: "store", id: "019fd1ce-6f17-7063-bee9-eab55d84f99b", architecture: "x" }

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::a_dangling_target_is_rejected_and_named_as_such
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::build_resolves_edges_declared_before_their_nodes
    architecture::tests::consuming_builders_compose
    architecture::tests::degree_counts_both_directions
    architecture::tests::duplicate_node_ids_are_rejected
    architecture::tests::duplicate_node_names_are_rejected
    architecture::tests::incoming_and_outgoing_partition_the_edges

test result: FAILED. 129 passed; 59 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
