*** crates/casm-core/src/architecture.rs:387:49: replace == with != in Architecture::add_relationship

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::add_relationship
@@ -379,17 +379,17 @@
     ) -> Result<(), ArchitectureError> {
         self.require_node(relationship.source(), "source")?;
         self.require_node(relationship.target(), "target")?;
 
         let identity = relationship.identity();
         if self
             .relationships
             .iter()
-            .any(|existing| existing.identity() == identity)
+            .any(|existing| existing.identity() != /* ~ changed by cargo-mutants ~ */ identity)
         {
             return Err(ArchitectureError::DuplicateRelationship {
                 source_id: relationship.source().to_string(),
                 target_id: relationship.target().to_string(),
                 kind: relationship.relationship_type().to_string(),
                 architecture: self.name.as_str().to_owned(),
             });
         }

---- architecture::tests::an_identical_relationship_is_rejected stdout ----

thread 'architecture::tests::an_identical_relationship_is_rejected' (1553227) panicked at crates/casm-core/src/architecture.rs:752:14:
called `Result::unwrap_err()` on an `Ok` value: ()

---- architecture::tests::the_same_pair_may_be_connected_with_different_semantics stdout ----

thread 'architecture::tests::the_same_pair_may_be_connected_with_different_semantics' (1553243) panicked at crates/casm-core/src/architecture.rs:763:9:
a sync call and an async event are distinct edges

---- architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one stdout ----

thread 'architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one' (1553249) panicked at crates/casm-core/src/architecture.rs:1083:14:
distinct edges are valid: DuplicateRelationship { source_id: "019fd215-557a-71c3-99ee-d501ca68b949", target_id: "019fd215-557a-71c3-99ee-d51af09a691c", kind: "sync", architecture: "distinct" }

failures:
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::the_same_pair_may_be_connected_with_different_semantics
    architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one
    merkle::tests::every_relationship_gets_its_own_entry_keyed_by_what_it_connects

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
