*** crates/casm-core/src/architecture.rs:412:9: replace Architecture::add_conformance -> Result<(), ArchitectureError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::add_conformance -> Result<(), ArchitectureError> with Ok(())
@@ -404,19 +404,17 @@
     /// edge, and is refused for the same reason: every consumer downstream would
     /// otherwise have to handle a case that should never have been representable.
     ///
     /// # Errors
     ///
     /// - [`ArchitectureError::DanglingBinding`] if a bound node is absent.
     /// - [`ArchitectureError::DuplicateConformance`] if the same pattern is claimed twice.
     pub fn add_conformance(&mut self, claim: Conformance) -> Result<(), ArchitectureError> {
-        self.check_conformance(&claim, self.conformance.len())?;
-        self.conformance.push(claim);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Consuming variant of [`Architecture::add_conformance`].
     ///
     /// # Errors
     ///
     /// As [`Architecture::add_conformance`].
     pub fn with_conformance(mut self, claim: Conformance) -> Result<Self, ArchitectureError> {

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (371847) panicked at crates/casm-core/src/architecture.rs:1000:56:
called `Result::unwrap_err()` on an `Ok` value: Some(Node { id: NodeId(019fd1ce-7239-74d0-beb1-3c3d8a9051e6), name: Name("cache"), node_type: Cache, description: None, interfaces: [], controls: [], metadata: {} })

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (371848) panicked at crates/casm-core/src/architecture.rs:927:9:
assertion `left == right` failed
  left: 0
 right: 1

---- architecture::tests::a_binding_to_an_absent_node_is_rejected stdout ----

thread 'architecture::tests::a_binding_to_an_absent_node_is_rejected' (371846) panicked at crates/casm-core/src/architecture.rs:946:58:

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::the_same_pattern_cannot_be_claimed_twice
    architecture::tests::two_versions_of_one_pattern_may_both_be_claimed
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::rebinding_a_role_changes_the_fingerprint

test result: FAILED. 180 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
