*** crates/casm-core/src/architecture.rs:437:9: replace Architecture::check_conformance -> Result<(), ArchitectureError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::check_conformance -> Result<(), ArchitectureError> with Ok(())
@@ -429,40 +429,17 @@
     /// `preceding` bounds the duplicate scan, so the same routine serves both insertion
     /// (where everything already recorded precedes the new claim) and re-verification
     /// (where each claim is checked against the ones before it).
     fn check_conformance(
         &self,
         claim: &Conformance,
         preceding: usize,
     ) -> Result<(), ArchitectureError> {
-        for (role, id) in claim.bindings() {
-            if !self.nodes.contains_key(id) {
-                return Err(ArchitectureError::DanglingBinding {
-                    pattern: claim.pattern().to_string(),
-                    role: role.as_str().to_owned(),
-                    id: id.to_string(),
-                    architecture: self.name.as_str().to_owned(),
-                });
-            }
-        }
-
-        let claimed_twice = self
-            .conformance
-            .iter()
-            .take(preceding)
-            .any(|earlier| earlier.pattern() == claim.pattern());
-        if claimed_twice {
-            return Err(ArchitectureError::DuplicateConformance {
-                pattern: claim.pattern().to_string(),
-                architecture: self.name.as_str().to_owned(),
-            });
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Removes a node, refusing while anything still references it.
     ///
     /// Refusing is the point: silently cascading the delete would let a single removal
     /// quietly sever edges the author never inspected. A conformance binding counts as a
     /// reference for the same reason — removing the node a pattern role is bound to
     /// should make the author revisit the claim, not silently invalidate it.

---- architecture::tests::a_binding_to_an_absent_node_is_rejected stdout ----

thread 'architecture::tests::a_binding_to_an_absent_node_is_rejected' (373952) panicked at crates/casm-core/src/architecture.rs:925:58:

---- architecture::tests::the_same_pattern_cannot_be_claimed_twice stdout ----

thread 'architecture::tests::the_same_pattern_cannot_be_claimed_twice' (373974) panicked at crates/casm-core/src/architecture.rs:941:14:

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (373976) panicked at crates/casm-core/src/architecture.rs:1003:9:
assertion failed: matches!(smuggled.verify_invariants(),
    Err(ArchitectureError::DanglingBinding { .. }))

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::the_same_pattern_cannot_be_claimed_twice
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde

test result: FAILED. 185 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
