*** crates/casm-core/src/architecture.rs:438:16: delete ! in Architecture::check_conformance

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ delete ! in Architecture::check_conformance
@@ -430,17 +430,17 @@
     /// (where everything already recorded precedes the new claim) and re-verification
     /// (where each claim is checked against the ones before it).
     fn check_conformance(
         &self,
         claim: &Conformance,
         preceding: usize,
     ) -> Result<(), ArchitectureError> {
         for (role, id) in claim.bindings() {
-            if !self.nodes.contains_key(id) {
+            if  /* ~ changed by cargo-mutants ~ */self.nodes.contains_key(id) {
                 return Err(ArchitectureError::DanglingBinding {
                     pattern: claim.pattern().to_string(),
                     role: role.as_str().to_owned(),
                     id: id.to_string(),
                     architecture: self.name.as_str().to_owned(),
                 });
             }
         }

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1555155) panicked at crates/casm-core/src/architecture.rs:1039:14:
called `Result::unwrap()` on an `Err` value: DanglingBinding { pattern: "p@1.0.0", role: "store", id: "019fd215-60c0-70b3-a7b4-d82f95112b77", architecture: "x" }

---- architecture::tests::a_binding_to_an_absent_node_is_rejected stdout ----

thread 'architecture::tests::a_binding_to_an_absent_node_is_rejected' (1555154) panicked at crates/casm-core/src/architecture.rs:988:58:

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1555156) panicked at crates/casm-core/src/architecture.rs:967:65:
called `Result::unwrap()` on an `Err` value: DanglingBinding { pattern: "secure-web-tier@1.0.0", role: "application", id: "019fd215-60c0-70b3-a7b4-d866749dc892", architecture: "checkout" }

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them
    merkle::tests::rebinding_a_role_changes_the_fingerprint

test result: FAILED. 199 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
