*** crates/casm-core/src/architecture.rs:481:42: replace + with - in Architecture::remove_node

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace + with - in Architecture::remove_node
@@ -473,17 +473,17 @@
     pub fn remove_node(&mut self, id: NodeId) -> Result<Option<Node>, ArchitectureError> {
         let bound = self
             .conformance
             .iter()
             .flat_map(|claim| claim.bindings().values())
             .filter(|bound| **bound == id)
             .count();
 
-        let references = self.degree(id) + bound;
+        let references = self.degree(id) - /* ~ changed by cargo-mutants ~ */ bound;
         if references > 0 {
             return Err(ArchitectureError::NodeStillReferenced {
                 id: id.to_string(),
                 count: references,
             });
         }
 
         Ok(self.nodes.shift_remove(&id))

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (375801) panicked at crates/casm-core/src/architecture.rs:481:26:
attempt to subtract with overflow

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
