*** crates/casm-core/src/architecture.rs:482:23: replace > with == in Architecture::remove_node

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace > with == in Architecture::remove_node
@@ -474,17 +474,17 @@
         let bound = self
             .conformance
             .iter()
             .flat_map(|claim| claim.bindings().values())
             .filter(|bound| **bound == id)
             .count();
 
         let references = self.degree(id) + bound;
-        if references > 0 {
+        if references == /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(ArchitectureError::NodeStillReferenced {
                 id: id.to_string(),
                 count: references,
             });
         }
 
         Ok(self.nodes.shift_remove(&id))
     }

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (376704) panicked at crates/casm-core/src/architecture.rs:1002:56:
called `Result::unwrap_err()` on an `Ok` value: Some(Node { id: NodeId(019fd1ce-8b39-7fb3-a2f3-9c91e9c9897e), name: Name("cache"), node_type: Cache, description: None, interfaces: [], controls: [], metadata: {} })

---- architecture::tests::removing_an_unreferenced_node_succeeds stdout ----

thread 'architecture::tests::removing_an_unreferenced_node_succeeds' (376723) panicked at crates/casm-core/src/architecture.rs:832:59:
called `Result::unwrap()` on an `Err` value: NodeStillReferenced { id: "019fd1ce-8b3c-74e1-a7df-409303d04fc1", count: 0 }

---- architecture::tests::removing_a_referenced_node_is_refused_with_a_count stdout ----

thread 'architecture::tests::removing_a_referenced_node_is_refused_with_a_count' (376721) panicked at crates/casm-core/src/architecture.rs:816:22:
expected NodeStillReferenced, got Ok(Some(Node { id: NodeId(019fd1ce-8b3d-77d2-88a6-aaa971f51ba3), name: Name("api"), node_type: Service, description: None, interfaces: [], controls: [], metadata: {} }))

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count
    architecture::tests::removing_an_absent_node_is_not_an_error
    architecture::tests::removing_an_unreferenced_node_succeeds

test result: FAILED. 184 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
