*** crates/casm-core/src/architecture.rs:482:23: replace > with < in Architecture::remove_node

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace > with < in Architecture::remove_node
@@ -474,17 +474,17 @@
         let bound = self
             .conformance
             .iter()
             .flat_map(|claim| claim.bindings().values())
             .filter(|bound| **bound == id)
             .count();
 
         let references = self.degree(id) + bound;
-        if references > 0 {
+        if references < /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(ArchitectureError::NodeStillReferenced {
                 id: id.to_string(),
                 count: references,
             });
         }
 
         Ok(self.nodes.shift_remove(&id))
     }

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (377950) panicked at crates/casm-core/src/architecture.rs:1002:56:
called `Result::unwrap_err()` on an `Ok` value: Some(Node { id: NodeId(019fd1ce-8f60-74a2-8845-c61ab8cbcd6c), name: Name("cache"), node_type: Cache, description: None, interfaces: [], controls: [], metadata: {} })

---- architecture::tests::removing_a_referenced_node_is_refused_with_a_count stdout ----

thread 'architecture::tests::removing_a_referenced_node_is_refused_with_a_count' (377968) panicked at crates/casm-core/src/architecture.rs:816:22:
expected NodeStillReferenced, got Ok(Some(Node { id: NodeId(019fd1ce-8f61-7882-bdf1-37651c0426de), name: Name("api"), node_type: Service, description: None, interfaces: [], controls: [], metadata: {} }))

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
