*** crates/casm-core/src/architecture.rs:68:9: replace ArchitectureConfig::name -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace ArchitectureConfig::name -> Self with Default::default()
@@ -60,18 +60,17 @@
     #[must_use]
     pub fn new() -> Self {
         Self::default()
     }
 
     /// Sets the architecture's name. Required.
     #[must_use]
     pub fn name(mut self, name: impl Into<String>) -> Self {
-        self.name = Some(name.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets the architecture's semantic version. Defaults to `0.1.0`.
     #[must_use]
     pub fn version(mut self, version: impl Into<String>) -> Self {
         self.version = Some(version.into());
         self
     }

---- architecture::tests::an_architecture_reports_what_it_was_built_with stdout ----

thread 'architecture::tests::an_architecture_reports_what_it_was_built_with' (1523899) panicked at crates/casm-core/src/architecture.rs:910:9:
assertion `left == right` failed
  left: "unnamed-architecture"
 right: "checkout"

---- architecture::tests::duplicate_node_names_are_rejected stdout ----

thread 'architecture::tests::duplicate_node_names_are_rejected' (1523908) panicked at crates/casm-core/src/architecture.rs:674:17:
assertion `left == right` failed
  left: "unnamed-architecture"
 right: "x"

failures:
    architecture::tests::an_architecture_reports_what_it_was_built_with
    architecture::tests::duplicate_node_names_are_rejected

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
