*** crates/casm-core/src/architecture.rs:75:9: replace ArchitectureConfig::version -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace ArchitectureConfig::version -> Self with Default::default()
@@ -67,18 +67,17 @@
     pub fn name(mut self, name: impl Into<String>) -> Self {
         self.name = Some(name.into());
         self
     }
 
     /// Sets the architecture's semantic version. Defaults to `0.1.0`.
     #[must_use]
     pub fn version(mut self, version: impl Into<String>) -> Self {
-        self.version = Some(version.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets a human-readable description.
     #[must_use]
     pub fn description(mut self, description: impl Into<String>) -> Self {
         self.description = Some(description.into());
         self
     }

---- architecture::tests::build_rejects_a_non_semver_version stdout ----

thread 'architecture::tests::build_rejects_a_non_semver_version' (1525064) panicked at crates/casm-core/src/architecture.rs:641:14:
called `Result::unwrap_err()` on an `Ok` value: Architecture { name: Name("unnamed-architecture"), version: Version { major: 0, minor: 1, patch: 0 }, description: None, nodes: {}, relationships: [], conformance: [], metadata: {} }

---- architecture::tests::an_architecture_reports_what_it_was_built_with stdout ----

thread 'architecture::tests::an_architecture_reports_what_it_was_built_with' (1525060) panicked at crates/casm-core/src/architecture.rs:910:9:
assertion `left == right` failed
  left: "unnamed-architecture"
 right: "checkout"

---- merkle::tests::a_version_bump_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_version_bump_changes_the_fingerprint' (1525168) panicked at crates/casm-core/src/merkle.rs:702:9:
assertion `left != right` failed
  left: Fingerprint(259847ad2190…)
 right: Fingerprint(259847ad2190…)

failures:
    architecture::tests::an_architecture_reports_what_it_was_built_with
    architecture::tests::build_rejects_a_non_semver_version
    merkle::tests::a_version_bump_changes_the_fingerprint

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
