*** crates/casm-core/src/conformance.rs:205:9: replace Unmet::is_mechanical -> bool with false

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace Unmet::is_mechanical -> bool with false
@@ -197,26 +197,17 @@
     /// Whether this failure can be fixed by adding to the architecture, rather than by
     /// a human deciding something.
     ///
     /// `casm evolve` uses this to separate "here is what to add" from "here is what only
     /// you can answer". A missing control is the first kind; an ambiguous role is the
     /// second, and no tool should resolve it by picking.
     #[must_use]
     pub const fn is_mechanical(&self) -> bool {
-        match self {
-            Self::TooFewControls { .. }
-            | Self::MissingControlType { .. }
-            | Self::MissingProtocol { .. }
-            | Self::MissingRelationship { .. } => true,
-            Self::UnknownRole { .. }
-            | Self::NoCandidate { .. }
-            | Self::Ambiguous { .. }
-            | Self::WrongType { .. } => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The outcome of checking one claim: which node fills each role, and what is unmet.
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ConformanceReport {
     reference: String,
     bindings: Vec<(String, NodeId)>,

---- conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision stdout ----

thread 'conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision' (1565144) panicked at crates/casm-core/src/conformance.rs:779:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
