*** crates/casm-core/src/conformance.rs:231:9: replace ConformanceReport::reference -> &str with "xyzzy"

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace ConformanceReport::reference -> &str with "xyzzy"
@@ -223,17 +223,17 @@
     unmet: Vec<Unmet>,
 }
 
 impl ConformanceReport {
     /// The `name@version` of the pattern checked.
     #[inline]
     #[must_use]
     pub fn reference(&self) -> &str {
-        &self.reference
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every role that was filled, and the node filling it.
     ///
     /// Includes roles bound automatically, which is what makes this worth returning: an
     /// author who wrote no `bind:` block can still see what the check decided.
     #[inline]
     #[must_use]

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (385118) panicked at crates/casm-core/src/conformance.rs:520:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "secure-web-tier@1.0.0"

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
