*** crates/casm-core/src/conformance.rs:241:9: replace ConformanceReport::bindings -> &[(String, NodeId)] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace ConformanceReport::bindings -> &[(String, NodeId)] with Vec::leak(Vec::new())
@@ -233,17 +233,17 @@
 
     /// Every role that was filled, and the node filling it.
     ///
     /// Includes roles bound automatically, which is what makes this worth returning: an
     /// author who wrote no `bind:` block can still see what the check decided.
     #[inline]
     #[must_use]
     pub fn bindings(&self) -> &[(String, NodeId)] {
-        &self.bindings
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Everything the architecture fails to satisfy.
     #[inline]
     #[must_use]
     pub fn unmet(&self) -> &[Unmet] {
         &self.unmet
     }

---- conformance::tests::roles_bind_automatically_when_exactly_one_node_fits stdout ----

thread 'conformance::tests::roles_bind_automatically_when_exactly_one_node_fits' (385504) panicked at crates/casm-core/src/conformance.rs:530:9:
[]

failures:
    conformance::tests::roles_bind_automatically_when_exactly_one_node_fits

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
