*** crates/casm-core/src/conformance.rs:255:9: replace ConformanceReport::conforms -> bool with true

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace ConformanceReport::conforms -> bool with true
@@ -247,17 +247,17 @@
     pub fn unmet(&self) -> &[Unmet] {
         &self.unmet
     }
 
     /// Whether the architecture conforms.
     #[inline]
     #[must_use]
     pub fn conforms(&self) -> bool {
-        self.unmet.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The unmet requirements a tool could fix by adding to the architecture.
     pub fn mechanical(&self) -> impl Iterator<Item = &Unmet> {
         self.unmet.iter().filter(|unmet| unmet.is_mechanical())
     }
 }

---- conformance::tests::relationship_direction_matters stdout ----

thread 'conformance::tests::relationship_direction_matters' (388105) panicked at crates/casm-core/src/conformance.rs:740:9:
a reversed edge must not satisfy the requirement

failures:
    conformance::tests::relationship_direction_matters

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
