*** crates/casm-core/src/conformance.rs:255:9: replace ConformanceReport::conforms -> bool with false

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace ConformanceReport::conforms -> bool with false
@@ -247,17 +247,17 @@
     pub fn unmet(&self) -> &[Unmet] {
         &self.unmet
     }
 
     /// Whether the architecture conforms.
     #[inline]
     #[must_use]
     pub fn conforms(&self) -> bool {
-        self.unmet.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The unmet requirements a tool could fix by adding to the architecture.
     pub fn mechanical(&self) -> impl Iterator<Item = &Unmet> {
         self.unmet.iter().filter(|unmet| unmet.is_mechanical())
     }
 }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1570317) panicked at crates/casm-core/src/conformance.rs:519:9:
[]

---- conformance::tests::a_vacuous_pattern_is_satisfied_by_anything stdout ----

thread 'conformance::tests::a_vacuous_pattern_is_satisfied_by_anything' (1570323) panicked at crates/casm-core/src/conformance.rs:768:9:
assertion failed: check(&conforming(), &pattern, &claim()).conforms()

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1570324) panicked at crates/casm-core/src/conformance.rs:583:9:
[]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_vacuous_pattern_is_satisfied_by_anything
    conformance::tests::an_explicit_binding_resolves_the_ambiguity

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
