*** crates/casm-core/src/conformance.rs:260:9: replace ConformanceReport::mechanical -> impl Iterator<Item =&Unmet> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace ConformanceReport::mechanical -> impl Iterator<Item =&Unmet> with ::std::iter::empty()
@@ -252,17 +252,17 @@
     #[inline]
     #[must_use]
     pub fn conforms(&self) -> bool {
         self.unmet.is_empty()
     }
 
     /// The unmet requirements a tool could fix by adding to the architecture.
     pub fn mechanical(&self) -> impl Iterator<Item = &Unmet> {
-        self.unmet.iter().filter(|unmet| unmet.is_mechanical())
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Checks `architecture` against `pattern`, honouring the bindings in `claim`.
 ///
 /// Always succeeds: the result describes the architecture, and an architecture that
 /// matches nothing at all produces a report full of [`Unmet`] rather than an error.
 #[must_use]

---- conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision stdout ----

thread 'conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision' (389129) panicked at crates/casm-core/src/conformance.rs:788:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
