*** crates/casm-core/src/conformance.rs:358:5: replace check_node with ()

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace check_node with ()
@@ -350,52 +350,17 @@
                 .map(|node| node.name().as_str().to_owned())
                 .collect(),
         }),
     }
 }
 
 /// Checks one node against the requirement it fills.
 fn check_node(requirement: &Requirement, node: &Node, unmet: &mut Vec<Unmet>) {
-    let role = requirement.role().as_str().to_owned();
-    let name = node.name().as_str().to_owned();
-
-    let declared = node.controls_of_type(ControlType::Security);
-    if declared < requirement.min_security_controls() {
-        unmet.push(Unmet::TooFewControls {
-            role: role.clone(),
-            node: name.clone(),
-            required: requirement.min_security_controls(),
-            declared,
-        });
-    }
-
-    for control_type in requirement.required_control_types() {
-        if node.controls_of_type(*control_type) == 0 {
-            unmet.push(Unmet::MissingControlType {
-                role: role.clone(),
-                node: name.clone(),
-                control_type: control_type.label().to_owned(),
-            });
-        }
-    }
-
-    for protocol in requirement.required_protocols() {
-        let speaks = node
-            .interfaces()
-            .iter()
-            .any(|interface| interface.protocol() == protocol);
-        if !speaks {
-            unmet.push(Unmet::MissingProtocol {
-                role: role.clone(),
-                node: name.clone(),
-                protocol: protocol.label().to_owned(),
-            });
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Checks the relationships the pattern requires between filled roles.
 ///
 /// Roles that could not be filled are skipped: reporting "no relationship from an
 /// unfilled role" would be a consequence of a failure already reported, and the second
 /// message tells the author nothing the first did not.
 fn check_relationships(

---- conformance::tests::a_missing_protocol_is_reported stdout ----

thread 'conformance::tests::a_missing_protocol_is_reported' (391451) panicked at crates/casm-core/src/conformance.rs:655:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingProtocol { protocol, .. }] if protocol
    == "grpc")

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (391449) panicked at crates/casm-core/src/conformance.rs:636:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingControlType { control_type, .. }] if
    control_type == "compliance")

---- conformance::tests::every_unmet_variant_renders_a_message_naming_its_role stdout ----

thread 'conformance::tests::every_unmet_variant_renders_a_message_naming_its_role' (391465) panicked at crates/casm-core/src/conformance.rs:776:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::too_few_security_controls_is_reported_with_both_counts

test result: FAILED. 183 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
