*** crates/casm-core/src/conformance.rs:362:17: replace < with == in check_node

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace < with == in check_node
@@ -354,17 +354,17 @@
 }
 
 /// Checks one node against the requirement it fills.
 fn check_node(requirement: &Requirement, node: &Node, unmet: &mut Vec<Unmet>) {
     let role = requirement.role().as_str().to_owned();
     let name = node.name().as_str().to_owned();
 
     let declared = node.controls_of_type(ControlType::Security);
-    if declared < requirement.min_security_controls() {
+    if declared == /* ~ changed by cargo-mutants ~ */ requirement.min_security_controls() {
         unmet.push(Unmet::TooFewControls {
             role: role.clone(),
             node: name.clone(),
             required: requirement.min_security_controls(),
             declared,
         });
     }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1573603) panicked at crates/casm-core/src/conformance.rs:519:9:
[TooFewControls { role: "edge", node: "edge", required: 2, declared: 2 }, TooFewControls { role: "application", node: "orders", required: 0, declared: 0 }]

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1573602) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1573610) panicked at crates/casm-core/src/conformance.rs:583:9:
[TooFewControls { role: "edge", node: "edge", required: 2, declared: 2 }, TooFewControls { role: "application", node: "orders", required: 0, declared: 0 }]

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::too_few_security_controls_is_reported_with_both_counts

test result: FAILED. 197 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
