*** crates/casm-core/src/conformance.rs:362:17: replace < with <= in check_node

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace < with <= in check_node
@@ -354,17 +354,17 @@
 }
 
 /// Checks one node against the requirement it fills.
 fn check_node(requirement: &Requirement, node: &Node, unmet: &mut Vec<Unmet>) {
     let role = requirement.role().as_str().to_owned();
     let name = node.name().as_str().to_owned();
 
     let declared = node.controls_of_type(ControlType::Security);
-    if declared < requirement.min_security_controls() {
+    if declared <= /* ~ changed by cargo-mutants ~ */ requirement.min_security_controls() {
         unmet.push(Unmet::TooFewControls {
             role: role.clone(),
             node: name.clone(),
             required: requirement.min_security_controls(),
             declared,
         });
     }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1575407) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1575409) panicked at crates/casm-core/src/conformance.rs:519:9:
[TooFewControls { role: "edge", node: "edge", required: 2, declared: 2 }, TooFewControls { role: "application", node: "orders", required: 0, declared: 0 }]

---- conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at stdout ----

thread 'conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at' (1575416) panicked at crates/casm-core/src/conformance.rs:561:22:
expected one Ambiguous, got [TooFewControls { role: "edge", node: "edge", required: 2, declared: 2 }, Ambiguous { role: "application", node_type: "service", candidates: ["orders", "payments"] }]

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity

test result: FAILED. 200 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
