*** crates/casm-core/src/conformance.rs:407:5: replace check_relationships with ()

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace check_relationships with ()
@@ -399,45 +399,17 @@
 /// unfilled role" would be a consequence of a failure already reported, and the second
 /// message tells the author nothing the first did not.
 fn check_relationships(
     architecture: &Architecture,
     pattern: &Pattern,
     bindings: &[(String, NodeId)],
     unmet: &mut Vec<Unmet>,
 ) {
-    let filled = |role: &Name| {
-        bindings
-            .iter()
-            .find(|(bound, _)| bound == role.as_str())
-            .map(|(_, id)| *id)
-    };
-
-    for required in pattern.relationships() {
-        let (Some(source), Some(target)) = (filled(required.source()), filled(required.target()))
-        else {
-            continue;
-        };
-
-        let exists = architecture.relationships().any(|edge| {
-            edge.source() == source
-                && edge.target() == target
-                && edge.relationship_type() == required.relationship_type()
-        });
-
-        if !exists {
-            unmet.push(Unmet::MissingRelationship {
-                source_role: required.source().as_str().to_owned(),
-                source: name_of(architecture, source),
-                target_role: required.target().as_str().to_owned(),
-                target: name_of(architecture, target),
-                relationship_type: required.relationship_type().to_string(),
-            });
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// A node's name, for diagnostic text.
 fn name_of(architecture: &Architecture, id: NodeId) -> String {
     architecture
         .node(id)
         .map_or_else(|| id.to_string(), |node| node.name().as_str().to_owned())
 }

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1578342) panicked at crates/casm-core/src/conformance.rs:695:22:
expected MissingRelationship, got []

---- conformance::tests::relationship_direction_matters stdout ----

thread 'conformance::tests::relationship_direction_matters' (1578351) panicked at crates/casm-core/src/conformance.rs:712:9:
a reversed edge must not satisfy the requirement

failures:
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::relationship_direction_matters

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
