*** crates/casm-core/src/conformance.rs:421:27: replace == with != in check_relationships

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace == with != in check_relationships
@@ -413,17 +413,17 @@
 
     for required in pattern.relationships() {
         let (Some(source), Some(target)) = (filled(required.source()), filled(required.target()))
         else {
             continue;
         };
 
         let exists = architecture.relationships().any(|edge| {
-            edge.source() == source
+            edge.source() != /* ~ changed by cargo-mutants ~ */ source
                 && edge.target() == target
                 && edge.relationship_type() == required.relationship_type()
         });
 
         if !exists {
             unmet.push(Unmet::MissingRelationship {
                 source_role: required.source().as_str().to_owned(),
                 source: name_of(architecture, source),

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (398975) panicked at crates/casm-core/src/conformance.rs:519:9:
[MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "sync" }]

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (398982) panicked at crates/casm-core/src/conformance.rs:583:9:
[MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "sync" }]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::an_explicit_binding_resolves_the_ambiguity

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
