*** crates/casm-core/src/conformance.rs:422:17: replace && with || in check_relationships

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace && with || in check_relationships
@@ -414,17 +414,17 @@
     for required in pattern.relationships() {
         let (Some(source), Some(target)) = (filled(required.source()), filled(required.target()))
         else {
             continue;
         };
 
         let exists = architecture.relationships().any(|edge| {
             edge.source() == source
-                && edge.target() == target
+                || /* ~ changed by cargo-mutants ~ */ edge.target() == target
                 && edge.relationship_type() == required.relationship_type()
         });
 
         if !exists {
             unmet.push(Unmet::MissingRelationship {
                 source_role: required.source().as_str().to_owned(),
                 source: name_of(architecture, source),
                 target_role: required.target().as_str().to_owned(),

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1580669) panicked at crates/casm-core/src/conformance.rs:723:22:
expected MissingRelationship, got []

failures:
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
