*** crates/casm-core/src/conformance.rs:423:17: replace && with || in check_relationships

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace && with || in check_relationships
@@ -415,17 +415,17 @@
         let (Some(source), Some(target)) = (filled(required.source()), filled(required.target()))
         else {
             continue;
         };
 
         let exists = architecture.relationships().any(|edge| {
             edge.source() == source
                 && edge.target() == target
-                && edge.relationship_type() == required.relationship_type()
+                || /* ~ changed by cargo-mutants ~ */ edge.relationship_type() == required.relationship_type()
         });
 
         if !exists {
             unmet.push(Unmet::MissingRelationship {
                 source_role: required.source().as_str().to_owned(),
                 source: name_of(architecture, source),
                 target_role: required.target().as_str().to_owned(),
                 target: name_of(architecture, target),

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (396675) panicked at crates/casm-core/src/conformance.rs:723:22:
expected MissingRelationship, got []

---- conformance::tests::relationship_direction_matters stdout ----

thread 'conformance::tests::relationship_direction_matters' (396684) panicked at crates/casm-core/src/conformance.rs:740:9:
a reversed edge must not satisfy the requirement

failures:
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::relationship_direction_matters

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
