*** crates/casm-core/src/conformance.rs:423:45: replace == with != in check_relationships

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace == with != in check_relationships
@@ -415,17 +415,17 @@
         let (Some(source), Some(target)) = (filled(required.source()), filled(required.target()))
         else {
             continue;
         };
 
         let exists = architecture.relationships().any(|edge| {
             edge.source() == source
                 && edge.target() == target
-                && edge.relationship_type() == required.relationship_type()
+                && edge.relationship_type() != /* ~ changed by cargo-mutants ~ */ required.relationship_type()
         });
 
         if !exists {
             unmet.push(Unmet::MissingRelationship {
                 source_role: required.source().as_str().to_owned(),
                 source: name_of(architecture, source),
                 target_role: required.target().as_str().to_owned(),
                 target: name_of(architecture, target),

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1580940) panicked at crates/casm-core/src/conformance.rs:519:9:
[MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "sync" }]

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1580962) panicked at crates/casm-core/src/conformance.rs:723:22:
expected MissingRelationship, got []

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1580965) panicked at crates/casm-core/src/conformance.rs:583:9:
[MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "sync" }]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::an_explicit_binding_resolves_the_ambiguity

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
