*** crates/casm-core/src/conformance.rs:426:12: delete ! in check_relationships

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ delete ! in check_relationships
@@ -418,17 +418,17 @@
         };
 
         let exists = architecture.relationships().any(|edge| {
             edge.source() == source
                 && edge.target() == target
                 && edge.relationship_type() == required.relationship_type()
         });
 
-        if !exists {
+        if  /* ~ changed by cargo-mutants ~ */exists {
             unmet.push(Unmet::MissingRelationship {
                 source_role: required.source().as_str().to_owned(),
                 source: name_of(architecture, source),
                 target_role: required.target().as_str().to_owned(),
                 target: name_of(architecture, target),
                 relationship_type: required.relationship_type().to_string(),
             });
         }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (399590) panicked at crates/casm-core/src/conformance.rs:519:9:
[MissingRelationship { source_role: "edge", source: "edge", target_role: "application", target: "orders", relationship_type: "sync" }]

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (399594) panicked at crates/casm-core/src/conformance.rs:723:22:
expected MissingRelationship, got []

---- conformance::tests::relationship_direction_matters stdout ----

thread 'conformance::tests::relationship_direction_matters' (399603) panicked at crates/casm-core/src/conformance.rs:740:9:
a reversed edge must not satisfy the requirement

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::relationship_direction_matters

test result: FAILED. 184 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
