*** crates/casm-core/src/conformance.rs:440:5: replace name_of -> String with String::new()

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace name_of -> String with String::new()
@@ -432,19 +432,17 @@
                 relationship_type: required.relationship_type().to_string(),
             });
         }
     }
 }
 
 /// A node's name, for diagnostic text.
 fn name_of(architecture: &Architecture, id: NodeId) -> String {
-    architecture
-        .node(id)
-        .map_or_else(|| id.to_string(), |node| node.name().as_str().to_owned())
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1583885) panicked at crates/casm-core/src/conformance.rs:717:17:
assertion `left == right` failed
  left: ""
 right: "edge"

failures:
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
