*** crates/casm-core/src/control.rs:168:9: replace Control::evidence_required -> bool with true

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace Control::evidence_required -> bool with true
@@ -160,17 +160,17 @@
     pub fn description(&self) -> &str {
         &self.description
     }
 
     /// Whether an auditor must be shown evidence for this control.
     #[inline]
     #[must_use]
     pub const fn evidence_required(&self) -> bool {
-        self.evidence_required
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The tags attached to this control.
     #[inline]
     #[must_use]
     pub fn tags(&self) -> &[String] {
         &self.tags
     }

---- control::tests::evidence_is_not_required_by_default stdout ----

thread 'control::tests::evidence_is_not_required_by_default' (1591307) panicked at crates/casm-core/src/control.rs:270:9:
assertion failed: !sample().evidence_required()

---- merkle::tests::a_boolean_field_is_part_of_the_digest stdout ----

thread 'merkle::tests::a_boolean_field_is_part_of_the_digest' (1591358) panicked at crates/casm-core/src/merkle.rs:923:9:
assertion `left != right` failed: evidence-required must change the fingerprint
  left: Fingerprint(9c43efa5c1d2…)
 right: Fingerprint(9c43efa5c1d2…)

failures:
    control::tests::evidence_is_not_required_by_default
    merkle::tests::a_boolean_field_is_part_of_the_digest

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
