*** crates/casm-core/src/control.rs:168:9: replace Control::evidence_required -> bool with false

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace Control::evidence_required -> bool with false
@@ -160,17 +160,17 @@
     pub fn description(&self) -> &str {
         &self.description
     }
 
     /// Whether an auditor must be shown evidence for this control.
     #[inline]
     #[must_use]
     pub const fn evidence_required(&self) -> bool {
-        self.evidence_required
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The tags attached to this control.
     #[inline]
     #[must_use]
     pub fn tags(&self) -> &[String] {
         &self.tags
     }

---- control::tests::requiring_evidence_sets_the_flag stdout ----

thread 'control::tests::requiring_evidence_sets_the_flag' (409017) panicked at crates/casm-core/src/control.rs:223:9:
assertion failed: sample().requiring_evidence().evidence_required()

failures:
    control::tests::requiring_evidence_sets_the_flag

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
