*** crates/casm-core/src/control.rs:38:9: replace ControlType::label -> &'static str with ""

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace ControlType::label -> &'static str with ""
@@ -30,22 +30,17 @@
     /// Governs data handling: retention, residency, classification.
     DataGovernance,
 }
 
 impl ControlType {
     /// Returns the canonical lowercase label.
     #[must_use]
     pub const fn label(self) -> &'static str {
-        match self {
-            Self::Security => "security",
-            Self::Compliance => "compliance",
-            Self::Operational => "operational",
-            Self::DataGovernance => "data-governance",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if absence of this control is an audit finding rather than a risk.
     #[must_use]
     pub const fn is_auditable(self) -> bool {
         match self {
             Self::Compliance | Self::DataGovernance => true,
             Self::Security | Self::Operational => false,

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (1584126) panicked at crates/casm-core/src/conformance.rs:671:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingControlType { control_type, .. }] if
    control_type == "compliance")

---- control::tests::every_control_type_renders_its_own_label stdout ----

thread 'control::tests::every_control_type_renders_its_own_label' (1584150) panicked at crates/casm-core/src/control.rs:241:9:
assertion `left == right` failed
  left: ""
 right: "security"

failures:
    conformance::tests::a_missing_control_type_is_reported
    control::tests::every_control_type_renders_its_own_label

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
