*** crates/casm-core/src/hex.rs:35:18: replace != with == in decode

*** mutation diff:
--- crates/casm-core/src/hex.rs
+++ replace != with == in decode
@@ -27,17 +27,17 @@
 ///
 /// # Errors
 ///
 /// Returns a human-readable message naming the offending length or byte.
 pub(crate) fn decode<const N: usize>(raw: &str) -> Result<[u8; N], String> {
     let raw = raw.rsplit_once(':').map_or(raw, |(_, digits)| digits);
     let expected = N.saturating_mul(2);
 
-    if raw.len() != expected {
+    if raw.len() == /* ~ changed by cargo-mutants ~ */ expected {
         return Err(format!(
             "expected {expected} hexadecimal digits, found {}",
             raw.len()
         ));
     }
 
     let mut bytes = [0_u8; N];
     for (index, slot) in bytes.iter_mut().enumerate() {

---- hex::tests::decoding_accepts_an_algorithm_prefix stdout ----

thread 'hex::tests::decoding_accepts_an_algorithm_prefix' (1600224) panicked at crates/casm-core/src/hex.rs:87:56:
called `Result::unwrap()` on an `Err` value: "expected 4 hexadecimal digits, found 4"

---- hex::tests::decoding_accepts_uppercase_digits stdout ----

thread 'hex::tests::decoding_accepts_uppercase_digits' (1600225) panicked at crates/casm-core/src/hex.rs:93:47:
called `Result::unwrap()` on an `Err` value: "expected 4 hexadecimal digits, found 4"

---- hex::tests::decoding_rejects_the_wrong_length_and_says_what_it_wanted stdout ----

thread 'hex::tests::decoding_rejects_the_wrong_length_and_says_what_it_wanted' (1600228) panicked at crates/casm-core/src/hex.rs:100:9:
value is not valid ASCII hexadecimal

failures:
    hex::tests::decoding_accepts_an_algorithm_prefix
    hex::tests::decoding_accepts_uppercase_digits
    hex::tests::decoding_rejects_the_wrong_length_and_says_what_it_wanted
    hex::tests::decoding_round_trips_with_encoding
    interface::tests::interface_round_trips_through_json
    interface::tests::schema_hash_accepts_an_algorithm_prefix
    interface::tests::schema_hash_round_trips_through_hex
    merkle::tests::fingerprints_render_and_parse_as_hex
    merkle::tests::fingerprints_round_trip_through_json

test result: FAILED. 196 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
