*** crates/casm-core/src/ids.rs:101:9: replace NodeId::timestamp_millis -> u64 with 1

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace NodeId::timestamp_millis -> u64 with 1
@@ -93,21 +93,17 @@
         &self.0
     }
 
     /// Returns the milliseconds-since-Unix-epoch timestamp embedded in this identifier.
     ///
     /// Because the type guarantees version 7, this is always available.
     #[must_use]
     pub fn timestamp_millis(&self) -> u64 {
-        self.0.get_timestamp().map_or(0, |ts| {
-            let (secs, nanos) = ts.to_unix();
-            secs.saturating_mul(1_000)
-                .saturating_add(u64::from(nanos) / 1_000_000)
-        })
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for NodeId {
     fn default() -> Self {
         Self::new()
     }
 }

---- ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit stdout ----

thread 'ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit' (1603802) panicked at crates/casm-core/src/ids.rs:297:9:
assertion `left == right` failed
  left: 1
 right: 1700000000123

---- ids::tests::timestamp_is_recoverable_and_plausible stdout ----

thread 'ids::tests::timestamp_is_recoverable_and_plausible' (1603803) panicked at crates/casm-core/src/ids.rs:231:9:
assertion failed: id.timestamp_millis() > 1_577_836_800_000

failures:
    ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit
    ids::tests::timestamp_is_recoverable_and_plausible

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
