*** crates/casm-core/src/ids.rs:104:50: replace / with % in NodeId::timestamp_millis

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace / with % in NodeId::timestamp_millis
@@ -96,17 +96,17 @@
     /// Returns the milliseconds-since-Unix-epoch timestamp embedded in this identifier.
     ///
     /// Because the type guarantees version 7, this is always available.
     #[must_use]
     pub fn timestamp_millis(&self) -> u64 {
         self.0.get_timestamp().map_or(0, |ts| {
             let (secs, nanos) = ts.to_unix();
             secs.saturating_mul(1_000)
-                .saturating_add(u64::from(nanos) / 1_000_000)
+                .saturating_add(u64::from(nanos) % /* ~ changed by cargo-mutants ~ */ 1_000_000)
         })
     }
 }
 
 impl Default for NodeId {
     fn default() -> Self {
         Self::new()
     }

---- ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit stdout ----

thread 'ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit' (1604061) panicked at crates/casm-core/src/ids.rs:301:9:
assertion `left == right` failed
  left: 1700000000000
 right: 1700000000123

failures:
    ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
