*** crates/casm-core/src/ids.rs:104:50: replace / with * in NodeId::timestamp_millis

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace / with * in NodeId::timestamp_millis
@@ -96,17 +96,17 @@
     /// Returns the milliseconds-since-Unix-epoch timestamp embedded in this identifier.
     ///
     /// Because the type guarantees version 7, this is always available.
     #[must_use]
     pub fn timestamp_millis(&self) -> u64 {
         self.0.get_timestamp().map_or(0, |ts| {
             let (secs, nanos) = ts.to_unix();
             secs.saturating_mul(1_000)
-                .saturating_add(u64::from(nanos) / 1_000_000)
+                .saturating_add(u64::from(nanos) * /* ~ changed by cargo-mutants ~ */ 1_000_000)
         })
     }
 }
 
 impl Default for NodeId {
     fn default() -> Self {
         Self::new()
     }

*** result: Success
