*** crates/casm-core/src/ids.rs:117:9: replace <impl fmt::Display for NodeId>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace <impl fmt::Display for NodeId>::fmt -> fmt::Result with Ok(Default::default())
@@ -109,17 +109,17 @@
 impl Default for NodeId {
     fn default() -> Self {
         Self::new()
     }
 }
 
 impl fmt::Display for NodeId {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        write!(f, "{}", self.0.as_hyphenated())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl core::str::FromStr for NodeId {
     type Err = IdError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Self::parse(s)

---- architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde' (1604708) panicked at crates/casm-core/src/architecture.rs:875:67:
called `Result::unwrap()` on an `Err` value: Error("invalid node identifier '': not a well-formed UUID", line: 0, column: 0)

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (1604707) panicked at crates/casm-core/src/architecture.rs:1122:67:
called `Result::unwrap()` on an `Err` value: Error("invalid node identifier '': not a well-formed UUID", line: 0, column: 0)

---- ids::tests::display_uses_canonical_hyphenated_form stdout ----

thread 'ids::tests::display_uses_canonical_hyphenated_form' (1604762) panicked at crates/casm-core/src/ids.rs:218:9:
assertion `left == right` failed
  left: 0
 right: 36

failures:
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde
    ids::tests::display_uses_canonical_hyphenated_form
    ids::tests::generated_ids_round_trip_through_strings
    ids::tests::serde_round_trips_through_json
    ids::tests::the_delegating_conversions_validate_as_parse_does

test result: FAILED. 199 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
