*** crates/casm-core/src/ids.rs:125:9: replace <impl core::str::FromStr for NodeId>::from_str -> Result<Self, Self::Err> with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace <impl core::str::FromStr for NodeId>::from_str -> Result<Self, Self::Err> with Ok(Default::default())
@@ -117,17 +117,17 @@
         write!(f, "{}", self.0.as_hyphenated())
     }
 }
 
 impl core::str::FromStr for NodeId {
     type Err = IdError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
-        Self::parse(s)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TryFrom<&str> for NodeId {
     type Error = IdError;
 
     fn try_from(value: &str) -> Result<Self, Self::Error> {
         Self::parse(value)

---- ids::tests::the_delegating_conversions_validate_as_parse_does stdout ----

thread 'ids::tests::the_delegating_conversions_validate_as_parse_does' (1606620) panicked at crates/casm-core/src/ids.rs:247:9:
assertion `left == right` failed
  left: "019fd216-46a6-79b0-aa44-ddf5e1b73a9e"
 right: "019fd216-46a6-79b0-aa44-dddda0d38487"

---- ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit stdout ----

thread 'ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit' (1606621) panicked at crates/casm-core/src/ids.rs:301:9:
assertion `left == right` failed
  left: 1785936103079
 right: 1700000000123

failures:
    ids::tests::the_delegating_conversions_validate_as_parse_does
    ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
