*** crates/casm-core/src/ids.rs:133:9: replace <impl TryFrom<&str> for NodeId>::try_from -> Result<Self, Self::Error> with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace <impl TryFrom<&str> for NodeId>::try_from -> Result<Self, Self::Error> with Ok(Default::default())
@@ -125,17 +125,17 @@
         Self::parse(s)
     }
 }
 
 impl TryFrom<&str> for NodeId {
     type Error = IdError;
 
     fn try_from(value: &str) -> Result<Self, Self::Error> {
-        Self::parse(value)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TryFrom<String> for NodeId {
     type Error = IdError;
 
     fn try_from(value: String) -> Result<Self, Self::Error> {
         Self::parse(&value)

---- ids::tests::the_delegating_conversions_validate_as_parse_does stdout ----

thread 'ids::tests::the_delegating_conversions_validate_as_parse_does' (1606400) panicked at crates/casm-core/src/ids.rs:254:9:
assertion `left == right` failed
  left: "019fd216-4651-7d23-9e0f-e8f9dd1416ee"
 right: "019fd216-4651-7d23-9e0f-e8e2b9ecc2fb"

failures:
    ids::tests::the_delegating_conversions_validate_as_parse_does

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
