*** crates/casm-core/src/ids.rs:151:9: replace <impl Deserialize<'de> for NodeId>::deserialize -> Result<Self, D::Error> with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace <impl Deserialize<'de> for NodeId>::deserialize -> Result<Self, D::Error> with Ok(Default::default())
@@ -143,18 +143,17 @@
 }
 
 impl<'de> Deserialize<'de> for NodeId {
     /// Deserialisation enforces the version-7 requirement, exactly as [`NodeId::parse`] does.
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: Deserializer<'de>,
     {
-        let raw = String::deserialize(deserializer)?;
-        Self::parse(&raw).map_err(serde::de::Error::custom)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- architecture::tests::architecture_round_trips_through_json stdout ----

thread 'architecture::tests::architecture_round_trips_through_json' (424455) panicked at crates/casm-core/src/architecture.rs:894:62:
called `Result::unwrap()` on an `Err` value: Error("expected `:`", line: 1, column: 47)

---- architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde' (424481) panicked at crates/casm-core/src/architecture.rs:877:9:
got DanglingReference { endpoint: "source", id: "019fd1cf-59a1-7d92-b5e5-b2e00313c39c", architecture: "checkout" }

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (424480) panicked at crates/casm-core/src/architecture.rs:1026:9:
assertion failed: matches!(smuggled.verify_invariants(),
    Err(ArchitectureError::DanglingBinding { .. }))

failures:
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde
    ids::tests::serde_round_trips_through_json
    node::tests::node_round_trips_through_json
    relationship::tests::relationship_round_trips_through_json

test result: FAILED. 182 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
