*** crates/casm-core/src/ids.rs:72:9: replace NodeId::parse -> Result<Self, IdError> with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace NodeId::parse -> Result<Self, IdError> with Ok(Default::default())
@@ -64,31 +64,17 @@
 
     /// Parses and validates an identifier from its canonical hyphenated form.
     ///
     /// # Errors
     ///
     /// - [`IdError::Malformed`] if `raw` is not a well-formed UUID.
     /// - [`IdError::WrongVersion`] if `raw` is a valid UUID of a version other than 7.
     pub fn parse(raw: &str) -> Result<Self, IdError> {
-        let uuid = Uuid::parse_str(raw).map_err(|_| IdError::Malformed {
-            value: raw.to_owned(),
-        })?;
-
-        let version = uuid.get_version_num();
-        if version != REQUIRED_UUID_VERSION {
-            // A UUID version is a single nibble, so this conversion cannot truncate.
-            let found = u8::try_from(version).unwrap_or(u8::MAX);
-            return Err(IdError::WrongVersion {
-                value: raw.to_owned(),
-                found,
-            });
-        }
-
-        Ok(Self(uuid))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Borrows the underlying [`Uuid`].
     #[inline]
     #[must_use]
     pub const fn as_uuid(&self) -> &Uuid {
         &self.0
     }

---- architecture::tests::architecture_round_trips_through_json stdout ----

thread 'architecture::tests::architecture_round_trips_through_json' (418443) panicked at crates/casm-core/src/architecture.rs:895:9:
assertion `left == right` failed

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (418461) panicked at crates/casm-core/src/architecture.rs:1026:9:
assertion failed: matches!(smuggled.verify_invariants(),
    Err(ArchitectureError::DanglingBinding { .. }))

---- architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde' (418462) panicked at crates/casm-core/src/architecture.rs:877:9:
got DanglingReference { endpoint: "source", id: "019fd1cf-3fab-7760-8111-e9e006ca5de7", architecture: "checkout" }

failures:
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde
    ids::tests::deserialisation_rejects_wrong_version
    ids::tests::generated_ids_round_trip_through_strings
    ids::tests::parse_rejects_malformed_input
    ids::tests::parse_rejects_the_nil_uuid
    ids::tests::parse_rejects_version_four_uuids
    ids::tests::serde_round_trips_through_json
    node::tests::node_round_trips_through_json
    relationship::tests::relationship_round_trips_through_json

test result: FAILED. 177 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
