*** crates/casm-core/src/interface.rs:119:9: replace Protocol::validate -> Result<(), InterfaceError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace Protocol::validate -> Result<(), InterfaceError> with Ok(())
@@ -111,22 +111,17 @@
     }
 
     /// Validates a [`Protocol::Custom`] label.
     ///
     /// # Errors
     ///
     /// Returns [`InterfaceError::EmptyCustomProtocol`] if a custom label is blank.
     pub fn validate(&self) -> Result<(), InterfaceError> {
-        match self {
-            Self::Custom(label) if label.trim().is_empty() => {
-                Err(InterfaceError::EmptyCustomProtocol)
-            }
-            _ => Ok(()),
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Protocol {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.label())
     }
 }

---- interface::tests::interface_rejects_an_empty_custom_protocol stdout ----

thread 'interface::tests::interface_rejects_an_empty_custom_protocol' (427749) panicked at crates/casm-core/src/interface.rs:400:81:
called `Result::unwrap_err()` on an `Ok` value: Interface { name: Name("api"), protocol: Custom("  "), version: Version { major: 1, minor: 0, patch: 0 }, schema_hash: None, description: None }

failures:
    interface::tests::interface_rejects_an_empty_custom_protocol

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
