*** crates/casm-core/src/interface.rs:120:36: replace match guard label.trim().is_empty() with true in Protocol::validate

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace match guard label.trim().is_empty() with true in Protocol::validate
@@ -112,17 +112,17 @@
 
     /// Validates a [`Protocol::Custom`] label.
     ///
     /// # Errors
     ///
     /// Returns [`InterfaceError::EmptyCustomProtocol`] if a custom label is blank.
     pub fn validate(&self) -> Result<(), InterfaceError> {
         match self {
-            Self::Custom(label) if label.trim().is_empty() => {
+            Self::Custom(label) if true /* ~ changed by cargo-mutants ~ */ => {
                 Err(InterfaceError::EmptyCustomProtocol)
             }
             _ => Ok(()),
         }
     }
 }
 
 impl fmt::Display for Protocol {

*** result: Success
