*** crates/casm-core/src/interface.rs:120:36: replace match guard label.trim().is_empty() with false in Protocol::validate

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace match guard label.trim().is_empty() with false in Protocol::validate
@@ -112,17 +112,17 @@
 
     /// Validates a [`Protocol::Custom`] label.
     ///
     /// # Errors
     ///
     /// Returns [`InterfaceError::EmptyCustomProtocol`] if a custom label is blank.
     pub fn validate(&self) -> Result<(), InterfaceError> {
         match self {
-            Self::Custom(label) if label.trim().is_empty() => {
+            Self::Custom(label) if false /* ~ changed by cargo-mutants ~ */ => {
                 Err(InterfaceError::EmptyCustomProtocol)
             }
             _ => Ok(()),
         }
     }
 }
 
 impl fmt::Display for Protocol {

---- interface::tests::interface_rejects_an_empty_custom_protocol stdout ----

thread 'interface::tests::interface_rejects_an_empty_custom_protocol' (429560) panicked at crates/casm-core/src/interface.rs:405:81:
called `Result::unwrap_err()` on an `Ok` value: Interface { name: Name("api"), protocol: Custom("  "), version: Version { major: 1, minor: 0, patch: 0 }, schema_hash: None, description: None }

failures:
    interface::tests::interface_rejects_an_empty_custom_protocol

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
