*** crates/casm-core/src/interface.rs:177:9: replace SchemaHash::to_hex -> String with String::new()

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace SchemaHash::to_hex -> String with String::new()
@@ -169,17 +169,17 @@
     #[must_use]
     pub const fn as_bytes(&self) -> &[u8; HASH_LEN] {
         &self.0
     }
 
     /// Renders the digest as 64 lowercase hexadecimal characters.
     #[must_use]
     pub fn to_hex(&self) -> String {
-        crate::hex::encode(&self.0)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for SchemaHash {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.to_hex())
     }
 }

---- interface::tests::interface_round_trips_through_json stdout ----

thread 'interface::tests::interface_round_trips_through_json' (431414) panicked at crates/casm-core/src/interface.rs:468:59:
called `Result::unwrap()` on an `Err` value: Error("schema hash: expected 64 hexadecimal digits, found 0", line: 1, column: 73)

---- interface::tests::schema_hash_accepts_an_algorithm_prefix stdout ----

thread 'interface::tests::schema_hash_accepts_an_algorithm_prefix' (431417) panicked at crates/casm-core/src/interface.rs:378:53:
called `Result::unwrap()` on an `Err` value: "schema hash: expected 64 hexadecimal digits, found 0"

---- interface::tests::schema_hash_matches_the_published_sha3_256_vector stdout ----

thread 'interface::tests::schema_hash_matches_the_published_sha3_256_vector' (431421) panicked at crates/casm-core/src/interface.rs:357:9:
assertion `left == right` failed
  left: ""
 right: "a7ffc6f8bf1ed76651c14756a061d662f580ff4de43b49fa82d80a4b80f8434a"

failures:
    interface::tests::interface_round_trips_through_json
    interface::tests::schema_hash_accepts_an_algorithm_prefix
    interface::tests::schema_hash_matches_the_published_sha3_256_vector
    interface::tests::schema_hash_round_trips_through_hex

test result: FAILED. 184 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
