*** crates/casm-core/src/interface.rs:206:9: replace <impl From<SchemaHash> for String>::from -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace <impl From<SchemaHash> for String>::from -> Self with Default::default()
@@ -198,17 +198,17 @@
 
     fn try_from(value: String) -> Result<Self, Self::Error> {
         Self::parse_hex(&value)
     }
 }
 
 impl From<SchemaHash> for String {
     fn from(value: SchemaHash) -> Self {
-        value.to_hex()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A named, versioned protocol contract exposed by a [`crate::Node`].
 ///
 /// # Examples
 ///
 /// ```

---- interface::tests::interface_round_trips_through_json stdout ----

thread 'interface::tests::interface_round_trips_through_json' (432990) panicked at crates/casm-core/src/interface.rs:468:59:
called `Result::unwrap()` on an `Err` value: Error("schema hash: expected 64 hexadecimal digits, found 0", line: 1, column: 73)

failures:
    interface::tests::interface_round_trips_through_json

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
