*** crates/casm-core/src/interface.rs:313:9: replace Interface::schema_hash -> Option<&SchemaHash> with None

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace Interface::schema_hash -> Option<&SchemaHash> with None
@@ -305,17 +305,17 @@
     pub const fn version(&self) -> &Version {
         &self.version
     }
 
     /// The content hash of the contract, if one was declared.
     #[inline]
     #[must_use]
     pub const fn schema_hash(&self) -> Option<&SchemaHash> {
-        self.schema_hash.as_ref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The human-readable description, if any.
     #[inline]
     #[must_use]
     pub fn description(&self) -> Option<&str> {
         self.description.as_deref()
     }

error: doctest failed, to rerun pass `-p casm-core --doc`

---- crates/casm-core/src/interface.rs - interface::Interface (line 214) stdout ----
Test executable failed (exit status: 101).

stderr:

thread 'main' (1618658) panicked at /tmp/rustdoctest7UPQZi/doctest_bundle_2024.rs:76:1:
assertion failed: iface.schema_hash().is_some()

failures:
    crates/casm-core/src/interface.rs - interface::Interface (line 214)

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
