*** crates/casm-core/src/interface.rs:331:35: replace == with != in Interface::is_compatible_with

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace == with != in Interface::is_compatible_with
@@ -323,17 +323,17 @@
     /// Returns `true` if a consumer pinned to `self` can safely talk to `other`.
     ///
     /// Compatibility is SemVer-major equality plus a minor-version floor, on the same
     /// protocol. This is the check that turns "we upgraded the API" from a production
     /// incident into a failed validation run.
     #[must_use]
     pub fn is_compatible_with(&self, other: &Self) -> bool {
         self.protocol == other.protocol
-            && self.version.major == other.version.major
+            && self.version.major != /* ~ changed by cargo-mutants ~ */ other.version.major
             && other.version.minor >= self.version.minor
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,

---- interface::tests::compatibility_allows_a_forward_minor_version stdout ----

thread 'interface::tests::compatibility_allows_a_forward_minor_version' (1622652) panicked at crates/casm-core/src/interface.rs:469:9:
assertion failed: consumer.is_compatible_with(&provider)

failures:
    interface::tests::compatibility_allows_a_forward_minor_version

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
