*** crates/casm-core/src/interface.rs:332:13: replace && with || in Interface::is_compatible_with

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace && with || in Interface::is_compatible_with
@@ -324,17 +324,17 @@
     ///
     /// Compatibility is SemVer-major equality plus a minor-version floor, on the same
     /// protocol. This is the check that turns "we upgraded the API" from a production
     /// incident into a failed validation run.
     #[must_use]
     pub fn is_compatible_with(&self, other: &Self) -> bool {
         self.protocol == other.protocol
             && self.version.major == other.version.major
-            && other.version.minor >= self.version.minor
+            || /* ~ changed by cargo-mutants ~ */ other.version.minor >= self.version.minor
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- interface::tests::compatibility_rejects_a_backward_minor_version stdout ----

thread 'interface::tests::compatibility_rejects_a_backward_minor_version' (1620923) panicked at crates/casm-core/src/interface.rs:476:9:
provider is missing newer features

---- interface::tests::compatibility_requires_matching_protocol stdout ----

thread 'interface::tests::compatibility_requires_matching_protocol' (1620925) panicked at crates/casm-core/src/interface.rs:486:9:
assertion failed: !consumer.is_compatible_with(&provider)

failures:
    interface::tests::compatibility_rejects_a_backward_minor_version
    interface::tests::compatibility_requires_matching_protocol

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
