*** crates/casm-core/src/interface.rs:73:9: replace Protocol::label -> &str with ""

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace Protocol::label -> &str with ""
@@ -65,30 +65,17 @@
     /// An escape hatch for protocols CASIMIR does not model natively.
     Custom(String),
 }
 
 impl Protocol {
     /// Returns the canonical lowercase label for this protocol.
     #[must_use]
     pub fn label(&self) -> &str {
-        match self {
-            Self::Http11 => "http1.1",
-            Self::Http2 => "http2",
-            Self::Http3 => "http3",
-            Self::Grpc => "grpc",
-            Self::Kafka => "kafka",
-            Self::Amqp => "amqp",
-            Self::Mqtt => "mqtt",
-            Self::GraphQl => "graphql",
-            Self::WebSocket => "websocket",
-            Self::Tcp => "tcp",
-            Self::Sql => "sql",
-            Self::Custom(label) => label,
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this protocol is request/response by nature.
     ///
     /// Used by the validator to flag synchronous coupling across trust boundaries.
     #[must_use]
     // The `Custom` arm shares a body with the synchronous group, but merging them would
     // hide that "unknown protocols default to synchronous" is a deliberate, conservative

---- conformance::tests::a_missing_protocol_is_reported stdout ----

thread 'conformance::tests::a_missing_protocol_is_reported' (425358) panicked at crates/casm-core/src/conformance.rs:690:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingProtocol { protocol, .. }] if protocol
    == "grpc")

failures:
    conformance::tests::a_missing_protocol_is_reported

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
