*** crates/casm-core/src/merkle.rs:112:9: replace Fingerprint::to_hex -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace Fingerprint::to_hex -> String with "xyzzy".into()
@@ -104,17 +104,17 @@
         crate::hex::decode(raw)
             .map(Self)
             .map_err(|reason| format!("fingerprint: {reason}"))
     }
 
     /// Renders the digest as 64 lowercase hexadecimal characters.
     #[must_use]
     pub fn to_hex(&self) -> String {
-        crate::hex::encode(&self.0)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders the leading `width` characters, for terminal output.
     ///
     /// Twelve is the conventional abbreviation and is ample: a collision within one
     /// repository's history is not a practical concern at 48 bits.
     #[must_use]
     pub fn abbreviated(&self, width: usize) -> String {

---- merkle::tests::a_renamed_node_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_renamed_node_changes_the_fingerprint' (442050) panicked at crates/casm-core/src/merkle.rs:694:9:
assertion `left != right` failed
  left: Fingerprint(xyzzy…)
 right: Fingerprint(xyzzy…)

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (442047) panicked at crates/casm-core/src/merkle.rs:735:9:
assertion `left != right` failed
  left: Fingerprint(xyzzy…)
 right: Fingerprint(xyzzy…)

---- merkle::tests::abbreviation_does_not_panic_on_an_over_long_width stdout ----

thread 'merkle::tests::abbreviation_does_not_panic_on_an_over_long_width' (442052) panicked at crates/casm-core/src/merkle.rs:962:9:
assertion `left == right` failed
  left: 5
 right: 64

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_renamed_node_changes_the_fingerprint
    merkle::tests::abbreviation_does_not_panic_on_an_over_long_width
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::fingerprints_render_and_parse_as_hex
    merkle::tests::fingerprints_round_trip_through_json
    merkle::tests::rebinding_a_role_changes_the_fingerprint
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_distinguishes_relationship_direction

test result: FAILED. 179 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
