*** crates/casm-core/src/merkle.rs:135:9: replace <impl fmt::Display for Fingerprint>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace <impl fmt::Display for Fingerprint>::fmt -> fmt::Result with Ok(Default::default())
@@ -127,17 +127,17 @@
     #[must_use]
     pub const fn as_bytes(&self) -> &[u8; DIGEST_LEN] {
         &self.0
     }
 }
 
 impl fmt::Display for Fingerprint {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(&self.to_hex())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Debug for Fingerprint {
     /// Abbreviated, so a log line stays readable.
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "Fingerprint({}…)", self.abbreviated(12))
     }

---- merkle::tests::fingerprints_round_trip_through_json stdout ----

thread 'merkle::tests::fingerprints_round_trip_through_json' (1627083) panicked at crates/casm-core/src/merkle.rs:1145:9:
assertion `left == right` failed: must serialise as a bare string
  left: "\"1283e4cbe26479f935b9e213b376560c623c016320fbf55e03da7ef9e5e24378\""
 right: "\"\""

failures:
    merkle::tests::fingerprints_round_trip_through_json

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
