*** crates/casm-core/src/merkle.rs:156:9: replace <impl From<Fingerprint> for String>::from -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace <impl From<Fingerprint> for String>::from -> Self with Default::default()
@@ -148,17 +148,17 @@
 
     fn try_from(value: String) -> Result<Self, Self::Error> {
         Self::parse_hex(&value)
     }
 }
 
 impl From<Fingerprint> for String {
     fn from(value: Fingerprint) -> Self {
-        value.to_hex()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Builds an unambiguous byte encoding of a value.
 ///
 /// Every field is length-prefixed rather than separated by a delimiter. A separator
 /// scheme would be forgeable: two nodes whose descriptions differ only by where a
 /// separator falls could encode identically, and the whole point of the digest is that

---- merkle::tests::fingerprints_round_trip_through_json stdout ----

thread 'merkle::tests::fingerprints_round_trip_through_json' (1627591) panicked at crates/casm-core/src/merkle.rs:1145:9:
assertion `left == right` failed: must serialise as a bare string
  left: "\"\""
 right: "\"1283e4cbe26479f935b9e213b376560c623c016320fbf55e03da7ef9e5e24378\""

failures:
    merkle::tests::fingerprints_round_trip_through_json

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
