*** crates/casm-core/src/merkle.rs:174:9: replace Encoder::text -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace Encoder::text -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -166,21 +166,17 @@
 #[derive(Default)]
 struct Encoder {
     buffer: Vec<u8>,
 }
 
 impl Encoder {
     /// Appends a length-prefixed string.
     fn text(&mut self, value: &str) -> &mut Self {
-        self.buffer
-            .extend_from_slice(value.len().to_string().as_bytes());
-        self.buffer.push(b':');
-        self.buffer.extend_from_slice(value.as_bytes());
-        self
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends an optional string, distinguishing absent from empty.
     fn optional(&mut self, value: Option<&str>) -> &mut Self {
         let Some(text) = value else {
             self.buffer.push(b'0');
             return self;
         };

---- merkle::tests::a_boolean_field_is_part_of_the_digest stdout ----

thread 'merkle::tests::a_boolean_field_is_part_of_the_digest' (1628685) panicked at crates/casm-core/src/merkle.rs:919:9:
assertion `left != right` failed: evidence-required must change the fingerprint
  left: Fingerprint(a9120b062843…)
 right: Fingerprint(a9120b062843…)

---- merkle::tests::a_renamed_node_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_renamed_node_changes_the_fingerprint' (1628691) panicked at crates/casm-core/src/merkle.rs:690:9:
assertion `left != right` failed
  left: Fingerprint(a9120b062843…)
 right: Fingerprint(a9120b062843…)

---- merkle::tests::a_version_bump_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_version_bump_changes_the_fingerprint' (1628692) panicked at crates/casm-core/src/merkle.rs:698:9:
assertion `left != right` failed
  left: Fingerprint(a9120b062843…)
 right: Fingerprint(a9120b062843…)

failures:
    merkle::tests::a_boolean_field_is_part_of_the_digest
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint
    merkle::tests::a_renamed_node_changes_the_fingerprint
    merkle::tests::a_version_bump_changes_the_fingerprint
    merkle::tests::adding_a_control_changes_the_fingerprint
    merkle::tests::an_absent_description_differs_from_an_empty_one
    merkle::tests::changed_nodes_includes_additions_and_removals
    merkle::tests::changed_nodes_reports_only_what_actually_differs
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::every_relationship_gets_its_own_entry_keyed_by_what_it_connects
    merkle::tests::field_boundaries_cannot_be_forged_by_shifting_text

test result: FAILED. 187 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
