*** crates/casm-core/src/merkle.rs:183:9: replace Encoder::optional -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace Encoder::optional -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -175,22 +175,17 @@
             .extend_from_slice(value.len().to_string().as_bytes());
         self.buffer.push(b':');
         self.buffer.extend_from_slice(value.as_bytes());
         self
     }
 
     /// Appends an optional string, distinguishing absent from empty.
     fn optional(&mut self, value: Option<&str>) -> &mut Self {
-        let Some(text) = value else {
-            self.buffer.push(b'0');
-            return self;
-        };
-        self.buffer.push(b'1');
-        self.text(text)
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends an optional number.
     fn optional_number(&mut self, value: Option<u64>) -> &mut Self {
         self.optional(value.map(|number| number.to_string()).as_deref())
     }
 
     /// Appends a boolean.

---- merkle::tests::a_version_bump_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_version_bump_changes_the_fingerprint' (446485) panicked at crates/casm-core/src/merkle.rs:697:9:
assertion `left != right` failed
  left: Fingerprint(5de73b6dede8…)
 right: Fingerprint(5de73b6dede8…)

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (446480) panicked at crates/casm-core/src/merkle.rs:730:9:
assertion `left != right` failed
  left: Fingerprint(2ca9d2b757db…)
 right: Fingerprint(2ca9d2b757db…)

---- merkle::tests::an_absent_description_differs_from_an_empty_one stdout ----

thread 'merkle::tests::an_absent_description_differs_from_an_empty_one' (446507) panicked at crates/casm-core/src/merkle.rs:787:9:
assertion `left != right` failed
  left: Fingerprint(4f7fbb730b55…)
 right: Fingerprint(4f7fbb730b55…)

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_version_bump_changes_the_fingerprint
    merkle::tests::an_absent_description_differs_from_an_empty_one
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_distinguishes_relationship_direction

test result: FAILED. 183 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
