*** crates/casm-core/src/merkle.rs:193:9: replace Encoder::optional_number -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace Encoder::optional_number -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -185,17 +185,17 @@
             return self;
         };
         self.buffer.push(b'1');
         self.text(text)
     }
 
     /// Appends an optional number.
     fn optional_number(&mut self, value: Option<u64>) -> &mut Self {
-        self.optional(value.map(|number| number.to_string()).as_deref())
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends a boolean.
     fn flag(&mut self, value: bool) -> &mut Self {
         self.buffer.push(if value { b'T' } else { b'F' });
         self
     }

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (446519) panicked at crates/casm-core/src/merkle.rs:735:9:
assertion `left != right` failed
  left: Fingerprint(2a9c49de7b06…)
 right: Fingerprint(2a9c49de7b06…)

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
