*** crates/casm-core/src/merkle.rs:204:9: replace Encoder::map -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace Encoder::map -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -196,21 +196,17 @@
     /// Appends a boolean.
     fn flag(&mut self, value: bool) -> &mut Self {
         self.buffer.push(if value { b'T' } else { b'F' });
         self
     }
 
     /// Appends a sorted key/value map.
     fn map(&mut self, entries: &BTreeMap<String, String>) -> &mut Self {
-        self.text(&entries.len().to_string());
-        for (key, value) in entries {
-            self.text(key).text(value);
-        }
-        self
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finishes, producing the digest under `label`.
     fn finish(&self, label: &str) -> Fingerprint {
         Fingerprint::of(label, &self.buffer)
     }
 }

---- merkle::tests::a_version_bump_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_version_bump_changes_the_fingerprint' (447646) panicked at crates/casm-core/src/merkle.rs:698:9:
assertion `left != right` failed
  left: Fingerprint(149df7eb4082…)
 right: Fingerprint(149df7eb4082…)

---- merkle::tests::rebinding_a_role_changes_the_fingerprint stdout ----

thread 'merkle::tests::rebinding_a_role_changes_the_fingerprint' (447664) panicked at crates/casm-core/src/merkle.rs:1030:9:
assertion `left != right` failed
  left: Fingerprint(3c8f0f3ad6cc…)
 right: Fingerprint(3c8f0f3ad6cc…)

failures:
    merkle::tests::a_version_bump_changes_the_fingerprint
    merkle::tests::rebinding_a_role_changes_the_fingerprint

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
