*** crates/casm-core/src/merkle.rs:413:5: replace sorted_digests -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace sorted_digests -> Vec<String> with vec!["xyzzy".into()]
@@ -405,19 +405,17 @@
         })
         .collect();
 
     encoder.map(&bindings).finish("conformance")
 }
 
 /// Renders digests as hex and sorts them, making the combination order-independent.
 fn sorted_digests(digests: impl Iterator<Item = Fingerprint>) -> Vec<String> {
-    let mut rendered: Vec<String> = digests.map(|digest| digest.to_hex()).collect();
-    rendered.sort_unstable();
-    rendered
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// The Merkle tree of an architecture: a root digest plus every subtree beneath it.
 ///
 /// The per-node digests are what make `casm blame` possible — attributing a change to a
 /// single node means finding the commit where that node's subtree digest last differed.
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct MerkleTree {

---- merkle::tests::a_renamed_node_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_renamed_node_changes_the_fingerprint' (449775) panicked at crates/casm-core/src/merkle.rs:692:9:
assertion `left != right` failed
  left: Fingerprint(965d8544443d…)
 right: Fingerprint(965d8544443d…)

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (449772) panicked at crates/casm-core/src/merkle.rs:733:9:
assertion `left != right` failed
  left: Fingerprint(2fab08d16089…)
 right: Fingerprint(2fab08d16089…)

---- merkle::tests::declaring_conformance_changes_the_fingerprint stdout ----

thread 'merkle::tests::declaring_conformance_changes_the_fingerprint' (449797) panicked at crates/casm-core/src/merkle.rs:992:9:
assertion `left != right` failed
  left: Fingerprint(965d8544443d…)
 right: Fingerprint(965d8544443d…)

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_renamed_node_changes_the_fingerprint
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::rebinding_a_role_changes_the_fingerprint
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_distinguishes_relationship_direction

test result: FAILED. 182 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
