*** crates/casm-core/src/merkle.rs:512:9: replace MerkleTree::node -> Option<Fingerprint> with None

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace MerkleTree::node -> Option<Fingerprint> with None
@@ -504,17 +504,17 @@
     #[must_use]
     pub const fn conformance_root(&self) -> Fingerprint {
         self.conformance_root
     }
 
     /// The digest of one node, by name.
     #[must_use]
     pub fn node(&self, name: &str) -> Option<Fingerprint> {
-        self.nodes.get(name).copied()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every node digest, in name order.
     #[must_use]
     pub const fn nodes(&self) -> &BTreeMap<String, Fingerprint> {
         &self.nodes
     }

---- merkle::tests::the_tree_exposes_a_digest_per_node stdout ----

thread 'merkle::tests::the_tree_exposes_a_digest_per_node' (450697) panicked at crates/casm-core/src/merkle.rs:829:9:
assertion failed: tree.node("api").is_some()

failures:
    merkle::tests::the_tree_exposes_a_digest_per_node

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
