*** crates/casm-core/src/merkle.rs:533:9: replace MerkleTree::changed_nodes -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace MerkleTree::changed_nodes -> Vec<String> with vec![String::new()]
@@ -525,34 +525,17 @@
     }
 
     /// Returns the names of nodes whose digests differ between two trees.
     ///
     /// Includes nodes present in only one of them. This is the primitive behind
     /// "which nodes did this commit touch".
     #[must_use]
     pub fn changed_nodes(&self, other: &Self) -> Vec<String> {
-        let mut changed: Vec<String> = self
-            .nodes
-            .iter()
-            .filter(|(name, digest)| other.nodes.get(*name) != Some(digest))
-            .map(|(name, _)| name.clone())
-            .collect();
-
-        changed.extend(
-            other
-                .nodes
-                .keys()
-                .filter(|name| !self.nodes.contains_key(*name))
-                .cloned(),
-        );
-
-        changed.sort_unstable();
-        changed.dedup();
-        changed
+        vec![String::new()] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The name-based identity of a relationship.
 fn edge_key(architecture: &Architecture, edge: &Relationship) -> String {
     let name_of = |id| {
         architecture
             .node(id)

---- merkle::tests::changed_nodes_is_empty_for_identical_trees stdout ----

thread 'merkle::tests::changed_nodes_is_empty_for_identical_trees' (1636102) panicked at crates/casm-core/src/merkle.rs:1072:9:
assertion failed: tree.changed_nodes(&tree).is_empty()

---- merkle::tests::changed_nodes_includes_additions_and_removals stdout ----

thread 'merkle::tests::changed_nodes_includes_additions_and_removals' (1636101) panicked at crates/casm-core/src/merkle.rs:1065:9:
removed: [""]

---- merkle::tests::changed_nodes_reports_only_what_actually_differs stdout ----

thread 'merkle::tests::changed_nodes_reports_only_what_actually_differs' (1636105) panicked at crates/casm-core/src/merkle.rs:1043:9:
assertion `left == right` failed
  left: [""]
 right: ["db"]

failures:
    merkle::tests::changed_nodes_includes_additions_and_removals
    merkle::tests::changed_nodes_is_empty_for_identical_trees
    merkle::tests::changed_nodes_reports_only_what_actually_differs

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
