*** crates/casm-core/src/merkle.rs:536:61: replace != with == in MerkleTree::changed_nodes

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace != with == in MerkleTree::changed_nodes
@@ -528,17 +528,17 @@
     ///
     /// Includes nodes present in only one of them. This is the primitive behind
     /// "which nodes did this commit touch".
     #[must_use]
     pub fn changed_nodes(&self, other: &Self) -> Vec<String> {
         let mut changed: Vec<String> = self
             .nodes
             .iter()
-            .filter(|(name, digest)| other.nodes.get(*name) != Some(digest))
+            .filter(|(name, digest)| other.nodes.get(*name) == /* ~ changed by cargo-mutants ~ */ Some(digest))
             .map(|(name, _)| name.clone())
             .collect();
 
         changed.extend(
             other
                 .nodes
                 .keys()
                 .filter(|name| !self.nodes.contains_key(*name))

---- merkle::tests::changed_nodes_reports_only_what_actually_differs stdout ----

thread 'merkle::tests::changed_nodes_reports_only_what_actually_differs' (1636432) panicked at crates/casm-core/src/merkle.rs:1060:9:
assertion `left == right` failed
  left: ["api"]
 right: ["db"]

---- merkle::tests::changed_nodes_includes_additions_and_removals stdout ----

thread 'merkle::tests::changed_nodes_includes_additions_and_removals' (1636430) panicked at crates/casm-core/src/merkle.rs:1082:9:
removed: []

---- merkle::tests::changed_nodes_is_empty_for_identical_trees stdout ----

thread 'merkle::tests::changed_nodes_is_empty_for_identical_trees' (1636431) panicked at crates/casm-core/src/merkle.rs:1089:9:
assertion failed: tree.changed_nodes(&tree).is_empty()

failures:
    merkle::tests::changed_nodes_includes_additions_and_removals
    merkle::tests::changed_nodes_is_empty_for_identical_trees
    merkle::tests::changed_nodes_reports_only_what_actually_differs

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
