*** crates/casm-core/src/merkle.rs:544:32: delete ! in MerkleTree::changed_nodes

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ delete ! in MerkleTree::changed_nodes
@@ -536,17 +536,17 @@
             .filter(|(name, digest)| other.nodes.get(*name) != Some(digest))
             .map(|(name, _)| name.clone())
             .collect();
 
         changed.extend(
             other
                 .nodes
                 .keys()
-                .filter(|name| !self.nodes.contains_key(*name))
+                .filter(|name|  /* ~ changed by cargo-mutants ~ */self.nodes.contains_key(*name))
                 .cloned(),
         );
 
         changed.sort_unstable();
         changed.dedup();
         changed
     }
 }

---- merkle::tests::changed_nodes_is_empty_for_identical_trees stdout ----

thread 'merkle::tests::changed_nodes_is_empty_for_identical_trees' (454215) panicked at crates/casm-core/src/merkle.rs:913:9:
assertion failed: tree.changed_nodes(&tree).is_empty()

---- merkle::tests::changed_nodes_reports_only_what_actually_differs stdout ----

thread 'merkle::tests::changed_nodes_reports_only_what_actually_differs' (454216) panicked at crates/casm-core/src/merkle.rs:884:9:
assertion `left == right` failed
  left: ["api", "db"]
 right: ["db"]

failures:
    merkle::tests::changed_nodes_is_empty_for_identical_trees
    merkle::tests::changed_nodes_reports_only_what_actually_differs

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
