*** crates/casm-core/src/node.rs:164:9: replace NodeConfig::interface -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace NodeConfig::interface -> Self with Default::default()
@@ -156,18 +156,17 @@
     pub fn description(mut self, description: impl Into<String>) -> Self {
         self.description = Some(description.into());
         self
     }
 
     /// Adds an interface this node exposes.
     #[must_use]
     pub fn interface(mut self, interface: Interface) -> Self {
-        self.interfaces.push(interface);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Adds a control this node is asserted to satisfy.
     #[must_use]
     pub fn control(mut self, control: Control) -> Self {
         self.controls.push(control);
         self
     }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (468261) panicked at crates/casm-core/src/conformance.rs:470:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (468263) panicked at crates/casm-core/src/conformance.rs:470:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (468264) panicked at crates/casm-core/src/conformance.rs:470:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::a_vacuous_pattern_is_satisfied_by_anything
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::checking_is_deterministic

test result: FAILED. 151 passed; 37 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
