*** crates/casm-core/src/node.rs:171:9: replace NodeConfig::control -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace NodeConfig::control -> Self with Default::default()
@@ -163,18 +163,17 @@
     pub fn interface(mut self, interface: Interface) -> Self {
         self.interfaces.push(interface);
         self
     }
 
     /// Adds a control this node is asserted to satisfy.
     #[must_use]
     pub fn control(mut self, control: Control) -> Self {
-        self.controls.push(control);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Attaches an arbitrary key/value annotation.
     ///
     /// Stored in a `BTreeMap` so serialisation order is deterministic (NASA Rule 8).
     #[must_use]
     pub fn metadata(mut self, key: impl Into<String>, value: impl Into<String>) -> Self {
         self.metadata.insert(key.into(), value.into());

---- conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate stdout ----

thread 'conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate' (1652529) panicked at crates/casm-core/src/conformance.rs:470:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1652526) panicked at crates/casm-core/src/conformance.rs:470:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1652533) panicked at crates/casm-core/src/conformance.rs:470:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::a_vacuous_pattern_is_satisfied_by_anything
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::checking_is_deterministic

test result: FAILED. 167 passed; 38 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
