*** crates/casm-core/src/node.rs:308:9: replace Node::interfaces -> &[Interface] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace Node::interfaces -> &[Interface] with Vec::leak(Vec::new())
@@ -300,17 +300,17 @@
     pub fn description(&self) -> Option<&str> {
         self.description.as_deref()
     }
 
     /// The interfaces this node exposes.
     #[inline]
     #[must_use]
     pub fn interfaces(&self) -> &[Interface] {
-        &self.interfaces
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The controls this node is asserted to satisfy.
     #[inline]
     #[must_use]
     pub fn controls(&self) -> &[Control] {
         &self.controls
     }

---- conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at stdout ----

thread 'conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at' (1657312) panicked at crates/casm-core/src/conformance.rs:561:22:
expected one Ambiguous, got [MissingProtocol { role: "edge", node: "edge", protocol: "http2" }, Ambiguous { role: "application", node_type: "service", candidates: ["orders", "payments"] }]

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1657314) panicked at crates/casm-core/src/conformance.rs:583:9:
[MissingProtocol { role: "edge", node: "edge", protocol: "http2" }]

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1657305) panicked at crates/casm-core/src/conformance.rs:519:9:
[MissingProtocol { role: "edge", node: "edge", protocol: "http2" }]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    node::tests::build_accepts_distinct_interface_names

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
