*** crates/casm-core/src/node.rs:328:9: replace Node::interface -> Option<&Interface> with None

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace Node::interface -> Option<&Interface> with None
@@ -320,19 +320,17 @@
     #[must_use]
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }
 
     /// Looks up an exposed interface by name.
     #[must_use]
     pub fn interface(&self, name: &str) -> Option<&Interface> {
-        self.interfaces
-            .iter()
-            .find(|iface| iface.name().as_str() == name)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Counts the controls of a given type.
     ///
     /// This is the primitive behind rules such as "every service must declare at least
     /// two security controls".
     #[must_use]
     pub fn controls_of_type(&self, control_type: crate::control::ControlType) -> usize {

---- node::tests::interface_lookup_is_by_exact_name stdout ----

thread 'node::tests::interface_lookup_is_by_exact_name' (1659754) panicked at crates/casm-core/src/node.rs:484:9:
assertion failed: node.interface("public-api").is_some()

---- node::tests::with_interface_rejects_a_duplicate_at_runtime stdout ----

thread 'node::tests::with_interface_rejects_a_duplicate_at_runtime' (1659761) panicked at crates/casm-core/src/node.rs:474:14:

failures:
    node::tests::interface_lookup_is_by_exact_name
    node::tests::with_interface_rejects_a_duplicate_at_runtime

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
