*** crates/casm-core/src/node.rs:330:49: replace == with != in Node::interface

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace == with != in Node::interface
@@ -322,17 +322,17 @@
         &self.metadata
     }
 
     /// Looks up an exposed interface by name.
     #[must_use]
     pub fn interface(&self, name: &str) -> Option<&Interface> {
         self.interfaces
             .iter()
-            .find(|iface| iface.name().as_str() == name)
+            .find(|iface| iface.name().as_str() != /* ~ changed by cargo-mutants ~ */ name)
     }
 
     /// Counts the controls of a given type.
     ///
     /// This is the primitive behind rules such as "every service must declare at least
     /// two security controls".
     #[must_use]
     pub fn controls_of_type(&self, control_type: crate::control::ControlType) -> usize {

---- node::tests::interface_lookup_is_by_exact_name stdout ----

thread 'node::tests::interface_lookup_is_by_exact_name' (1660262) panicked at crates/casm-core/src/node.rs:486:9:
assertion failed: node.interface("public-api").is_some()

---- node::tests::with_interface_rejects_a_duplicate_at_runtime stdout ----

thread 'node::tests::with_interface_rejects_a_duplicate_at_runtime' (1660269) panicked at crates/casm-core/src/node.rs:476:14:

failures:
    node::tests::interface_lookup_is_by_exact_name
    node::tests::with_interface_rejects_a_duplicate_at_runtime

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
