*** crates/casm-core/src/node.rs:348:9: replace Node::has_control_tagged -> bool with false

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace Node::has_control_tagged -> bool with false
@@ -340,17 +340,17 @@
             .iter()
             .filter(|c| c.control_type() == control_type)
             .count()
     }
 
     /// Returns `true` if any attached control carries `tag`.
     #[must_use]
     pub fn has_control_tagged(&self, tag: &str) -> bool {
-        self.controls.iter().any(|control| control.has_tag(tag))
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a copy of this node with an additional interface.
     ///
     /// # Errors
     ///
     /// Returns [`NodeError::DuplicateInterface`] if the name is already exposed.
     pub fn with_interface(mut self, interface: Interface) -> Result<Self, NodeError> {

---- node::tests::has_control_tagged_searches_every_control stdout ----

thread 'node::tests::has_control_tagged_searches_every_control' (478776) panicked at crates/casm-core/src/node.rs:512:9:
assertion failed: node.has_control_tagged("pci-dss")

failures:
    node::tests::has_control_tagged_searches_every_control

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
