*** crates/casm-core/src/pattern.rs:128:12: delete ! in Requirement::requiring_protocol

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ delete ! in Requirement::requiring_protocol
@@ -120,17 +120,17 @@
             self.required_control_types.push(control_type);
         }
         self
     }
 
     /// Requires an interface speaking the given protocol.
     #[must_use]
     pub fn requiring_protocol(mut self, protocol: Protocol) -> Self {
-        if !self.required_protocols.contains(&protocol) {
+        if  /* ~ changed by cargo-mutants ~ */self.required_protocols.contains(&protocol) {
             self.required_protocols.push(protocol);
         }
         self
     }
 
     /// The role's name.
     #[inline]
     #[must_use]

---- conformance::tests::a_missing_protocol_is_reported stdout ----

thread 'conformance::tests::a_missing_protocol_is_reported' (1665897) panicked at crates/casm-core/src/conformance.rs:690:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingProtocol { protocol, .. }] if protocol
    == "grpc")

---- conformance::tests::every_unmet_variant_renders_a_message_naming_its_role stdout ----

thread 'conformance::tests::every_unmet_variant_renders_a_message_naming_its_role' (1665905) panicked at crates/casm-core/src/conformance.rs:811:9:
assertion `left == right` failed
  left: 2
 right: 3

---- pattern::tests::requirement_builders_deduplicate stdout ----

thread 'pattern::tests::requirement_builders_deduplicate' (1666093) panicked at crates/casm-core/src/pattern.rs:844:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    pattern::tests::requirement_builders_deduplicate

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
