*** crates/casm-core/src/pattern.rs:166:9: replace Requirement::required_control_types -> &[ControlType] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Requirement::required_control_types -> &[ControlType] with Vec::leak(Vec::new())
@@ -158,17 +158,17 @@
     pub const fn min_security_controls(&self) -> usize {
         self.min_security_controls
     }
 
     /// Control types the node must declare.
     #[inline]
     #[must_use]
     pub fn required_control_types(&self) -> &[ControlType] {
-        &self.required_control_types
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Protocols the node must expose.
     #[inline]
     #[must_use]
     pub fn required_protocols(&self) -> &[Protocol] {
         &self.required_protocols
     }

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (1670162) panicked at crates/casm-core/src/conformance.rs:671:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingControlType { control_type, .. }] if
    control_type == "compliance")

---- conformance::tests::every_unmet_variant_renders_a_message_naming_its_role stdout ----

thread 'conformance::tests::every_unmet_variant_renders_a_message_naming_its_role' (1670179) panicked at crates/casm-core/src/conformance.rs:811:9:
assertion `left == right` failed
  left: 2
 right: 3

---- pattern::tests::requirement_builders_deduplicate stdout ----

thread 'pattern::tests::requirement_builders_deduplicate' (1670361) panicked at crates/casm-core/src/pattern.rs:843:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    pattern::tests::requirement_builders_deduplicate

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
