*** crates/casm-core/src/pattern.rs:173:9: replace Requirement::required_protocols -> &[Protocol] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Requirement::required_protocols -> &[Protocol] with Vec::leak(Vec::new())
@@ -165,17 +165,17 @@
     pub fn required_control_types(&self) -> &[ControlType] {
         &self.required_control_types
     }
 
     /// Protocols the node must expose.
     #[inline]
     #[must_use]
     pub fn required_protocols(&self) -> &[Protocol] {
-        &self.required_protocols
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A relationship that must hold between two roles.
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(deny_unknown_fields, rename_all = "kebab-case")]
 pub struct RequiredRelationship {
     /// The originating role.

---- conformance::tests::a_missing_protocol_is_reported stdout ----

thread 'conformance::tests::a_missing_protocol_is_reported' (1670445) panicked at crates/casm-core/src/conformance.rs:690:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingProtocol { protocol, .. }] if protocol
    == "grpc")

---- conformance::tests::every_unmet_variant_renders_a_message_naming_its_role stdout ----

thread 'conformance::tests::every_unmet_variant_renders_a_message_naming_its_role' (1670454) panicked at crates/casm-core/src/conformance.rs:811:9:
assertion `left == right` failed
  left: 2
 right: 3

---- pattern::tests::requirement_builders_deduplicate stdout ----

thread 'pattern::tests::requirement_builders_deduplicate' (1670596) panicked at crates/casm-core/src/pattern.rs:844:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    pattern::tests::requirement_builders_deduplicate

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
