*** crates/casm-core/src/pattern.rs:294:9: replace PatternConfig::description -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternConfig::description -> Self with Default::default()
@@ -286,18 +286,17 @@
     pub fn version(mut self, version: impl Into<String>) -> Self {
         self.version = Some(version.into());
         self
     }
 
     /// Sets a human-readable description.
     #[must_use]
     pub fn description(mut self, description: impl Into<String>) -> Self {
-        self.description = Some(description.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Adds a requirement.
     #[must_use]
     pub fn requirement(mut self, requirement: Requirement) -> Self {
         self.requirements.push(requirement);
         self
     }

---- pattern::tests::a_fingerprint_changes_when_the_shape_changes stdout ----

thread 'pattern::tests::a_fingerprint_changes_when_the_shape_changes' (491833) panicked at crates/casm-core/src/pattern.rs:994:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- pattern::tests::a_pattern_exposes_its_requirements_by_role stdout ----

thread 'pattern::tests::a_pattern_exposes_its_requirements_by_role' (491837) panicked at crates/casm-core/src/pattern.rs:716:14:
sample pattern is valid: MissingField { field: "name" }

---- pattern::tests::a_fingerprint_ignores_declaration_order stdout ----

thread 'pattern::tests::a_fingerprint_ignores_declaration_order' (491836) panicked at crates/casm-core/src/pattern.rs:971:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

failures:
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_ignores_declaration_order
    pattern::tests::a_pattern_exposes_its_requirements_by_role
    pattern::tests::a_pattern_round_trips_through_json
    pattern::tests::a_reference_is_name_at_version
    pattern::tests::a_reference_requires_an_exact_version
    pattern::tests::references_parse_and_match
    pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde
    pattern::tests::verify_invariants_passes_on_a_constructed_pattern

test result: FAILED. 179 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
