*** crates/casm-core/src/pattern.rs:301:9: replace PatternConfig::requirement -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternConfig::requirement -> Self with Default::default()
@@ -293,18 +293,17 @@
     pub fn description(mut self, description: impl Into<String>) -> Self {
         self.description = Some(description.into());
         self
     }
 
     /// Adds a requirement.
     #[must_use]
     pub fn requirement(mut self, requirement: Requirement) -> Self {
-        self.requirements.push(requirement);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Adds a required relationship.
     #[must_use]
     pub fn relationship(mut self, relationship: RequiredRelationship) -> Self {
         self.relationships.push(relationship);
         self
     }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1675222) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (1675224) panicked at crates/casm-core/src/conformance.rs:668:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate stdout ----

thread 'conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate' (1675225) panicked at crates/casm-core/src/conformance.rs:592:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::checking_is_deterministic
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role

test result: FAILED. 175 passed; 30 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
