*** crates/casm-core/src/pattern.rs:315:9: replace PatternConfig::satisfies -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternConfig::satisfies -> Self with Default::default()
@@ -307,21 +307,17 @@
     pub fn relationship(mut self, relationship: RequiredRelationship) -> Self {
         self.relationships.push(relationship);
         self
     }
 
     /// Declares a standard this pattern helps satisfy, such as `SOC2-CC6.1`.
     #[must_use]
     pub fn satisfies(mut self, standard: impl Into<String>) -> Self {
-        let standard = standard.into();
-        if !self.satisfies.contains(&standard) {
-            self.satisfies.push(standard);
-        }
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Attaches an annotation.
     #[must_use]
     pub fn metadata(mut self, key: impl Into<String>, value: impl Into<String>) -> Self {
         self.metadata.insert(key.into(), value.into());
         self
     }

---- pattern::tests::a_fingerprint_changes_when_the_shape_changes stdout ----

thread 'pattern::tests::a_fingerprint_changes_when_the_shape_changes' (493553) panicked at crates/casm-core/src/pattern.rs:991:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- pattern::tests::a_fingerprint_ignores_declaration_order stdout ----

thread 'pattern::tests::a_fingerprint_ignores_declaration_order' (493556) panicked at crates/casm-core/src/pattern.rs:968:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- pattern::tests::a_fingerprint_distinguishes_the_compliance_claim stdout ----

thread 'pattern::tests::a_fingerprint_distinguishes_the_compliance_claim' (493555) panicked at crates/casm-core/src/pattern.rs:1004:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

failures:
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_distinguishes_the_compliance_claim
    pattern::tests::a_fingerprint_ignores_declaration_order
    pattern::tests::a_pattern_exposes_its_requirements_by_role
    pattern::tests::a_pattern_round_trips_through_json
    pattern::tests::a_reference_is_name_at_version
    pattern::tests::a_reference_requires_an_exact_version
    pattern::tests::references_parse_and_match
    pattern::tests::satisfied_standards_are_deduplicated
    pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde
    pattern::tests::verify_invariants_passes_on_a_constructed_pattern

test result: FAILED. 177 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
