*** crates/casm-core/src/pattern.rs:316:12: delete ! in PatternConfig::satisfies

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ delete ! in PatternConfig::satisfies
@@ -308,17 +308,17 @@
         self.relationships.push(relationship);
         self
     }
 
     /// Declares a standard this pattern helps satisfy, such as `SOC2-CC6.1`.
     #[must_use]
     pub fn satisfies(mut self, standard: impl Into<String>) -> Self {
         let standard = standard.into();
-        if !self.satisfies.contains(&standard) {
+        if  /* ~ changed by cargo-mutants ~ */self.satisfies.contains(&standard) {
             self.satisfies.push(standard);
         }
         self
     }
 
     /// Attaches an annotation.
     #[must_use]
     pub fn metadata(mut self, key: impl Into<String>, value: impl Into<String>) -> Self {

---- pattern::tests::a_fingerprint_distinguishes_the_compliance_claim stdout ----

thread 'pattern::tests::a_fingerprint_distinguishes_the_compliance_claim' (493799) panicked at crates/casm-core/src/pattern.rs:1009:9:
assertion `left != right` failed
  left: Fingerprint(a31277e0263d…)
 right: Fingerprint(a31277e0263d…)

---- pattern::tests::satisfied_standards_are_deduplicated stdout ----

thread 'pattern::tests::satisfied_standards_are_deduplicated' (493822) panicked at crates/casm-core/src/pattern.rs:950:9:
assertion `left == right` failed
  left: []
 right: ["SOC2", "ISO27001"]

failures:
    pattern::tests::a_fingerprint_distinguishes_the_compliance_claim
    pattern::tests::satisfied_standards_are_deduplicated

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
