*** crates/casm-core/src/pattern.rs:365:9: replace PatternConfig::reject_duplicate_roles -> Result<(), PatternError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternConfig::reject_duplicate_roles -> Result<(), PatternError> with Ok(())
@@ -357,28 +357,17 @@
             relationships: self.relationships,
             satisfies: self.satisfies,
             metadata: self.metadata,
         })
     }
 
     /// Enforces that role names are unique.
     fn reject_duplicate_roles(requirements: &[Requirement]) -> Result<(), PatternError> {
-        for (index, candidate) in requirements.iter().enumerate() {
-            let duplicated = requirements
-                .iter()
-                .take(index)
-                .any(|earlier| earlier.role() == candidate.role());
-            if duplicated {
-                return Err(PatternError::DuplicateRole {
-                    role: candidate.role().as_str().to_owned(),
-                });
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Enforces that every relationship references a declared role.
     fn reject_unknown_roles(
         requirements: &[Requirement],
         relationships: &[RequiredRelationship],
     ) -> Result<(), PatternError> {
         let declares = |role: &Name| {

---- pattern::tests::build_rejects_a_duplicated_role stdout ----

thread 'pattern::tests::build_rejects_a_duplicated_role' (494712) panicked at crates/casm-core/src/pattern.rs:753:14:

failures:
    pattern::tests::build_rejects_a_duplicated_role

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
