*** crates/casm-core/src/pattern.rs:387:55: replace == with != in PatternConfig::reject_unknown_roles

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace == with != in PatternConfig::reject_unknown_roles
@@ -379,17 +379,17 @@
     /// Enforces that every relationship references a declared role.
     fn reject_unknown_roles(
         requirements: &[Requirement],
         relationships: &[RequiredRelationship],
     ) -> Result<(), PatternError> {
         let declares = |role: &Name| {
             requirements
                 .iter()
-                .any(|requirement| requirement.role() == role)
+                .any(|requirement| requirement.role() != /* ~ changed by cargo-mutants ~ */ role)
         };
 
         for relationship in relationships {
             for (endpoint, role) in [
                 ("source", relationship.source()),
                 ("target", relationship.target()),
             ] {
                 if !declares(role) {

---- pattern::tests::build_names_which_endpoint_was_unknown stdout ----

thread 'pattern::tests::build_names_which_endpoint_was_unknown' (496910) panicked at crates/casm-core/src/pattern.rs:807:9:
assertion failed: matches!(error, PatternError::UnknownRole { endpoint: "source", .. })

---- pattern::tests::build_rejects_a_relationship_naming_an_undeclared_role stdout ----

thread 'pattern::tests::build_rejects_a_relationship_naming_an_undeclared_role' (496913) panicked at crates/casm-core/src/pattern.rs:787:9:
assertion `left == right` failed
  left: UnknownRole { endpoint: "source", role: "edge" }
 right: UnknownRole { endpoint: "target", role: "ghost" }

---- pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde stdout ----

thread 'pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde' (496921) panicked at crates/casm-core/src/pattern.rs:908:9:
assertion failed: matches!(smuggled.verify_invariants(), Err(PatternError::UnknownRole { .. }))

failures:
    pattern::tests::build_names_which_endpoint_was_unknown
    pattern::tests::build_rejects_a_relationship_naming_an_undeclared_role
    pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde

test result: FAILED. 185 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
