*** crates/casm-core/src/pattern.rs:447:9: replace Pattern::builder -> PatternConfig with Default::default()

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::builder -> PatternConfig with Default::default()
@@ -439,17 +439,17 @@
     #[serde(default, skip_serializing_if = "BTreeMap::is_empty")]
     metadata: BTreeMap<String, String>,
 }
 
 impl Pattern {
     /// Begins two-phase construction.
     #[must_use]
     pub fn builder() -> PatternConfig {
-        PatternConfig::new()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The pattern's name.
     #[inline]
     #[must_use]
     pub const fn name(&self) -> &Name {
         &self.name
     }

*** result: Success
