*** crates/casm-core/src/pattern.rs:468:9: replace Pattern::description -> Option<&str> with Some("")

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::description -> Option<&str> with Some("")
@@ -460,17 +460,17 @@
     pub const fn version(&self) -> &Version {
         &self.version
     }
 
     /// The human-readable description.
     #[inline]
     #[must_use]
     pub fn description(&self) -> Option<&str> {
-        self.description.as_deref()
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every requirement, in declaration order.
     #[inline]
     #[must_use]
     pub fn requirements(&self) -> &[Requirement] {
         &self.requirements
     }

---- pattern::tests::a_pattern_and_its_parts_report_what_they_were_built_with stdout ----

thread 'pattern::tests::a_pattern_and_its_parts_report_what_they_were_built_with' (1683436) panicked at crates/casm-core/src/pattern.rs:950:9:
assertion `left == right` failed
  left: Some("")
 right: Some("One governed gateway")

failures:
    pattern::tests::a_pattern_and_its_parts_report_what_they_were_built_with

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
