*** crates/casm-core/src/pattern.rs:475:9: replace Pattern::requirements -> &[Requirement] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::requirements -> &[Requirement] with Vec::leak(Vec::new())
@@ -467,17 +467,17 @@
     pub fn description(&self) -> Option<&str> {
         self.description.as_deref()
     }
 
     /// Every requirement, in declaration order.
     #[inline]
     #[must_use]
     pub fn requirements(&self) -> &[Requirement] {
-        &self.requirements
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every required relationship.
     #[inline]
     #[must_use]
     pub fn relationships(&self) -> &[RequiredRelationship] {
         &self.relationships
     }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1684226) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::a_missing_protocol_is_reported stdout ----

thread 'conformance::tests::a_missing_protocol_is_reported' (1684231) panicked at crates/casm-core/src/conformance.rs:690:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingProtocol { protocol, .. }] if protocol
    == "grpc")

---- conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at stdout ----

thread 'conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at' (1684233) panicked at crates/casm-core/src/conformance.rs:561:22:
expected one Ambiguous, got []

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::relationship_direction_matters
    conformance::tests::roles_bind_automatically_when_exactly_one_node_fits
    conformance::tests::too_few_security_controls_is_repor

test result: FAILED. 191 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
