*** crates/casm-core/src/pattern.rs:482:9: replace Pattern::relationships -> &[RequiredRelationship] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::relationships -> &[RequiredRelationship] with Vec::leak(Vec::new())
@@ -474,17 +474,17 @@
     pub fn requirements(&self) -> &[Requirement] {
         &self.requirements
     }
 
     /// Every required relationship.
     #[inline]
     #[must_use]
     pub fn relationships(&self) -> &[RequiredRelationship] {
-        &self.relationships
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The standards this pattern helps satisfy.
     #[inline]
     #[must_use]
     pub fn satisfies(&self) -> &[String] {
         &self.satisfies
     }

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1685336) panicked at crates/casm-core/src/conformance.rs:723:22:
expected MissingRelationship, got []

---- conformance::tests::relationship_direction_matters stdout ----

thread 'conformance::tests::relationship_direction_matters' (1685345) panicked at crates/casm-core/src/conformance.rs:740:9:
a reversed edge must not satisfy the requirement

---- pattern::tests::a_fingerprint_distinguishes_relationship_direction stdout ----

thread 'pattern::tests::a_fingerprint_distinguishes_relationship_direction' (1685554) panicked at crates/casm-core/src/pattern.rs:1103:9:
assertion `left != right` failed
  left: Fingerprint(921b3ae1f177…)
 right: Fingerprint(921b3ae1f177…)

failures:
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::relationship_direction_matters
    pattern::tests::a_fingerprint_distinguishes_relationship_direction

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
