*** crates/casm-core/src/pattern.rs:489:9: replace Pattern::satisfies -> &[String] with Vec::leak(vec![String::new()])

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::satisfies -> &[String] with Vec::leak(vec![String::new()])
@@ -481,17 +481,17 @@
     pub fn relationships(&self) -> &[RequiredRelationship] {
         &self.relationships
     }
 
     /// The standards this pattern helps satisfy.
     #[inline]
     #[must_use]
     pub fn satisfies(&self) -> &[String] {
-        &self.satisfies
+        Vec::leak(vec![String::new()]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The pattern's annotations.
     #[inline]
     #[must_use]
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }

---- pattern::tests::a_fingerprint_distinguishes_the_compliance_claim stdout ----

thread 'pattern::tests::a_fingerprint_distinguishes_the_compliance_claim' (502948) panicked at crates/casm-core/src/pattern.rs:1009:9:
assertion `left != right` failed
  left: Fingerprint(fdbf9246af44…)
 right: Fingerprint(fdbf9246af44…)

---- pattern::tests::satisfied_standards_are_deduplicated stdout ----

thread 'pattern::tests::satisfied_standards_are_deduplicated' (502968) panicked at crates/casm-core/src/pattern.rs:950:9:
assertion `left == right` failed
  left: [""]
 right: ["SOC2", "ISO27001"]

failures:
    pattern::tests::a_fingerprint_distinguishes_the_compliance_claim
    pattern::tests::satisfied_standards_are_deduplicated

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
