*** crates/casm-core/src/pattern.rs:502:61: replace == with != in Pattern::requirement

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace == with != in Pattern::requirement
@@ -494,17 +494,17 @@
     #[must_use]
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }
 
     /// Looks up a requirement by role name.
     #[must_use]
     pub fn requirement(&self, role: &str) -> Option<&Requirement> {
-        self.requirements.iter().find(|r| r.role().as_str() == role)
+        self.requirements.iter().find(|r| r.role().as_str() != /* ~ changed by cargo-mutants ~ */ role)
     }
 
     /// The `name@version` reference that identifies this pattern.
     #[must_use]
     pub fn reference(&self) -> String {
         format!("{}@{}", self.name, self.version)
     }

---- conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported stdout ----

thread 'conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported' (1689009) panicked at crates/casm-core/src/conformance.rs:627:9:
assertion failed: report.unmet().iter().any(|unmet|
        matches!(unmet, Unmet::UnknownRole { role } if role == "nonexistent"))

---- pattern::tests::a_pattern_exposes_its_requirements_by_role stdout ----

thread 'pattern::tests::a_pattern_exposes_its_requirements_by_role' (1689136) panicked at crates/casm-core/src/pattern.rs:724:9:
assertion `left == right` failed
  left: Some(Service)
 right: Some(Gateway)

failures:
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    pattern::tests::a_pattern_exposes_its_requirements_by_role

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
