*** crates/casm-core/src/pattern.rs:502:9: replace Pattern::requirement -> Option<&Requirement> with None

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::requirement -> Option<&Requirement> with None
@@ -494,17 +494,17 @@
     #[must_use]
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }
 
     /// Looks up a requirement by role name.
     #[must_use]
     pub fn requirement(&self, role: &str) -> Option<&Requirement> {
-        self.requirements.iter().find(|r| r.role().as_str() == role)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The `name@version` reference that identifies this pattern.
     #[must_use]
     pub fn reference(&self) -> String {
         format!("{}@{}", self.name, self.version)
     }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1688602) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1688610) panicked at crates/casm-core/src/conformance.rs:583:9:
[UnknownRole { role: "application" }]

---- pattern::tests::a_pattern_exposes_its_requirements_by_role stdout ----

thread 'pattern::tests::a_pattern_exposes_its_requirements_by_role' (1688879) panicked at crates/casm-core/src/pattern.rs:724:9:
assertion `left == right` failed
  left: None
 right: Some(Gateway)

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    pattern::tests::a_pattern_exposes_its_requirements_by_role

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
