*** crates/casm-core/src/pattern.rs:531:9: replace Pattern::verify_invariants -> Result<(), PatternError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::verify_invariants -> Result<(), PatternError> with Ok(())
@@ -523,18 +523,17 @@
     /// The constructors already guarantee these, so this is a defence-in-depth check for
     /// patterns that arrived through `serde`, which populates fields directly. The same
     /// reasoning as [`crate::Architecture::verify_invariants`].
     ///
     /// # Errors
     ///
     /// Returns the first violated invariant.
     pub fn verify_invariants(&self) -> Result<(), PatternError> {
-        PatternConfig::reject_duplicate_roles(&self.requirements)?;
-        PatternConfig::reject_unknown_roles(&self.requirements, &self.relationships)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Pattern {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.reference())
     }
 }

---- pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde stdout ----

thread 'pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde' (507881) panicked at crates/casm-core/src/pattern.rs:907:9:
assertion failed: matches!(smuggled.verify_invariants(), Err(PatternError::UnknownRole { .. }))

failures:
    pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
