*** crates/casm-core/src/pattern.rs:538:9: replace <impl fmt::Display for Pattern>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace <impl fmt::Display for Pattern>::fmt -> fmt::Result with Ok(Default::default())
@@ -530,17 +530,17 @@
     pub fn verify_invariants(&self) -> Result<(), PatternError> {
         PatternConfig::reject_duplicate_roles(&self.requirements)?;
         PatternConfig::reject_unknown_roles(&self.requirements, &self.relationships)
     }
 }
 
 impl fmt::Display for Pattern {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(&self.reference())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A reference to a pattern by name and exact version, as written in an architecture.
 ///
 /// Exact rather than a range: a pattern is a compliance claim, and "this architecture
 /// satisfies some version of the secure web tier" is not a claim anybody can audit.
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]

---- pattern::tests::a_reference_is_name_at_version stdout ----

thread 'pattern::tests::a_reference_is_name_at_version' (1691233) panicked at crates/casm-core/src/pattern.rs:850:9:
assertion `left == right` failed
  left: ""
 right: "secure-web-tier@1.0.0"

failures:
    pattern::tests::a_reference_is_name_at_version

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
