*** crates/casm-core/src/pattern.rs:600:9: replace PatternRef::matches -> bool with true

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternRef::matches -> bool with true
@@ -592,17 +592,17 @@
     #[must_use]
     pub const fn version(&self) -> &Version {
         &self.version
     }
 
     /// Returns `true` if `pattern` is the one referenced.
     #[must_use]
     pub fn matches(&self, pattern: &Pattern) -> bool {
-        pattern.name().as_str() == self.name && pattern.version() == &self.version
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for PatternRef {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}@{}", self.name, self.version)
     }
 }

---- pattern::tests::a_reference_requires_an_exact_version stdout ----

thread 'pattern::tests::a_reference_requires_an_exact_version' (1693358) panicked at crates/casm-core/src/pattern.rs:864:9:
1.1.0 must not match 1.0.0

failures:
    pattern::tests::a_reference_requires_an_exact_version

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
