*** crates/casm-core/src/pattern.rs:685:9: replace <impl fmt::Display for Conformance>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace <impl fmt::Display for Conformance>::fmt -> fmt::Result with Ok(Default::default())
@@ -677,17 +677,17 @@
     #[must_use]
     pub fn bound(&self, role: &Name) -> Option<NodeId> {
         self.bindings.get(role).copied()
     }
 }
 
 impl fmt::Display for Conformance {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        fmt::Display::fmt(&self.pattern, f)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- pattern::tests::a_conformance_claim_renders_the_pattern_it_names stdout ----

thread 'pattern::tests::a_conformance_claim_renders_the_pattern_it_names' (1697814) panicked at crates/casm-core/src/pattern.rs:972:9:
assertion `left == right` failed
  left: ""
 right: "secure-web-tier@1.0.0"

failures:
    pattern::tests::a_conformance_claim_renders_the_pattern_it_names

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
