*** crates/casm-core/src/pattern.rs:82:12: replace == with != in is_zero

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace == with != in is_zero
@@ -74,17 +74,17 @@
     /// Protocols the node must expose an interface for.
     #[serde(default, skip_serializing_if = "Vec::is_empty")]
     required_protocols: Vec<Protocol>,
 }
 
 /// `serde` skip helper.
 #[allow(clippy::trivially_copy_pass_by_ref)] // Required by `skip_serializing_if`.
 const fn is_zero(value: &usize) -> bool {
-    *value == 0
+    *value != /* ~ changed by cargo-mutants ~ */ 0
 }
 
 impl Requirement {
     /// Constructs a requirement.
     ///
     /// # Errors
     ///
     /// Returns [`PatternError::Name`] if the role name violates the name alphabet.

---- pattern::tests::a_pattern_round_trips_through_json stdout ----

thread 'pattern::tests::a_pattern_round_trips_through_json' (480734) panicked at crates/casm-core/src/pattern.rs:919:9:
assertion `left == right` failed

failures:
    pattern::tests::a_pattern_round_trips_through_json

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
