*** crates/casm-core/src/pattern.rs:82:5: replace is_zero -> bool with true

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace is_zero -> bool with true
@@ -74,17 +74,17 @@
     /// Protocols the node must expose an interface for.
     #[serde(default, skip_serializing_if = "Vec::is_empty")]
     required_protocols: Vec<Protocol>,
 }
 
 /// `serde` skip helper.
 #[allow(clippy::trivially_copy_pass_by_ref)] // Required by `skip_serializing_if`.
 const fn is_zero(value: &usize) -> bool {
-    *value == 0
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 impl Requirement {
     /// Constructs a requirement.
     ///
     /// # Errors
     ///
     /// Returns [`PatternError::Name`] if the role name violates the name alphabet.

---- pattern::tests::a_pattern_round_trips_through_json stdout ----

thread 'pattern::tests::a_pattern_round_trips_through_json' (1664177) panicked at crates/casm-core/src/pattern.rs:996:9:
assertion `left == right` failed

---- pattern::tests::a_requirement_omits_a_zero_control_minimum_when_serialised stdout ----

thread 'pattern::tests::a_requirement_omits_a_zero_control_minimum_when_serialised' (1664184) panicked at crates/casm-core/src/pattern.rs:988:9:
{"role":"edge","type":"gateway"}

failures:
    pattern::tests::a_pattern_round_trips_through_json
    pattern::tests::a_requirement_omits_a_zero_control_minimum_when_serialised

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
