*** crates/casm-core/src/relationship.rs:145:9: replace RelationshipConfig::protocol -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace RelationshipConfig::protocol -> Self with Default::default()
@@ -137,18 +137,17 @@
     pub const fn relationship_type(mut self, relationship_type: RelationshipType) -> Self {
         self.relationship_type = Some(relationship_type);
         self
     }
 
     /// Sets the wire protocol carrying this relationship.
     #[must_use]
     pub fn protocol(mut self, protocol: Protocol) -> Self {
-        self.protocol = Some(protocol);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets a human-readable description.
     #[must_use]
     pub fn description(mut self, description: impl Into<String>) -> Self {
         self.description = Some(description.into());
         self
     }

---- merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them stdout ----

thread 'merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them' (521520) panicked at crates/casm-core/src/merkle.rs:643:14:
valid: MissingField { field: "source" }

---- merkle::tests::a_renamed_node_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_renamed_node_changes_the_fingerprint' (521522) panicked at crates/casm-core/src/merkle.rs:643:14:
valid: MissingField { field: "source" }

---- merkle::tests::abbreviation_does_not_panic_on_an_over_long_width stdout ----

thread 'merkle::tests::abbreviation_does_not_panic_on_an_over_long_width' (521524) panicked at crates/casm-core/src/merkle.rs:643:14:
valid: MissingField { field: "source" }

failures:
    merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them
    merkle::tests::a_renamed_node_changes_the_fingerprint
    merkle::tests::abbreviation_does_not_panic_on_an_over_long_width
    merkle::tests::changed_nodes_includes_additions_and_removals
    merkle::tests::changed_nodes_is_empty_for_identical_trees
    merkle::tests::changed_nodes_reports_only_what_actually_differs
    merkle::tests::debug_output_stays_short_enough_for_a_log_line
    merkle::tests::declaration_order_does_not_affect_the_fingerprint
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::fingerprinting_is_stable_across_repeated_calls
    merkle::tests::fingerprints_render_and_parse_as_hex
    merkle::tests::fingerprints_round_trip_through_json

test result: FAILED. 170 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
