*** crates/casm-core/src/relationship.rs:191:19: replace == with != in RelationshipConfig::build

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace == with != in RelationshipConfig::build
@@ -183,17 +183,17 @@
             .target
             .ok_or(RelationshipError::MissingField { field: "target" })?;
         let relationship_type = self
             .relationship_type
             .ok_or(RelationshipError::MissingField {
                 field: "relationship_type",
             })?;
 
-        if source == target {
+        if source != /* ~ changed by cargo-mutants ~ */ target {
             return Err(RelationshipError::SelfEdge {
                 node: source.to_string(),
             });
         }
 
         if let Some(budget) = self.latency_budget_ms
             && (budget == 0 || budget > MAX_LATENCY_BUDGET_MS)
         {

---- architecture::tests::a_binding_to_an_absent_node_is_rejected stdout ----

thread 'architecture::tests::a_binding_to_an_absent_node_is_rejected' (523145) panicked at crates/casm-core/src/architecture.rs:607:14:
valid edge: SelfEdge { node: "019fd1d1-8c1e-77f2-8f3a-a824b984386d" }

---- architecture::tests::a_dangling_source_is_rejected_and_named_as_such stdout ----

thread 'architecture::tests::a_dangling_source_is_rejected_and_named_as_such' (523148) panicked at crates/casm-core/src/architecture.rs:607:14:
valid edge: SelfEdge { node: "019fd1d1-8c1f-7c51-b9e1-7058abef828d" }

---- architecture::tests::build_resolves_edges_declared_before_their_nodes stdout ----

thread 'architecture::tests::build_resolves_edges_declared_before_their_nodes' (523154) panicked at crates/casm-core/src/architecture.rs:607:14:
valid edge: SelfEdge { node: "019fd1d1-8c1f-7c51-b9e1-706a03c55d48" }

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::a_dangling_source_is_rejected_and_named_as_such
    architecture::tests::a_dangling_target_is_rejected_and_named_as_such
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::build_resolves_edges_declared_before_their_nodes
    architecture::tests::consuming_builders_compose
    architecture::tests::degree_counts_both_directions
    architecture::tests::incoming_and_outgoing_partition_the_edges
    architecture::tests::isolated_nodes_are_identified
    architecture::tests::lookup_works_by_id_and_by_name

test result: FAILED. 123 passed; 65 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
