*** crates/casm-core/src/relationship.rs:198:29: replace || with && in RelationshipConfig::build

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace || with && in RelationshipConfig::build
@@ -190,17 +190,17 @@
 
         if source == target {
             return Err(RelationshipError::SelfEdge {
                 node: source.to_string(),
             });
         }
 
         if let Some(budget) = self.latency_budget_ms
-            && (budget == 0 || budget > MAX_LATENCY_BUDGET_MS)
+            && (budget == 0 && /* ~ changed by cargo-mutants ~ */ budget > MAX_LATENCY_BUDGET_MS)
         {
             return Err(RelationshipError::LatencyOutOfRange {
                 value: budget,
                 max: MAX_LATENCY_BUDGET_MS,
                 source_id: source.to_string(),
                 target_id: target.to_string(),
             });
         }

---- relationship::tests::build_rejects_a_budget_above_the_ceiling stdout ----

thread 'relationship::tests::build_rejects_a_budget_above_the_ceiling' (523517) panicked at crates/casm-core/src/relationship.rs:422:14:
called `Result::unwrap_err()` on an `Ok` value: Relationship { source: NodeId(019fd1d1-8d0f-76b1-98b6-a96898a327ee), target: NodeId(019fd1d1-8d0f-76b1-98b6-a9843c97ce60), relationship_type: Sync, protocol: None, description: None, controls: [], latency_budget_ms: Some(86400001) }

---- relationship::tests::build_rejects_a_zero_latency_budget stdout ----

thread 'relationship::tests::build_rejects_a_zero_latency_budget' (523519) panicked at crates/casm-core/src/relationship.rs:407:14:
called `Result::unwrap_err()` on an `Ok` value: Relationship { source: NodeId(019fd1d1-8d0f-76b1-98b6-acb01a1c1434), target: NodeId(019fd1d1-8d0f-76b1-98b6-accc0e05c016), relationship_type: Sync, protocol: None, description: None, controls: [], latency_budget_ms: Some(0) }

failures:
    relationship::tests::build_rejects_a_budget_above_the_ceiling
    relationship::tests::build_rejects_a_zero_latency_budget

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
