*** crates/casm-core/src/relationship.rs:198:39: replace > with == in RelationshipConfig::build

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace > with == in RelationshipConfig::build
@@ -190,17 +190,17 @@
 
         if source == target {
             return Err(RelationshipError::SelfEdge {
                 node: source.to_string(),
             });
         }
 
         if let Some(budget) = self.latency_budget_ms
-            && (budget == 0 || budget > MAX_LATENCY_BUDGET_MS)
+            && (budget == 0 || budget == /* ~ changed by cargo-mutants ~ */ MAX_LATENCY_BUDGET_MS)
         {
             return Err(RelationshipError::LatencyOutOfRange {
                 value: budget,
                 max: MAX_LATENCY_BUDGET_MS,
                 source_id: source.to_string(),
                 target_id: target.to_string(),
             });
         }

---- relationship::tests::build_accepts_the_ceiling_itself stdout ----

thread 'relationship::tests::build_accepts_the_ceiling_itself' (525455) panicked at crates/casm-core/src/relationship.rs:434:9:
the ceiling must be inclusive

---- relationship::tests::build_rejects_a_budget_above_the_ceiling stdout ----

thread 'relationship::tests::build_rejects_a_budget_above_the_ceiling' (525459) panicked at crates/casm-core/src/relationship.rs:422:14:
called `Result::unwrap_err()` on an `Ok` value: Relationship { source: NodeId(019fd1d1-93fd-7a83-8896-6ff0fdb2990d), target: NodeId(019fd1d1-93fd-7a83-8896-700b75beaae6), relationship_type: Sync, protocol: None, description: None, controls: [], latency_budget_ms: Some(86400001) }

failures:
    relationship::tests::build_accepts_the_ceiling_itself
    relationship::tests::build_rejects_a_budget_above_the_ceiling

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
