*** crates/casm-core/src/relationship.rs:198:39: replace > with < in RelationshipConfig::build

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace > with < in RelationshipConfig::build
@@ -190,17 +190,17 @@
 
         if source == target {
             return Err(RelationshipError::SelfEdge {
                 node: source.to_string(),
             });
         }
 
         if let Some(budget) = self.latency_budget_ms
-            && (budget == 0 || budget > MAX_LATENCY_BUDGET_MS)
+            && (budget == 0 || budget < /* ~ changed by cargo-mutants ~ */ MAX_LATENCY_BUDGET_MS)
         {
             return Err(RelationshipError::LatencyOutOfRange {
                 value: budget,
                 max: MAX_LATENCY_BUDGET_MS,
                 source_id: source.to_string(),
                 target_id: target.to_string(),
             });
         }

---- merkle::tests::a_renamed_node_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_renamed_node_changes_the_fingerprint' (1709516) panicked at crates/casm-core/src/merkle.rs:643:14:
valid: LatencyOutOfRange { value: 50, max: 86400000, source_id: "019fd218-9854-77a2-ab1d-0c9a4ff1a01d", target_id: "019fd218-9854-77a2-ab1d-0ca3117bf356" }

---- merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them stdout ----

thread 'merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them' (1709513) panicked at crates/casm-core/src/merkle.rs:643:14:
valid: LatencyOutOfRange { value: 50, max: 86400000, source_id: "019fd218-9855-7a01-b494-95de2cee3cf0", target_id: "019fd218-9855-7a01-b494-95ead19aa48c" }

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (1709512) panicked at crates/casm-core/src/merkle.rs:866:26:
called `Result::unwrap()` on an `Err` value: LatencyOutOfRange { value: 50, max: 86400000, source_id: "019fd218-9856-7e42-9359-0b3999c434e6", target_id: "019fd218-9856-7e42-9359-0b4ab79aeb20" }

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them
    merkle::tests::a_renamed_node_changes_the_fingerprint
    merkle::tests::abbreviation_does_not_panic_on_an_over_long_width
    merkle::tests::changed_nodes_includes_additions_and_removals
    merkle::tests::changed_nodes_is_empty_for_identical_trees
    merkle::tests::changed_nodes_reports_only_what_actually_differs
    merkle::tests::debug_output_stays_short_enough_for_a_log_line
    merkle::tests::declaration_order_does_not_affect_the_fingerprint
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::fingerprinting_is_stable_across_repeated_calls
    merkle::tests::fingerprints_render_and_parse_as_hex

test result: FAILED. 185 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
