*** crates/casm-core/src/relationship.rs:265:9: replace Relationship::builder -> RelationshipConfig with Default::default()

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace Relationship::builder -> RelationshipConfig with Default::default()
@@ -257,17 +257,17 @@
     #[serde(default, skip_serializing_if = "Option::is_none")]
     latency_budget_ms: Option<u64>,
 }
 
 impl Relationship {
     /// Begins two-phase construction. Equivalent to [`RelationshipConfig::new`].
     #[must_use]
     pub fn builder() -> RelationshipConfig {
-        RelationshipConfig::new()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The originating node.
     #[inline]
     #[must_use]
     pub const fn source(&self) -> NodeId {
         self.source
     }

*** result: Success
