*** crates/casm-core/src/relationship.rs:320:9: replace Relationship::connects -> bool with true

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace Relationship::connects -> bool with true
@@ -312,17 +312,17 @@
     #[must_use]
     pub const fn latency_budget_ms(&self) -> Option<u64> {
         self.latency_budget_ms
     }
 
     /// Returns `true` if this edge connects `a` and `b` in either direction.
     #[must_use]
     pub fn connects(&self, a: NodeId, b: NodeId) -> bool {
-        (self.source == a && self.target == b) || (self.source == b && self.target == a)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The identity used for duplicate detection: source, target, and type.
     ///
     /// Two edges may legitimately connect the same pair of nodes with *different*
     /// semantics (a sync call and an async event), so type is part of the key.
     #[must_use]
     pub fn identity(&self) -> (NodeId, NodeId, RelationshipType) {

---- relationship::tests::connects_is_direction_agnostic stdout ----

thread 'relationship::tests::connects_is_direction_agnostic' (1716742) panicked at crates/casm-core/src/relationship.rs:478:9:
assertion failed: !relationship.connects(a, c)

failures:
    relationship::tests::connects_is_direction_agnostic

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
