*** crates/casm-core/src/relationship.rs:57:9: replace RelationshipType::label -> &'static str with ""

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace RelationshipType::label -> &'static str with ""
@@ -49,25 +49,17 @@
     /// the validator treats a contract change at either end as breaking both.
     QuantumEntangled,
 }
 
 impl RelationshipType {
     /// Returns the canonical lowercase label.
     #[must_use]
     pub const fn label(self) -> &'static str {
-        match self {
-            Self::Sync => "sync",
-            Self::Async => "async",
-            Self::EventDriven => "event-driven",
-            Self::DependsOn => "depends-on",
-            Self::Composed => "composed",
-            Self::DeployedOn => "deployed-on",
-            Self::QuantumEntangled => "quantum-entangled",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the source blocks on the target.
     ///
     /// Blocking edges are the ones that propagate failure and accumulate latency, so
     /// this predicate drives both cascade analysis and budget summation.
     #[must_use]
     pub const fn is_blocking(self) -> bool {

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1698774) panicked at crates/casm-core/src/conformance.rs:721:17:
assertion `left == right` failed
  left: ""
 right: "async"

---- merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint stdout ----

thread 'merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint' (1698846) panicked at crates/casm-core/src/merkle.rs:830:9:
assertion `left != right` failed: the type is part of a relationship's identity
  left: Fingerprint(35f558fdfdd4…)
 right: Fingerprint(35f558fdfdd4…)

failures:
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
