*** crates/casm-core/src/relationship.rs:83:9: replace RelationshipType::is_entangled -> bool with true

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace RelationshipType::is_entangled -> bool with true
@@ -75,17 +75,17 @@
             Self::Sync | Self::DependsOn | Self::Composed | Self::QuantumEntangled => true,
             Self::Async | Self::EventDriven | Self::DeployedOn => false,
         }
     }
 
     /// Returns `true` if a change at either endpoint invalidates the other.
     #[must_use]
     pub const fn is_entangled(self) -> bool {
-        matches!(self, Self::QuantumEntangled)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this edge should participate in dependency-cycle detection.
     ///
     /// Asynchronous and event-driven edges are deliberately excluded: a publish/subscribe
     /// loop is a legitimate topology, not a deadlock.
     #[must_use]
     pub const fn forms_dependency_cycle(self) -> bool {

---- relationship::tests::only_quantum_entangled_edges_are_entangled stdout ----

thread 'relationship::tests::only_quantum_entangled_edges_are_entangled' (1701427) panicked at crates/casm-core/src/relationship.rs:455:9:
assertion failed: !RelationshipType::Sync.is_entangled()

failures:
    relationship::tests::only_quantum_entangled_edges_are_entangled

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
