*** crates/casm-diff/src/drift.rs:118:9: replace Inventory::bound_to -> Option<&Resource> with None

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace Inventory::bound_to -> Option<&Resource> with None
@@ -110,25 +110,17 @@
         })
     }
 
     /// Finds the resource bound to `node`, if any.
     ///
     /// Prefers an explicit `infrastructure-id`; falls back to name equality.
     #[must_use]
     pub fn bound_to(&self, node: &Node) -> Option<&Resource> {
-        if let Some(declared) = node.metadata().get(BINDING_KEY) {
-            return self
-                .resources
-                .iter()
-                .find(|resource| &resource.id == declared);
-        }
-        self.resources
-            .iter()
-            .find(|resource| resource.name == node.name().as_str())
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Converts one Terraform state resource entry.
 fn terraform_resource(entry: &serde_json::Value) -> Option<Resource> {
     if entry.get("mode").and_then(serde_json::Value::as_str) != Some("managed") {
         return None;
     }

---- drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch stdout ----

thread 'drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch' (540677) panicked at crates/casm-diff/src/drift.rs:466:9:
assertion `left == right` failed: ~ node 'api' (service) is declared but was not found in the inventory
~ node 'orders-db' (database) is declared but was not found in the inventory
~ resource 'api' (service) exists but is not declared
~ resource 'orders-db' (storage) exists but is not declared

  left: 4
 right: 1

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (540678) panicked at crates/casm-diff/src/drift.rs:427:9:
assertion `left == right` failed
  left: 3
 right: 1

---- drift::tests::a_matching_inventory_reports_no_drift stdout ----

thread 'drift::tests::a_matching_inventory_reports_no_drift' (540680) panicked at crates/casm-diff/src/drift.rs:416:9:
~ node 'api' (service) is declared but was not found in the inventory
~ node 'orders-db' (database) is declared but was not found in the inventory
~ resource 'api' (service) exists but is not declared
~ resource 'orders-db' (database) exists but is not declared

failures:
    drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::a_matching_inventory_reports_no_drift
    drift::tests::a_report_summarises_itself_in_both_states
    drift::tests::an_explicit_binding_overrides_name_matching
    drift::tests::an_undeclared_resource_is_unexpected
    drift::tests::an_unrecognised_resource_type_asserts_nothing_about_the_node
    drift::tests::external_nodes_are_exempt

test result: FAILED. 33 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
