*** crates/casm-diff/src/drift.rs:122:47: replace == with != in Inventory::bound_to

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace == with != in Inventory::bound_to
@@ -114,17 +114,17 @@
     ///
     /// Prefers an explicit `infrastructure-id`; falls back to name equality.
     #[must_use]
     pub fn bound_to(&self, node: &Node) -> Option<&Resource> {
         if let Some(declared) = node.metadata().get(BINDING_KEY) {
             return self
                 .resources
                 .iter()
-                .find(|resource| &resource.id == declared);
+                .find(|resource| &resource.id != /* ~ changed by cargo-mutants ~ */ declared);
         }
         self.resources
             .iter()
             .find(|resource| resource.name == node.name().as_str())
     }
 }
 
 /// Converts one Terraform state resource entry.

---- drift::tests::an_explicit_binding_overrides_name_matching stdout ----

thread 'drift::tests::an_explicit_binding_overrides_name_matching' (540593) panicked at crates/casm-diff/src/drift.rs:515:9:
~ node 'orders-db' (database) is declared but was not found in the inventory
~ resource 'aws_db_instance.primary' (database) exists but is not declared

---- drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision stdout ----

thread 'drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision' (540594) panicked at crates/casm-diff/src/drift.rs:542:9:

failures:
    drift::tests::an_explicit_binding_overrides_name_matching
    drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
