*** crates/casm-diff/src/drift.rs:126:44: replace == with != in Inventory::bound_to

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace == with != in Inventory::bound_to
@@ -118,17 +118,17 @@
         if let Some(declared) = node.metadata().get(BINDING_KEY) {
             return self
                 .resources
                 .iter()
                 .find(|resource| &resource.id == declared);
         }
         self.resources
             .iter()
-            .find(|resource| resource.name == node.name().as_str())
+            .find(|resource| resource.name != /* ~ changed by cargo-mutants ~ */ node.name().as_str())
     }
 }
 
 /// Converts one Terraform state resource entry.
 fn terraform_resource(entry: &serde_json::Value) -> Option<Resource> {
     if entry.get("mode").and_then(serde_json::Value::as_str) != Some("managed") {
         return None;
     }

---- drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch stdout ----

thread 'drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch' (540931) panicked at crates/casm-diff/src/drift.rs:474:9:
assertion `left == right` failed: ~ node 'api' is declared as service but the infrastructure says storage
~ node 'orders-db' is declared as database but the infrastructure says service

  left: 2
 right: 1

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (540932) panicked at crates/casm-diff/src/drift.rs:435:9:
assertion `left == right` failed
  left: 2
 right: 1

---- drift::tests::a_matching_inventory_reports_no_drift stdout ----

thread 'drift::tests::a_matching_inventory_reports_no_drift' (540934) panicked at crates/casm-diff/src/drift.rs:424:9:
~ node 'api' is declared as service but the infrastructure says database
~ node 'orders-db' is declared as database but the infrastructure says service

failures:
    drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::a_matching_inventory_reports_no_drift
    drift::tests::an_undeclared_resource_is_unexpected
    drift::tests::external_nodes_are_exempt

test result: FAILED. 36 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
