*** crates/casm-diff/src/drift.rs:132:5: replace terraform_resource -> Option<Resource> with None

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace terraform_resource -> Option<Resource> with None
@@ -124,29 +124,17 @@
         self.resources
             .iter()
             .find(|resource| resource.name == node.name().as_str())
     }
 }
 
 /// Converts one Terraform state resource entry.
 fn terraform_resource(entry: &serde_json::Value) -> Option<Resource> {
-    if entry.get("mode").and_then(serde_json::Value::as_str) != Some("managed") {
-        return None;
-    }
-
-    let provider_type = entry.get("type").and_then(serde_json::Value::as_str)?;
-    let name = entry.get("name").and_then(serde_json::Value::as_str)?;
-
-    Some(Resource {
-        id: format!("{provider_type}.{name}"),
-        name: name.to_owned(),
-        node_type: terraform_type(provider_type),
-        provider_type: Some(provider_type.to_owned()),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps a Terraform resource type onto a CASIMIR node type.
 ///
 /// Deliberately incomplete. An unmapped type yields `None`, which suppresses type-mismatch
 /// reporting for that resource — CASIMIR would rather say nothing than invent a
 /// disagreement from a type it does not understand.
 #[must_use]

---- drift::tests::terraform_state_projects_into_an_inventory stdout ----

thread 'drift::tests::terraform_state_projects_into_an_inventory' (541167) panicked at crates/casm-diff/src/drift.rs:614:9:
assertion `left == right` failed: the data source is not owned infrastructure
  left: 0
 right: 2

failures:
    drift::tests::terraform_state_projects_into_an_inventory

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
