*** crates/casm-diff/src/drift.rs:132:62: replace != with == in terraform_resource

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace != with == in terraform_resource
@@ -124,17 +124,17 @@
         self.resources
             .iter()
             .find(|resource| resource.name == node.name().as_str())
     }
 }
 
 /// Converts one Terraform state resource entry.
 fn terraform_resource(entry: &serde_json::Value) -> Option<Resource> {
-    if entry.get("mode").and_then(serde_json::Value::as_str) != Some("managed") {
+    if entry.get("mode").and_then(serde_json::Value::as_str) == /* ~ changed by cargo-mutants ~ */ Some("managed") {
         return None;
     }
 
     let provider_type = entry.get("type").and_then(serde_json::Value::as_str)?;
     let name = entry.get("name").and_then(serde_json::Value::as_str)?;
 
     Some(Resource {
         id: format!("{provider_type}.{name}"),

---- drift::tests::terraform_state_projects_into_an_inventory stdout ----

thread 'drift::tests::terraform_state_projects_into_an_inventory' (541403) panicked at crates/casm-diff/src/drift.rs:626:9:
assertion `left == right` failed: the data source is not owned infrastructure
  left: 1
 right: 2

failures:
    drift::tests::terraform_state_projects_into_an_inventory

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
