*** crates/casm-diff/src/drift.rs:155:9: delete match arm "aws_db_instance" | "aws_rds_cluster" | "aws_dynamodb_table" | "google_sql_database_instance" | "google_spanner_database" | "azurerm_postgresql_server" | "azurerm_cosmosdb_account" in terraform_type

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ delete match arm "aws_db_instance" | "aws_rds_cluster" | "aws_dynamodb_table" | "google_sql_database_instance" | "google_spanner_database" | "azurerm_postgresql_server" | "azurerm_cosmosdb_account" in terraform_type
@@ -147,23 +147,17 @@
 /// Maps a Terraform resource type onto a CASIMIR node type.
 ///
 /// Deliberately incomplete. An unmapped type yields `None`, which suppresses type-mismatch
 /// reporting for that resource — CASIMIR would rather say nothing than invent a
 /// disagreement from a type it does not understand.
 #[must_use]
 pub fn terraform_type(provider_type: &str) -> Option<NodeType> {
     match provider_type {
-        "aws_db_instance"
-        | "aws_rds_cluster"
-        | "aws_dynamodb_table"
-        | "google_sql_database_instance"
-        | "google_spanner_database"
-        | "azurerm_postgresql_server"
-        | "azurerm_cosmosdb_account" => Some(NodeType::Database),
+         /* ~ changed by cargo-mutants ~ */
 
         "aws_s3_bucket"
         | "aws_efs_file_system"
         | "google_storage_bucket"
         | "azurerm_storage_account" => Some(NodeType::Storage),
 
         "aws_sqs_queue"
         | "aws_sns_topic"

---- drift::tests::terraform_state_projects_into_an_inventory stdout ----

thread 'drift::tests::terraform_state_projects_into_an_inventory' (541929) panicked at crates/casm-diff/src/drift.rs:626:9:
assertion `left == right` failed
  left: None
 right: Some(Database)

---- drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to stdout ----

thread 'drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to' (541932) panicked at crates/casm-diff/src/drift.rs:656:13:
assertion `left == right` failed: aws_db_instance
  left: None
 right: Some(Database)

failures:
    drift::tests::terraform_state_projects_into_an_inventory
    drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
