*** crates/casm-diff/src/drift.rs:163:9: delete match arm "aws_s3_bucket" | "aws_efs_file_system" | "google_storage_bucket" | "azurerm_storage_account" in terraform_type

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ delete match arm "aws_s3_bucket" | "aws_efs_file_system" | "google_storage_bucket" | "azurerm_storage_account" in terraform_type
@@ -155,20 +155,17 @@
         "aws_db_instance"
         | "aws_rds_cluster"
         | "aws_dynamodb_table"
         | "google_sql_database_instance"
         | "google_spanner_database"
         | "azurerm_postgresql_server"
         | "azurerm_cosmosdb_account" => Some(NodeType::Database),
 
-        "aws_s3_bucket"
-        | "aws_efs_file_system"
-        | "google_storage_bucket"
-        | "azurerm_storage_account" => Some(NodeType::Storage),
+         /* ~ changed by cargo-mutants ~ */
 
         "aws_sqs_queue"
         | "aws_sns_topic"
         | "aws_msk_cluster"
         | "google_pubsub_topic"
         | "google_pubsub_subscription"
         | "azurerm_servicebus_queue" => Some(NodeType::Queue),

---- drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to stdout ----

thread 'drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to' (542471) panicked at crates/casm-diff/src/drift.rs:659:13:
assertion `left == right` failed: google_storage_bucket
  left: None
 right: Some(Storage)

---- drift::tests::terraform_state_projects_into_an_inventory stdout ----

thread 'drift::tests::terraform_state_projects_into_an_inventory' (542469) panicked at crates/casm-diff/src/drift.rs:630:9:
assertion `left == right` failed
  left: None
 right: Some(Storage)

failures:
    drift::tests::terraform_state_projects_into_an_inventory
    drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
