*** crates/casm-diff/src/drift.rs:168:9: delete match arm "aws_sqs_queue" | "aws_sns_topic" | "aws_msk_cluster" | "google_pubsub_topic" | "google_pubsub_subscription" | "azurerm_servicebus_queue" in terraform_type

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ delete match arm "aws_sqs_queue" | "aws_sns_topic" | "aws_msk_cluster" | "google_pubsub_topic" | "google_pubsub_subscription" | "azurerm_servicebus_queue" in terraform_type
@@ -160,22 +160,17 @@
         | "azurerm_postgresql_server"
         | "azurerm_cosmosdb_account" => Some(NodeType::Database),
 
         "aws_s3_bucket"
         | "aws_efs_file_system"
         | "google_storage_bucket"
         | "azurerm_storage_account" => Some(NodeType::Storage),
 
-        "aws_sqs_queue"
-        | "aws_sns_topic"
-        | "aws_msk_cluster"
-        | "google_pubsub_topic"
-        | "google_pubsub_subscription"
-        | "azurerm_servicebus_queue" => Some(NodeType::Queue),
+         /* ~ changed by cargo-mutants ~ */
 
         "aws_elasticache_cluster"
         | "aws_elasticache_replication_group"
         | "google_redis_instance"
         | "azurerm_redis_cache" => Some(NodeType::Cache),
 
         "aws_lb"
         | "aws_alb"

---- drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to stdout ----

thread 'drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to' (542425) panicked at crates/casm-diff/src/drift.rs:657:13:
assertion `left == right` failed: aws_sqs_queue
  left: None
 right: Some(Queue)

failures:
    drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
