*** crates/casm-diff/src/drift.rs:175:9: delete match arm "aws_elasticache_cluster" | "aws_elasticache_replication_group" | "google_redis_instance" | "azurerm_redis_cache" in terraform_type

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ delete match arm "aws_elasticache_cluster" | "aws_elasticache_replication_group" | "google_redis_instance" | "azurerm_redis_cache" in terraform_type
@@ -167,20 +167,17 @@
 
         "aws_sqs_queue"
         | "aws_sns_topic"
         | "aws_msk_cluster"
         | "google_pubsub_topic"
         | "google_pubsub_subscription"
         | "azurerm_servicebus_queue" => Some(NodeType::Queue),
 
-        "aws_elasticache_cluster"
-        | "aws_elasticache_replication_group"
-        | "google_redis_instance"
-        | "azurerm_redis_cache" => Some(NodeType::Cache),
+         /* ~ changed by cargo-mutants ~ */
 
         "aws_lb"
         | "aws_alb"
         | "aws_api_gateway_rest_api"
         | "aws_apigatewayv2_api"
         | "aws_cloudfront_distribution"
         | "google_compute_global_forwarding_rule"
         | "azurerm_application_gateway" => Some(NodeType::Gateway),

---- drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to stdout ----

thread 'drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to' (542600) panicked at crates/casm-diff/src/drift.rs:659:13:
assertion `left == right` failed: aws_elasticache_cluster
  left: None
 right: Some(Cache)

failures:
    drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
