*** crates/casm-diff/src/drift.rs:188:9: delete match arm "aws_ecs_service" | "aws_lambda_function" | "aws_instance" | "google_cloud_run_service" | "google_cloudfunctions_function" | "kubernetes_deployment" | "azurerm_linux_web_app" in terraform_type

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ delete match arm "aws_ecs_service" | "aws_lambda_function" | "aws_instance" | "google_cloud_run_service" | "google_cloudfunctions_function" | "kubernetes_deployment" | "azurerm_linux_web_app" in terraform_type
@@ -180,23 +180,17 @@
         "aws_lb"
         | "aws_alb"
         | "aws_api_gateway_rest_api"
         | "aws_apigatewayv2_api"
         | "aws_cloudfront_distribution"
         | "google_compute_global_forwarding_rule"
         | "azurerm_application_gateway" => Some(NodeType::Gateway),
 
-        "aws_ecs_service"
-        | "aws_lambda_function"
-        | "aws_instance"
-        | "google_cloud_run_service"
-        | "google_cloudfunctions_function"
-        | "kubernetes_deployment"
-        | "azurerm_linux_web_app" => Some(NodeType::Service),
+         /* ~ changed by cargo-mutants ~ */
 
         _ => None,
     }
 }
 
 /// One way the declared architecture and reality disagree.
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "kebab-case", tag = "drift")]

---- drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to stdout ----

thread 'drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to' (543367) panicked at crates/casm-diff/src/drift.rs:656:13:
assertion `left == right` failed: aws_lambda_function
  left: None
 right: Some(Service)

failures:
    drift::tests::the_terraform_type_map_covers_each_node_type_it_claims_to

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
