*** crates/casm-diff/src/drift.rs:239:9: replace Drift::is_missing -> bool with true

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace Drift::is_missing -> bool with true
@@ -231,17 +231,17 @@
     /// Returns `true` if this finding means the architecture is describing something
     /// that does not exist.
     ///
     /// The dangerous direction: an unexpected resource is usually something nobody
     /// documented, whereas a missing node means a decision was written down and never
     /// built, or was quietly torn down.
     #[must_use]
     pub const fn is_missing(&self) -> bool {
-        matches!(self, Self::Missing { .. })
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl core::fmt::Display for Drift {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
         match self {
             Self::Missing { node, node_type } => write!(
                 f,

---- drift::tests::an_empty_architecture_reports_every_resource_as_unexpected stdout ----

thread 'drift::tests::an_empty_architecture_reports_every_resource_as_unexpected' (543312) panicked at crates/casm-diff/src/drift.rs:587:9:
assertion failed: !report.drifts[0].is_missing()

---- drift::tests::an_undeclared_resource_is_unexpected stdout ----

thread 'drift::tests::an_undeclared_resource_is_unexpected' (543318) panicked at crates/casm-diff/src/drift.rs:456:9:
assertion failed: !report.drifts[0].is_missing()

failures:
    drift::tests::an_empty_architecture_reports_every_resource_as_unexpected
    drift::tests::an_undeclared_resource_is_unexpected

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
