*** crates/casm-diff/src/drift.rs:239:9: replace Drift::is_missing -> bool with false

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace Drift::is_missing -> bool with false
@@ -231,17 +231,17 @@
     /// Returns `true` if this finding means the architecture is describing something
     /// that does not exist.
     ///
     /// The dangerous direction: an unexpected resource is usually something nobody
     /// documented, whereas a missing node means a decision was written down and never
     /// built, or was quietly torn down.
     #[must_use]
     pub const fn is_missing(&self) -> bool {
-        matches!(self, Self::Missing { .. })
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl core::fmt::Display for Drift {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
         match self {
             Self::Missing { node, node_type } => write!(
                 f,

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (543413) panicked at crates/casm-diff/src/drift.rs:436:9:
assertion failed: report.drifts[0].is_missing()

---- drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision stdout ----

thread 'drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision' (543422) panicked at crates/casm-diff/src/drift.rs:542:9:
~ node 'orders-db' (database) is declared but was not found in the inventory
~ resource 'orders-db' (database) exists but is not declared

---- drift::tests::an_empty_inventory_reports_every_node_as_missing stdout ----

thread 'drift::tests::an_empty_inventory_reports_every_node_as_missing' (543420) panicked at crates/casm-diff/src/drift.rs:577:9:
assertion failed: report.drifts.iter().all(Drift::is_missing)

failures:
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::an_empty_inventory_reports_every_node_as_missing
    drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision

test result: FAILED. 38 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
