*** crates/casm-diff/src/drift.rs:245:9: replace <impl core::fmt::Display for Drift>::fmt -> core::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace <impl core::fmt::Display for Drift>::fmt -> core::fmt::Result with Ok(Default::default())
@@ -237,40 +237,17 @@
     #[must_use]
     pub const fn is_missing(&self) -> bool {
         matches!(self, Self::Missing { .. })
     }
 }
 
 impl core::fmt::Display for Drift {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
-        match self {
-            Self::Missing { node, node_type } => write!(
-                f,
-                "node '{node}' ({node_type}) is declared but was not found in the inventory"
-            ),
-            Self::Unexpected {
-                resource,
-                node_type,
-            } => {
-                let described = node_type.as_deref().unwrap_or("unrecognised type");
-                write!(
-                    f,
-                    "resource '{resource}' ({described}) exists but is not declared"
-                )
-            }
-            Self::TypeMismatch {
-                node,
-                declared,
-                observed,
-            } => write!(
-                f,
-                "node '{node}' is declared as {declared} but the infrastructure says {observed}"
-            ),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The result of comparing an architecture against an inventory.
 #[derive(Clone, Debug, Default, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "kebab-case")]
 pub struct DriftReport {
     /// Where the inventory came from.

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (543460) panicked at crates/casm-diff/src/drift.rs:414:9:
~

---- drift::tests::an_undeclared_resource_is_unexpected stdout ----

thread 'drift::tests::an_undeclared_resource_is_unexpected' (543471) panicked at crates/casm-diff/src/drift.rs:434:9:
~

failures:
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::an_undeclared_resource_is_unexpected

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
