*** crates/casm-diff/src/drift.rs:288:9: replace DriftReport::is_clean -> bool with true

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace DriftReport::is_clean -> bool with true
@@ -280,17 +280,17 @@
     /// How many nodes matched a resource cleanly.
     pub matched: usize,
 }
 
 impl DriftReport {
     /// Returns `true` if the architecture and the inventory agree.
     #[must_use]
     pub fn is_clean(&self) -> bool {
-        self.drifts.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// A one-line summary.
     #[must_use]
     pub fn summary(&self) -> String {
         if self.is_clean() {
             return format!(
                 "no drift against {}: {} node(s) matched",

---- drift::tests::a_report_summarises_itself_in_both_states stdout ----

thread 'drift::tests::a_report_summarises_itself_in_both_states' (544170) panicked at crates/casm-diff/src/drift.rs:683:9:
no drift against test: 0 node(s) matched

failures:
    drift::tests::a_report_summarises_itself_in_both_states

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
