*** crates/casm-diff/src/drift.rs:288:9: replace DriftReport::is_clean -> bool with false

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace DriftReport::is_clean -> bool with false
@@ -280,17 +280,17 @@
     /// How many nodes matched a resource cleanly.
     pub matched: usize,
 }
 
 impl DriftReport {
     /// Returns `true` if the architecture and the inventory agree.
     #[must_use]
     pub fn is_clean(&self) -> bool {
-        self.drifts.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// A one-line summary.
     #[must_use]
     pub fn summary(&self) -> String {
         if self.is_clean() {
             return format!(
                 "no drift against {}: {} node(s) matched",

---- drift::tests::a_matching_inventory_reports_no_drift stdout ----

thread 'drift::tests::a_matching_inventory_reports_no_drift' (544249) panicked at crates/casm-diff/src/drift.rs:424:9:

---- drift::tests::a_report_summarises_itself_in_both_states stdout ----

thread 'drift::tests::a_report_summarises_itself_in_both_states' (544252) panicked at crates/casm-diff/src/drift.rs:680:9:
0 drift(s) against test: 2 node(s) matched

---- drift::tests::an_explicit_binding_overrides_name_matching stdout ----

thread 'drift::tests::an_explicit_binding_overrides_name_matching' (544255) panicked at crates/casm-diff/src/drift.rs:515:9:

failures:
    drift::tests::a_matching_inventory_reports_no_drift
    drift::tests::a_report_summarises_itself_in_both_states
    drift::tests::an_explicit_binding_overrides_name_matching
    drift::tests::an_unrecognised_resource_type_asserts_nothing_about_the_node
    drift::tests::external_nodes_are_exempt

test result: FAILED. 36 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
