*** crates/casm-diff/src/drift.rs:294:9: replace DriftReport::summary -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace DriftReport::summary -> String with "xyzzy".into()
@@ -286,28 +286,17 @@
     #[must_use]
     pub fn is_clean(&self) -> bool {
         self.drifts.is_empty()
     }
 
     /// A one-line summary.
     #[must_use]
     pub fn summary(&self) -> String {
-        if self.is_clean() {
-            return format!(
-                "no drift against {}: {} node(s) matched",
-                self.source, self.matched
-            );
-        }
-        format!(
-            "{} drift(s) against {}: {} node(s) matched",
-            self.drifts.len(),
-            self.source,
-            self.matched
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders every finding, one per line.
     #[must_use]
     pub fn render(&self) -> String {
         let mut out = String::new();
         for drift in &self.drifts {
             // Writing to a `String` cannot fail; discarded deliberately, per NASA Rule 3.

---- drift::tests::a_report_summarises_itself_in_both_states stdout ----

thread 'drift::tests::a_report_summarises_itself_in_both_states' (544299) panicked at crates/casm-diff/src/drift.rs:669:9:
xyzzy

failures:
    drift::tests::a_report_summarises_itself_in_both_states

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
