*** crates/casm-diff/src/drift.rs:311:9: replace DriftReport::render -> String with String::new()

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace DriftReport::render -> String with String::new()
@@ -303,22 +303,17 @@
             self.source,
             self.matched
         )
     }
 
     /// Renders every finding, one per line.
     #[must_use]
     pub fn render(&self) -> String {
-        let mut out = String::new();
-        for drift in &self.drifts {
-            // Writing to a `String` cannot fail; discarded deliberately, per NASA Rule 3.
-            let _ = writeln!(out, "~ {drift}");
-        }
-        out
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Compares a declared architecture against an observed inventory.
 ///
 /// External nodes and humans are exempt: `partner-bank` and `customer` are outside the
 /// control boundary by definition, so expecting them in your own Terraform state would
 /// report drift on every run.

*** result: Success
