*** crates/casm-diff/src/drift.rs:327:5: replace detect -> DriftReport with Default::default()

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace detect -> DriftReport with Default::default()
@@ -319,61 +319,17 @@
 
 /// Compares a declared architecture against an observed inventory.
 ///
 /// External nodes and humans are exempt: `partner-bank` and `customer` are outside the
 /// control boundary by definition, so expecting them in your own Terraform state would
 /// report drift on every run.
 #[must_use]
 pub fn detect(architecture: &Architecture, inventory: &Inventory) -> DriftReport {
-    let mut drifts = Vec::new();
-    let mut matched = 0_usize;
-    let mut bound_ids: Vec<&str> = Vec::new();
-
-    for node in architecture.nodes() {
-        if node.node_type().is_external() || node.node_type() == NodeType::Boundary {
-            continue;
-        }
-
-        let Some(resource) = inventory.bound_to(node) else {
-            drifts.push(Drift::Missing {
-                node: node.name().as_str().to_owned(),
-                node_type: node.node_type().to_string(),
-            });
-            continue;
-        };
-
-        bound_ids.push(&resource.id);
-        matched = matched.saturating_add(1);
-
-        if let Some(observed) = resource.node_type
-            && observed != node.node_type()
-        {
-            drifts.push(Drift::TypeMismatch {
-                node: node.name().as_str().to_owned(),
-                declared: node.node_type().to_string(),
-                observed: observed.to_string(),
-            });
-        }
-    }
-
-    for resource in &inventory.resources {
-        if !bound_ids.contains(&resource.id.as_str()) {
-            drifts.push(Drift::Unexpected {
-                resource: resource.id.clone(),
-                node_type: resource.node_type.map(|kind| kind.to_string()),
-            });
-        }
-    }
-
-    DriftReport {
-        source: inventory.source.clone(),
-        drifts,
-        matched,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (545222) panicked at crates/casm-diff/src/drift.rs:391:9:
assertion `left == right` failed
  left: 0
 right: 1

---- drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch stdout ----

thread 'drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch' (545221) panicked at crates/casm-diff/src/drift.rs:430:9:
assertion `left == right` failed: 
  left: 0
 right: 1

---- drift::tests::a_matching_inventory_reports_no_drift stdout ----

thread 'drift::tests::a_matching_inventory_reports_no_drift' (545224) panicked at crates/casm-diff/src/drift.rs:381:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::a_matching_inventory_reports_no_drift
    drift::tests::a_report_summarises_itself_in_both_states
    drift::tests::an_empty_architecture_reports_every_resource_as_unexpected
    drift::tests::an_empty_inventory_reports_every_node_as_missing
    drift::tests::an_explicit_binding_overrides_name_matching
    drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision
    drift::tests::an_undeclared_resource_is_unexpected
    drift::tests::external_nodes_are_exempt

test result: FAILED. 31 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
