*** crates/casm-diff/src/drift.rs:332:43: replace || with && in detect

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace || with && in detect
@@ -324,17 +324,17 @@
 /// report drift on every run.
 #[must_use]
 pub fn detect(architecture: &Architecture, inventory: &Inventory) -> DriftReport {
     let mut drifts = Vec::new();
     let mut matched = 0_usize;
     let mut bound_ids: Vec<&str> = Vec::new();
 
     for node in architecture.nodes() {
-        if node.node_type().is_external() || node.node_type() == NodeType::Boundary {
+        if node.node_type().is_external() && /* ~ changed by cargo-mutants ~ */ node.node_type() == NodeType::Boundary {
             continue;
         }
 
         let Some(resource) = inventory.bound_to(node) else {
             drifts.push(Drift::Missing {
                 node: node.name().as_str().to_owned(),
                 node_type: node.node_type().to_string(),
             });

---- drift::tests::external_nodes_are_exempt stdout ----

thread 'drift::tests::external_nodes_are_exempt' (545189) panicked at crates/casm-diff/src/drift.rs:569:9:
~ node 'partner-bank' (external-system) is declared but was not found in the inventory
~ node 'customer' (human) is declared but was not found in the inventory

failures:
    drift::tests::external_nodes_are_exempt

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
