*** crates/casm-diff/src/drift.rs:332:63: replace == with != in detect

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace == with != in detect
@@ -324,17 +324,17 @@
 /// report drift on every run.
 #[must_use]
 pub fn detect(architecture: &Architecture, inventory: &Inventory) -> DriftReport {
     let mut drifts = Vec::new();
     let mut matched = 0_usize;
     let mut bound_ids: Vec<&str> = Vec::new();
 
     for node in architecture.nodes() {
-        if node.node_type().is_external() || node.node_type() == NodeType::Boundary {
+        if node.node_type().is_external() || node.node_type() != /* ~ changed by cargo-mutants ~ */ NodeType::Boundary {
             continue;
         }
 
         let Some(resource) = inventory.bound_to(node) else {
             drifts.push(Drift::Missing {
                 node: node.name().as_str().to_owned(),
                 node_type: node.node_type().to_string(),
             });

---- drift::tests::a_matching_inventory_reports_no_drift stdout ----

thread 'drift::tests::a_matching_inventory_reports_no_drift' (545709) panicked at crates/casm-diff/src/drift.rs:424:9:
~ resource 'api' (service) exists but is not declared
~ resource 'orders-db' (database) exists but is not declared

---- drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch stdout ----

thread 'drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch' (545706) panicked at crates/casm-diff/src/drift.rs:474:9:
assertion `left == right` failed: ~ resource 'api' (service) exists but is not declared
~ resource 'orders-db' (storage) exists but is not declared

  left: 2
 right: 1

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (545707) panicked at crates/casm-diff/src/drift.rs:436:9:
assertion failed: report.drifts[0].is_missing()

failures:
    drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::a_matching_inventory_reports_no_drift
    drift::tests::a_report_summarises_itself_in_both_states
    drift::tests::an_empty_inventory_reports_every_node_as_missing
    drift::tests::an_explicit_binding_overrides_name_matching
    drift::tests::an_explicit_binding_that_matches_nothing_is_missing_despite_a_name_collision
    drift::tests::an_undeclared_resource_is_unexpected
    drift::tests::an_unrecognised_resource_type_asserts_nothing_about_the_node
    drift::tests::external_nodes_are_exempt

test result: FAILED. 31 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
