*** crates/casm-diff/src/drift.rs:348:25: replace != with == in detect

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace != with == in detect
@@ -340,17 +340,17 @@
             });
             continue;
         };
 
         bound_ids.push(&resource.id);
         matched = matched.saturating_add(1);
 
         if let Some(observed) = resource.node_type
-            && observed != node.node_type()
+            && observed == /* ~ changed by cargo-mutants ~ */ node.node_type()
         {
             drifts.push(Drift::TypeMismatch {
                 node: node.name().as_str().to_owned(),
                 declared: node.node_type().to_string(),
                 observed: observed.to_string(),
             });
         }
     }

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (545929) panicked at crates/casm-diff/src/drift.rs:435:9:
assertion `left == right` failed
  left: 2
 right: 1

---- drift::tests::a_matching_inventory_reports_no_drift stdout ----

thread 'drift::tests::a_matching_inventory_reports_no_drift' (545931) panicked at crates/casm-diff/src/drift.rs:424:9:
~ node 'api' is declared as service but the infrastructure says service
~ node 'orders-db' is declared as database but the infrastructure says database

---- drift::tests::an_explicit_binding_overrides_name_matching stdout ----

thread 'drift::tests::an_explicit_binding_overrides_name_matching' (545937) panicked at crates/casm-diff/src/drift.rs:515:9:
~ node 'orders-db' is declared as database but the infrastructure says database

failures:
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::a_matching_inventory_reports_no_drift
    drift::tests::an_explicit_binding_overrides_name_matching
    drift::tests::an_undeclared_resource_is_unexpected
    drift::tests::external_nodes_are_exempt

test result: FAILED. 36 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
