*** crates/casm-diff/src/drift.rs:359:12: delete ! in detect

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ delete ! in detect
@@ -351,17 +351,17 @@
                 node: node.name().as_str().to_owned(),
                 declared: node.node_type().to_string(),
                 observed: observed.to_string(),
             });
         }
     }
 
     for resource in &inventory.resources {
-        if !bound_ids.contains(&resource.id.as_str()) {
+        if  /* ~ changed by cargo-mutants ~ */bound_ids.contains(&resource.id.as_str()) {
             drifts.push(Drift::Unexpected {
                 resource: resource.id.clone(),
                 node_type: resource.node_type.map(|kind| kind.to_string()),
             });
         }
     }
 
     DriftReport {

---- drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch stdout ----

thread 'drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch' (546056) panicked at crates/casm-diff/src/drift.rs:474:9:
assertion `left == right` failed: ~ node 'orders-db' is declared as database but the infrastructure says storage
~ resource 'api' (service) exists but is not declared
~ resource 'orders-db' (storage) exists but is not declared

  left: 3
 right: 1

---- drift::tests::a_declared_node_with_no_resource_is_missing stdout ----

thread 'drift::tests::a_declared_node_with_no_resource_is_missing' (546057) panicked at crates/casm-diff/src/drift.rs:435:9:
assertion `left == right` failed
  left: 2
 right: 1

---- drift::tests::an_empty_architecture_reports_every_resource_as_unexpected stdout ----

thread 'drift::tests::an_empty_architecture_reports_every_resource_as_unexpected' (546063) panicked at crates/casm-diff/src/drift.rs:586:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    drift::tests::a_bound_resource_of_the_wrong_type_is_a_mismatch
    drift::tests::a_declared_node_with_no_resource_is_missing
    drift::tests::a_matching_inventory_reports_no_drift
    drift::tests::a_report_summarises_itself_in_both_states
    drift::tests::an_empty_architecture_reports_every_resource_as_unexpected
    drift::tests::an_explicit_binding_overrides_name_matching
    drift::tests::an_undeclared_resource_is_unexpected
    drift::tests::an_unrecognised_resource_type_asserts_nothing_about_the_node
    drift::tests::external_nodes_are_exempt

test result: FAILED. 32 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
