*** crates/casm-diff/src/drift.rs:76:5: replace default_source -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace default_source -> String with "xyzzy".into()
@@ -68,17 +68,17 @@
     pub source: String,
     /// Everything observed.
     #[serde(default)]
     pub resources: Vec<Resource>,
 }
 
 /// The inventory source used when a document does not name one.
 fn default_source() -> String {
-    "inventory".to_owned()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 impl Inventory {
     /// Parses a native CASIMIR inventory document.
     ///
     /// # Errors
     ///
     /// Returns a human-readable message if the JSON does not match the schema.

*** result: Success
