*** crates/casm-diff/src/drift.rs:86:9: replace Inventory::from_json -> Result<Self, String> with Ok(Default::default())

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace Inventory::from_json -> Result<Self, String> with Ok(Default::default())
@@ -78,17 +78,17 @@
 
 impl Inventory {
     /// Parses a native CASIMIR inventory document.
     ///
     /// # Errors
     ///
     /// Returns a human-readable message if the JSON does not match the schema.
     pub fn from_json(source: &str) -> Result<Self, String> {
-        serde_json::from_str(source).map_err(|error| format!("invalid inventory: {error}"))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Projects a Terraform state file into an inventory.
     ///
     /// Only managed resources are considered: a `data` block describes something
     /// Terraform reads rather than something it owns, so its absence is not drift.
     ///
     /// # Errors

---- drift::tests::a_malformed_inventory_is_rejected_with_a_message stdout ----

thread 'drift::tests::a_malformed_inventory_is_rejected_with_a_message' (540036) panicked at crates/casm-diff/src/drift.rs:607:56:
called `Result::unwrap_err()` on an `Ok` value: Inventory { source: "", resources: [] }

---- drift::tests::a_native_inventory_parses_from_json stdout ----

thread 'drift::tests::a_native_inventory_parses_from_json' (540038) panicked at crates/casm-diff/src/drift.rs:600:9:
assertion `left == right` failed
  left: ""
 right: "manual"

failures:
    drift::tests::a_malformed_inventory_is_rejected_with_a_message
    drift::tests::a_native_inventory_parses_from_json

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
