*** crates/casm-diff/src/drift.rs:98:9: replace Inventory::from_terraform_state -> Result<Self, String> with Ok(Default::default())

*** mutation diff:
--- crates/casm-diff/src/drift.rs
+++ replace Inventory::from_terraform_state -> Result<Self, String> with Ok(Default::default())
@@ -90,29 +90,17 @@
     ///
     /// Only managed resources are considered: a `data` block describes something
     /// Terraform reads rather than something it owns, so its absence is not drift.
     ///
     /// # Errors
     ///
     /// Returns a human-readable message if the state is not valid JSON.
     pub fn from_terraform_state(source: &str) -> Result<Self, String> {
-        let state: serde_json::Value = serde_json::from_str(source)
-            .map_err(|error| format!("invalid Terraform state: {error}"))?;
-
-        let resources = state
-            .get("resources")
-            .and_then(serde_json::Value::as_array)
-            .map(|entries| entries.iter().filter_map(terraform_resource).collect())
-            .unwrap_or_default();
-
-        Ok(Self {
-            source: "terraform".to_owned(),
-            resources,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds the resource bound to `node`, if any.
     ///
     /// Prefers an explicit `infrastructure-id`; falls back to name equality.
     #[must_use]
     pub fn bound_to(&self, node: &Node) -> Option<&Resource> {
         if let Some(declared) = node.metadata().get(BINDING_KEY) {

---- drift::tests::malformed_terraform_state_is_rejected stdout ----

thread 'drift::tests::malformed_terraform_state_is_rejected' (540121) panicked at crates/casm-diff/src/drift.rs:636:9:
assertion failed: Inventory::from_terraform_state("nope").is_err()

---- drift::tests::terraform_state_projects_into_an_inventory stdout ----

thread 'drift::tests::terraform_state_projects_into_an_inventory' (540122) panicked at crates/casm-diff/src/drift.rs:613:9:
assertion `left == right` failed
  left: ""
 right: "terraform"

failures:
    drift::tests::malformed_terraform_state_is_rejected
    drift::tests::terraform_state_projects_into_an_inventory

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
