*** crates/casm-diff/src/semantic.rs:139:9: replace Change::is_breaking -> bool with true

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Change::is_breaking -> bool with true
@@ -131,32 +131,17 @@
 
 impl Change {
     /// Returns `true` if this change could break an existing consumer.
     ///
     /// Used to decide whether a diff warrants a major version bump. Removals and type
     /// changes are breaking; additions generally are not.
     #[must_use]
     pub const fn is_breaking(&self) -> bool {
-        match self {
-            Self::NodeRemoved { .. }
-            | Self::NodeTypeChanged { .. }
-            | Self::RelationshipRemoved { .. }
-            // Dropping a claim withdraws a compliance guarantee somebody may be relying
-            // on. Making a new claim takes nothing away, so it is not breaking.
-            | Self::PatternDropped { .. } => true,
-            Self::Version { .. }
-            | Self::NodeAdded { .. }
-            | Self::NodeInterfacesChanged { .. }
-            | Self::NodeControlsChanged { .. }
-            | Self::RelationshipAdded { .. }
-            | Self::PatternClaimed { .. }
-            | Self::PatternBindingsChanged { .. }
-            | Self::LatencyBudgetChanged { .. } => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The diff marker for this change: `+`, `-`, or `~`.
     #[must_use]
     pub const fn marker(&self) -> char {
         match self {
             Self::NodeAdded { .. }
             | Self::RelationshipAdded { .. }

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (546319) panicked at crates/casm-diff/src/semantic.rs:715:9:
assertion failed: !diff.has_breaking_changes()

---- semantic::tests::an_added_node_is_reported_and_is_not_breaking stdout ----

thread 'semantic::tests::an_added_node_is_reported_and_is_not_breaking' (546326) panicked at crates/casm-diff/src/semantic.rs:612:9:
assertion failed: !diff.has_breaking_changes()

---- semantic::tests::claiming_a_pattern_is_a_change stdout ----

thread 'semantic::tests::claiming_a_pattern_is_a_change' (546331) panicked at crates/casm-diff/src/semantic.rs:843:9:
assertion failed: !diff.changes[0].is_breaking()

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::an_added_node_is_reported_and_is_not_breaking
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking

test result: FAILED. 37 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
