*** crates/casm-diff/src/semantic.rs:139:9: replace Change::is_breaking -> bool with false

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Change::is_breaking -> bool with false
@@ -131,32 +131,17 @@
 
 impl Change {
     /// Returns `true` if this change could break an existing consumer.
     ///
     /// Used to decide whether a diff warrants a major version bump. Removals and type
     /// changes are breaking; additions generally are not.
     #[must_use]
     pub const fn is_breaking(&self) -> bool {
-        match self {
-            Self::NodeRemoved { .. }
-            | Self::NodeTypeChanged { .. }
-            | Self::RelationshipRemoved { .. }
-            // Dropping a claim withdraws a compliance guarantee somebody may be relying
-            // on. Making a new claim takes nothing away, so it is not breaking.
-            | Self::PatternDropped { .. } => true,
-            Self::Version { .. }
-            | Self::NodeAdded { .. }
-            | Self::NodeInterfacesChanged { .. }
-            | Self::NodeControlsChanged { .. }
-            | Self::RelationshipAdded { .. }
-            | Self::PatternClaimed { .. }
-            | Self::PatternBindingsChanged { .. }
-            | Self::LatencyBudgetChanged { .. } => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The diff marker for this change: `+`, `-`, or `~`.
     #[must_use]
     pub const fn marker(&self) -> char {
         match self {
             Self::NodeAdded { .. }
             | Self::RelationshipAdded { .. }

---- semantic::tests::a_removed_node_is_breaking stdout ----

thread 'semantic::tests::a_removed_node_is_breaking' (546527) panicked at crates/casm-diff/src/semantic.rs:624:9:
assertion failed: diff.has_breaking_changes()

---- semantic::tests::a_changed_node_type_is_breaking stdout ----

thread 'semantic::tests::a_changed_node_type_is_breaking' (546525) panicked at crates/casm-diff/src/semantic.rs:644:9:
assertion failed: diff.has_breaking_changes()

---- semantic::tests::a_removed_relationship_is_breaking stdout ----

thread 'semantic::tests::a_removed_relationship_is_breaking' (546529) panicked at crates/casm-diff/src/semantic.rs:697:9:
assertion failed: diff.has_breaking_changes()

failures:
    semantic::tests::a_changed_node_type_is_breaking
    semantic::tests::a_removed_node_is_breaking
    semantic::tests::a_removed_relationship_is_breaking
    semantic::tests::a_renamed_node_shows_as_a_removal_and_an_addition
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::dropping_a_claim_is_breaking

test result: FAILED. 35 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
