*** crates/casm-diff/src/semantic.rs:179:9: replace <impl fmt::Display for Change>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace <impl fmt::Display for Change>::fmt -> fmt::Result with Ok(Default::default())
@@ -171,95 +171,17 @@
             | Self::PatternBindingsChanged { .. }
             | Self::LatencyBudgetChanged { .. } => '~',
         }
     }
 }
 
 impl fmt::Display for Change {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Version { from, to } => write!(f, "architecture version {from} -> {to}"),
-            Self::NodeAdded { name, node_type } => write!(f, "node '{name}' added ({node_type})"),
-            Self::NodeRemoved { name, node_type } => {
-                write!(f, "node '{name}' removed ({node_type})")
-            }
-            Self::NodeTypeChanged { name, from, to } => {
-                write!(f, "node '{name}' changed type from {from} to {to}")
-            }
-            Self::NodeInterfacesChanged {
-                name,
-                added,
-                removed,
-            } => {
-                write!(
-                    f,
-                    "node '{name}' interfaces: {}",
-                    added_removed(added, removed)
-                )
-            }
-            Self::NodeControlsChanged {
-                name,
-                added,
-                removed,
-            } => {
-                write!(
-                    f,
-                    "node '{name}' controls: {}",
-                    added_removed(added, removed)
-                )
-            }
-            Self::RelationshipAdded {
-                source,
-                target,
-                kind,
-            } => {
-                write!(f, "relationship '{source}' -> '{target}' added ({kind})")
-            }
-            Self::RelationshipRemoved {
-                source,
-                target,
-                kind,
-            } => {
-                write!(f, "relationship '{source}' -> '{target}' removed ({kind})")
-            }
-            Self::PatternClaimed { reference } => {
-                write!(f, "pattern '{reference}' claimed")
-            }
-            Self::PatternDropped { reference } => {
-                write!(f, "pattern '{reference}' no longer claimed")
-            }
-            Self::PatternBindingsChanged {
-                reference,
-                added,
-                removed,
-            } => {
-                write!(
-                    f,
-                    "pattern '{reference}' bindings: {}",
-                    added_removed(added, removed)
-                )
-            }
-            Self::LatencyBudgetChanged {
-                source,
-                target,
-                from,
-                to,
-            } => {
-                let render = |value: &Option<u64>| {
-                    value.map_or_else(|| "none".to_owned(), |ms| format!("{ms}ms"))
-                };
-                write!(
-                    f,
-                    "relationship '{source}' -> '{target}' latency budget {} -> {}",
-                    render(from),
-                    render(to)
-                )
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Renders a claim's bindings as sorted `role=node` strings.
 ///
 /// By node *name*, not `NodeId`, for the same reason the fingerprint is: re-parsing a
 /// file regenerates the identifiers, and a diff that reported that would be noise.
 fn bindings(architecture: &Architecture, claim: &Conformance) -> Vec<String> {

---- semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated stdout ----

thread 'semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated' (546772) panicked at crates/casm-diff/src/semantic.rs:740:9:
- 
-

---- semantic::tests::dropping_a_claim_is_breaking stdout ----

thread 'semantic::tests::dropping_a_claim_is_breaking' (546781) panicked at crates/casm-diff/src/semantic.rs:791:9:

failures:
    semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated
    semantic::tests::dropping_a_claim_is_breaking

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
