*** crates/casm-diff/src/semantic.rs:266:5: replace bindings -> Vec<String> with vec![]

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace bindings -> Vec<String> with vec![]
@@ -258,26 +258,17 @@
     }
 }
 
 /// Renders a claim's bindings as sorted `role=node` strings.
 ///
 /// By node *name*, not `NodeId`, for the same reason the fingerprint is: re-parsing a
 /// file regenerates the identifiers, and a diff that reported that would be noise.
 fn bindings(architecture: &Architecture, claim: &Conformance) -> Vec<String> {
-    claim
-        .bindings()
-        .iter()
-        .map(|(role, id)| {
-            let node = architecture
-                .node(*id)
-                .map_or_else(|| id.to_string(), |node| node.name().as_str().to_owned());
-            format!("{role}={node}")
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Formats an added/removed pair for display.
 fn added_removed(added: &[String], removed: &[String]) -> String {
     let mut parts = Vec::new();
     if !added.is_empty() {
         parts.push(format!("+[{}]", added.join(", ")));
     }

---- semantic::tests::rebinding_a_role_is_reported_without_being_breaking stdout ----

thread 'semantic::tests::rebinding_a_role_is_reported_without_being_breaking' (547310) panicked at crates/casm-diff/src/semantic.rs:874:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
