*** crates/casm-diff/src/semantic.rs:280:5: replace added_removed -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace added_removed -> String with "xyzzy".into()
@@ -272,24 +272,17 @@
                 .map_or_else(|| id.to_string(), |node| node.name().as_str().to_owned());
             format!("{role}={node}")
         })
         .collect()
 }
 
 /// Formats an added/removed pair for display.
 fn added_removed(added: &[String], removed: &[String]) -> String {
-    let mut parts = Vec::new();
-    if !added.is_empty() {
-        parts.push(format!("+[{}]", added.join(", ")));
-    }
-    if !removed.is_empty() {
-        parts.push(format!("-[{}]", removed.join(", ")));
-    }
-    parts.join(" ")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The complete semantic difference between two architectures.
 #[derive(Clone, Debug, Default, PartialEq, Eq, Serialize, Deserialize)]
 pub struct Diff {
     /// Every change, grouped by kind and deterministically ordered.
     pub changes: Vec<Change>,
 }

*** result: Success
