*** crates/casm-diff/src/semantic.rs:281:8: delete ! in added_removed

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in added_removed
@@ -273,17 +273,17 @@
             format!("{role}={node}")
         })
         .collect()
 }
 
 /// Formats an added/removed pair for display.
 fn added_removed(added: &[String], removed: &[String]) -> String {
     let mut parts = Vec::new();
-    if !added.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */added.is_empty() {
         parts.push(format!("+[{}]", added.join(", ")));
     }
     if !removed.is_empty() {
         parts.push(format!("-[{}]", removed.join(", ")));
     }
     parts.join(" ")
 }

*** result: Success
