*** crates/casm-diff/src/semantic.rs:284:8: delete ! in added_removed

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in added_removed
@@ -276,17 +276,17 @@
 }
 
 /// Formats an added/removed pair for display.
 fn added_removed(added: &[String], removed: &[String]) -> String {
     let mut parts = Vec::new();
     if !added.is_empty() {
         parts.push(format!("+[{}]", added.join(", ")));
     }
-    if !removed.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */removed.is_empty() {
         parts.push(format!("-[{}]", removed.join(", ")));
     }
     parts.join(" ")
 }
 
 /// The complete semantic difference between two architectures.
 #[derive(Clone, Debug, Default, PartialEq, Eq, Serialize, Deserialize)]
 pub struct Diff {

*** result: Success
