*** crates/casm-diff/src/semantic.rs:301:9: replace Diff::compute -> Self with Default::default()

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::compute -> Self with Default::default()
@@ -293,30 +293,17 @@
     /// Every change, grouped by kind and deterministically ordered.
     pub changes: Vec<Change>,
 }
 
 impl Diff {
     /// Computes the semantic difference from `old` to `new`.
     #[must_use]
     pub fn compute(old: &Architecture, new: &Architecture) -> Self {
-        let mut changes = Vec::new();
-
-        if old.version() != new.version() {
-            changes.push(Change::Version {
-                from: old.version().to_string(),
-                to: new.version().to_string(),
-            });
-        }
-
-        Self::diff_nodes(old, new, &mut changes);
-        Self::diff_relationships(old, new, &mut changes);
-        Self::diff_conformance(old, new, &mut changes);
-
-        Self { changes }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends node-level changes.
     fn diff_nodes(old: &Architecture, new: &Architecture, changes: &mut Vec<Change>) {
         for node in new.nodes() {
             match old.node_by_name(node.name().as_str()) {
                 None => changes.push(Change::NodeAdded {
                     name: node.name().as_str().to_owned(),

---- semantic::tests::a_removed_relationship_is_breaking stdout ----

thread 'semantic::tests::a_removed_relationship_is_breaking' (548332) panicked at crates/casm-diff/src/semantic.rs:694:9:
assertion failed: diff.changes.iter().any(|c| matches!(c, Change::RelationshipRemoved { .. }))

---- semantic::tests::a_removed_node_is_breaking stdout ----

thread 'semantic::tests::a_removed_node_is_breaking' (548331) panicked at crates/casm-diff/src/semantic.rs:622:9:
assertion failed: diff.changes.iter().any(|c|
        matches!(c, Change::NodeRemoved { name, .. } if name == "orders-db"))

---- semantic::tests::a_changed_node_type_is_breaking stdout ----

thread 'semantic::tests::a_changed_node_type_is_breaking' (548329) panicked at crates/casm-diff/src/semantic.rs:637:9:
[]

failures:
    semantic::tests::a_changed_node_type_is_breaking
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::a_removed_node_is_breaking
    semantic::tests::a_removed_relationship_is_breaking
    semantic::tests::a_renamed_node_shows_as_a_removal_and_an_addition
    semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated
    semantic::tests::a_version_bump_is_reported
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_added_node_is_reported_and_is_not_breaking
    semantic::tests::an_added_relationship_is_reported
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking

test result: FAILED. 27 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
