*** crates/casm-diff/src/semantic.rs:303:26: replace != with == in Diff::compute

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace != with == in Diff::compute
@@ -295,17 +295,17 @@
 }
 
 impl Diff {
     /// Computes the semantic difference from `old` to `new`.
     #[must_use]
     pub fn compute(old: &Architecture, new: &Architecture) -> Self {
         let mut changes = Vec::new();
 
-        if old.version() != new.version() {
+        if old.version() == /* ~ changed by cargo-mutants ~ */ new.version() {
             changes.push(Change::Version {
                 from: old.version().to_string(),
                 to: new.version().to_string(),
             });
         }
 
         Self::diff_nodes(old, new, &mut changes);
         Self::diff_relationships(old, new, &mut changes);

---- semantic::tests::an_architecture_does_not_differ_from_itself stdout ----

thread 'semantic::tests::an_architecture_does_not_differ_from_itself' (548964) panicked at crates/casm-diff/src/semantic.rs:565:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (548961) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [Version { from: "1.0.0", to: "1.0.0" }, PatternClaimed { reference: "p@2.0.0" }, PatternDropped { reference: "p@1.0.0" }]
  left: 3
 right: 2

---- semantic::tests::an_empty_diff_renders_a_plain_statement stdout ----

thread 'semantic::tests::an_empty_diff_renders_a_plain_statement' (548965) panicked at crates/casm-diff/src/semantic.rs:808:9:
assertion `left == right` failed
  left: "~ architecture version 1.0.0 -> 1.0.0\n"
 right: "no semantic changes\n"

failures:
    semantic::tests::a_version_bump_is_reported
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 30 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
