*** crates/casm-diff/src/semantic.rs:319:9: replace Diff::diff_nodes with ()

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::diff_nodes with ()
@@ -311,34 +311,17 @@
         Self::diff_relationships(old, new, &mut changes);
         Self::diff_conformance(old, new, &mut changes);
 
         Self { changes }
     }
 
     /// Appends node-level changes.
     fn diff_nodes(old: &Architecture, new: &Architecture, changes: &mut Vec<Change>) {
-        for node in new.nodes() {
-            match old.node_by_name(node.name().as_str()) {
-                None => changes.push(Change::NodeAdded {
-                    name: node.name().as_str().to_owned(),
-                    node_type: node.node_type().to_string(),
-                }),
-                Some(previous) => Self::diff_node_pair(previous, node, changes),
-            }
-        }
-
-        for node in old.nodes() {
-            if new.node_by_name(node.name().as_str()).is_none() {
-                changes.push(Change::NodeRemoved {
-                    name: node.name().as_str().to_owned(),
-                    node_type: node.node_type().to_string(),
-                });
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends changes between two versions of the same named node.
     fn diff_node_pair(old: &Node, new: &Node, changes: &mut Vec<Change>) {
         let name = new.name().as_str().to_owned();
 
         if old.node_type() != new.node_type() {
             changes.push(Change::NodeTypeChanged {

---- semantic::tests::a_removed_node_is_breaking stdout ----

thread 'semantic::tests::a_removed_node_is_breaking' (549205) panicked at crates/casm-diff/src/semantic.rs:618:9:
assertion failed: diff.changes.iter().any(|c|
        matches!(c, Change::NodeRemoved { name, .. } if name == "orders-db"))

---- semantic::tests::a_changed_node_type_is_breaking stdout ----

thread 'semantic::tests::a_changed_node_type_is_breaking' (549203) panicked at crates/casm-diff/src/semantic.rs:633:9:
[]

---- semantic::tests::an_added_node_is_reported_and_is_not_breaking stdout ----

thread 'semantic::tests::an_added_node_is_reported_and_is_not_breaking' (549213) panicked at crates/casm-diff/src/semantic.rs:603:9:
[]

failures:
    semantic::tests::a_changed_node_type_is_breaking
    semantic::tests::a_removed_node_is_breaking
    semantic::tests::a_renamed_node_shows_as_a_removal_and_an_addition
    semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated
    semantic::tests::an_added_node_is_reported_and_is_not_breaking
    semantic::tests::interface_and_control_changes_are_reported

test result: FAILED. 35 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
