*** crates/casm-diff/src/semantic.rs:341:9: replace Diff::diff_node_pair with ()

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::diff_node_pair with ()
@@ -333,63 +333,17 @@
                     node_type: node.node_type().to_string(),
                 });
             }
         }
     }
 
     /// Appends changes between two versions of the same named node.
     fn diff_node_pair(old: &Node, new: &Node, changes: &mut Vec<Change>) {
-        let name = new.name().as_str().to_owned();
-
-        if old.node_type() != new.node_type() {
-            changes.push(Change::NodeTypeChanged {
-                name: name.clone(),
-                from: old.node_type().to_string(),
-                to: new.node_type().to_string(),
-            });
-        }
-
-        let old_interfaces: Vec<String> = old
-            .interfaces()
-            .iter()
-            .map(|i| i.name().as_str().to_owned())
-            .collect();
-        let new_interfaces: Vec<String> = new
-            .interfaces()
-            .iter()
-            .map(|i| i.name().as_str().to_owned())
-            .collect();
-        let (added, removed) = difference(&old_interfaces, &new_interfaces);
-        if !added.is_empty() || !removed.is_empty() {
-            changes.push(Change::NodeInterfacesChanged {
-                name: name.clone(),
-                added,
-                removed,
-            });
-        }
-
-        let old_controls: Vec<String> = old
-            .controls()
-            .iter()
-            .map(|c| c.standard().to_owned())
-            .collect();
-        let new_controls: Vec<String> = new
-            .controls()
-            .iter()
-            .map(|c| c.standard().to_owned())
-            .collect();
-        let (added, removed) = difference(&old_controls, &new_controls);
-        if !added.is_empty() || !removed.is_empty() {
-            changes.push(Change::NodeControlsChanged {
-                name,
-                added,
-                removed,
-            });
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends conformance-claim changes.
     ///
     /// Included because the fingerprint includes them: if `casm diff` stayed silent about
     /// a claim `casm log` reports as a change, the two would contradict each other.
     fn diff_conformance(old: &Architecture, new: &Architecture, changes: &mut Vec<Change>) {
         for claim in new.conformance() {

---- semantic::tests::a_changed_node_type_is_breaking stdout ----

thread 'semantic::tests::a_changed_node_type_is_breaking' (549119) panicked at crates/casm-diff/src/semantic.rs:604:9:
[]

---- semantic::tests::interface_and_control_changes_are_reported stdout ----

thread 'semantic::tests::interface_and_control_changes_are_reported' (549134) panicked at crates/casm-diff/src/semantic.rs:713:9:
[]

failures:
    semantic::tests::a_changed_node_type_is_breaking
    semantic::tests::interface_and_control_changes_are_reported

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
