*** crates/casm-diff/src/semantic.rs:343:28: replace != with == in Diff::diff_node_pair

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace != with == in Diff::diff_node_pair
@@ -335,17 +335,17 @@
             }
         }
     }
 
     /// Appends changes between two versions of the same named node.
     fn diff_node_pair(old: &Node, new: &Node, changes: &mut Vec<Change>) {
         let name = new.name().as_str().to_owned();
 
-        if old.node_type() != new.node_type() {
+        if old.node_type() == /* ~ changed by cargo-mutants ~ */ new.node_type() {
             changes.push(Change::NodeTypeChanged {
                 name: name.clone(),
                 from: old.node_type().to_string(),
                 to: new.node_type().to_string(),
             });
         }
 
         let old_interfaces: Vec<String> = old

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (549304) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [NodeTypeChanged { name: "api", from: "service", to: "service" }, NodeTypeChanged { name: "orders-db", from: "database", to: "database" }, PatternClaimed { reference: "p@2.0.0" }, PatternDropped { reference: "p@1.0.0" }]
  left: 4
 right: 2

---- semantic::tests::a_changed_node_type_is_breaking stdout ----

thread 'semantic::tests::a_changed_node_type_is_breaking' (549297) panicked at crates/casm-diff/src/semantic.rs:650:9:
[NodeTypeChanged { name: "api", from: "service", to: "service" }]

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (549298) panicked at crates/casm-diff/src/semantic.rs:730:9:
assertion failed: !diff.has_breaking_changes()

failures:
    semantic::tests::a_changed_node_type_is_breaking
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_added_node_is_reported_and_is_not_breaking
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff

test result: FAILED. 28 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
