*** crates/casm-diff/src/semantic.rs:362:12: delete ! in Diff::diff_node_pair

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in Diff::diff_node_pair
@@ -354,17 +354,17 @@
             .map(|i| i.name().as_str().to_owned())
             .collect();
         let new_interfaces: Vec<String> = new
             .interfaces()
             .iter()
             .map(|i| i.name().as_str().to_owned())
             .collect();
         let (added, removed) = difference(&old_interfaces, &new_interfaces);
-        if !added.is_empty() || !removed.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */added.is_empty() || !removed.is_empty() {
             changes.push(Change::NodeInterfacesChanged {
                 name: name.clone(),
                 added,
                 removed,
             });
         }
 
         let old_controls: Vec<String> = old

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (550217) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [NodeInterfacesChanged { name: "api", added: [], removed: [] }, NodeInterfacesChanged { name: "orders-db", added: [], removed: [] }, PatternClaimed { reference: "p@2.0.0" }, PatternDropped { reference: "p@1.0.0" }]
  left: 4
 right: 2

---- semantic::tests::an_architecture_does_not_differ_from_itself stdout ----

thread 'semantic::tests::an_architecture_does_not_differ_from_itself' (550220) panicked at crates/casm-diff/src/semantic.rs:565:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::an_empty_diff_renders_a_plain_statement stdout ----

thread 'semantic::tests::an_empty_diff_renders_a_plain_statement' (550221) panicked at crates/casm-diff/src/semantic.rs:808:9:
assertion `left == right` failed
  left: "~ node 'api' interfaces: \n~ node 'orders-db' interfaces: \n"
 right: "no semantic changes\n"

failures:
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::interface_and_control_changes_are_reported
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 30 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
