*** crates/casm-diff/src/semantic.rs:362:30: replace || with && in Diff::diff_node_pair

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace || with && in Diff::diff_node_pair
@@ -354,17 +354,17 @@
             .map(|i| i.name().as_str().to_owned())
             .collect();
         let new_interfaces: Vec<String> = new
             .interfaces()
             .iter()
             .map(|i| i.name().as_str().to_owned())
             .collect();
         let (added, removed) = difference(&old_interfaces, &new_interfaces);
-        if !added.is_empty() || !removed.is_empty() {
+        if !added.is_empty() && /* ~ changed by cargo-mutants ~ */ !removed.is_empty() {
             changes.push(Change::NodeInterfacesChanged {
                 name: name.clone(),
                 added,
                 removed,
             });
         }
 
         let old_controls: Vec<String> = old

---- semantic::tests::interface_and_control_changes_are_reported stdout ----

thread 'semantic::tests::interface_and_control_changes_are_reported' (549468) panicked at crates/casm-diff/src/semantic.rs:759:9:
[NodeControlsChanged { name: "api", added: ["OIDC"], removed: [] }]

failures:
    semantic::tests::interface_and_control_changes_are_reported

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
