*** crates/casm-diff/src/semantic.rs:381:30: replace || with && in Diff::diff_node_pair

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace || with && in Diff::diff_node_pair
@@ -373,17 +373,17 @@
             .map(|c| c.standard().to_owned())
             .collect();
         let new_controls: Vec<String> = new
             .controls()
             .iter()
             .map(|c| c.standard().to_owned())
             .collect();
         let (added, removed) = difference(&old_controls, &new_controls);
-        if !added.is_empty() || !removed.is_empty() {
+        if !added.is_empty() && /* ~ changed by cargo-mutants ~ */ !removed.is_empty() {
             changes.push(Change::NodeControlsChanged {
                 name,
                 added,
                 removed,
             });
         }
     }

---- semantic::tests::interface_and_control_changes_are_reported stdout ----

thread 'semantic::tests::interface_and_control_changes_are_reported' (550174) panicked at crates/casm-diff/src/semantic.rs:767:9:
[NodeInterfacesChanged { name: "api", added: ["rest"], removed: [] }]

failures:
    semantic::tests::interface_and_control_changes_are_reported

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
