*** crates/casm-diff/src/semantic.rs:381:33: delete ! in Diff::diff_node_pair

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in Diff::diff_node_pair
@@ -373,17 +373,17 @@
             .map(|c| c.standard().to_owned())
             .collect();
         let new_controls: Vec<String> = new
             .controls()
             .iter()
             .map(|c| c.standard().to_owned())
             .collect();
         let (added, removed) = difference(&old_controls, &new_controls);
-        if !added.is_empty() || !removed.is_empty() {
+        if !added.is_empty() ||  /* ~ changed by cargo-mutants ~ */removed.is_empty() {
             changes.push(Change::NodeControlsChanged {
                 name,
                 added,
                 removed,
             });
         }
     }

---- semantic::tests::an_architecture_does_not_differ_from_itself stdout ----

thread 'semantic::tests::an_architecture_does_not_differ_from_itself' (550976) panicked at crates/casm-diff/src/semantic.rs:565:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (550973) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [NodeControlsChanged { name: "api", added: [], removed: [] }, NodeControlsChanged { name: "orders-db", added: [], removed: [] }, PatternClaimed { reference: "p@2.0.0" }, PatternDropped { reference: "p@1.0.0" }]
  left: 4
 right: 2

---- semantic::tests::dropping_a_claim_is_breaking stdout ----

thread 'semantic::tests::dropping_a_claim_is_breaking' (550980) panicked at crates/casm-diff/src/semantic.rs:866:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 31 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
