*** crates/casm-diff/src/semantic.rs:395:9: replace Diff::diff_conformance with ()

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::diff_conformance with ()
@@ -387,46 +387,17 @@
         }
     }
 
     /// Appends conformance-claim changes.
     ///
     /// Included because the fingerprint includes them: if `casm diff` stayed silent about
     /// a claim `casm log` reports as a change, the two would contradict each other.
     fn diff_conformance(old: &Architecture, new: &Architecture, changes: &mut Vec<Change>) {
-        for claim in new.conformance() {
-            let reference = claim.pattern().to_string();
-            let Some(previous) = old
-                .conformance()
-                .find(|earlier| earlier.pattern() == claim.pattern())
-            else {
-                changes.push(Change::PatternClaimed { reference });
-                continue;
-            };
-
-            let (added, removed) = difference(&bindings(old, previous), &bindings(new, claim));
-            if !added.is_empty() || !removed.is_empty() {
-                changes.push(Change::PatternBindingsChanged {
-                    reference,
-                    added,
-                    removed,
-                });
-            }
-        }
-
-        for claim in old.conformance() {
-            let still_claimed = new
-                .conformance()
-                .any(|current| current.pattern() == claim.pattern());
-            if !still_claimed {
-                changes.push(Change::PatternDropped {
-                    reference: claim.pattern().to_string(),
-                });
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends relationship-level changes.
     fn diff_relationships(old: &Architecture, new: &Architecture, changes: &mut Vec<Change>) {
         for edge in new.relationships() {
             let key = edge_key(new, edge);
             match find_edge(old, &key) {
                 None => changes.push(Change::RelationshipAdded {

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (551204) panicked at crates/casm-diff/src/semantic.rs:886:9:
assertion `left == right` failed: []
  left: 0
 right: 2

---- semantic::tests::claiming_a_pattern_is_a_change stdout ----

thread 'semantic::tests::claiming_a_pattern_is_a_change' (551212) panicked at crates/casm-diff/src/semantic.rs:821:9:
assertion `left == right` failed
  left: 0
 right: 1

---- semantic::tests::rebinding_a_role_is_reported_without_being_breaking stdout ----

thread 'semantic::tests::rebinding_a_role_is_reported_without_being_breaking' (551217) panicked at crates/casm-diff/src/semantic.rs:854:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking

test result: FAILED. 37 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
