*** crates/casm-diff/src/semantic.rs:399:51: replace == with != in Diff::diff_conformance

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace == with != in Diff::diff_conformance
@@ -391,17 +391,17 @@
     ///
     /// Included because the fingerprint includes them: if `casm diff` stayed silent about
     /// a claim `casm log` reports as a change, the two would contradict each other.
     fn diff_conformance(old: &Architecture, new: &Architecture, changes: &mut Vec<Change>) {
         for claim in new.conformance() {
             let reference = claim.pattern().to_string();
             let Some(previous) = old
                 .conformance()
-                .find(|earlier| earlier.pattern() == claim.pattern())
+                .find(|earlier| earlier.pattern() != /* ~ changed by cargo-mutants ~ */ claim.pattern())
             else {
                 changes.push(Change::PatternClaimed { reference });
                 continue;
             };
 
             let (added, removed) = difference(&bindings(old, previous), &bindings(new, claim));
             if !added.is_empty() || !removed.is_empty() {
                 changes.push(Change::PatternBindingsChanged {

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (551105) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [PatternDropped { reference: "p@1.0.0" }]
  left: 1
 right: 2

---- semantic::tests::an_unchanged_claim_produces_nothing stdout ----

thread 'semantic::tests::an_unchanged_claim_produces_nothing' (551110) panicked at crates/casm-diff/src/semantic.rs:897:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::rebinding_a_role_is_reported_without_being_breaking stdout ----

thread 'semantic::tests::rebinding_a_role_is_reported_without_being_breaking' (551115) panicked at crates/casm-diff/src/semantic.rs:889:22:
expected PatternBindingsChanged, got PatternClaimed { reference: "p@1.0.0" }

failures:
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 37 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
