*** crates/casm-diff/src/semantic.rs:406:34: replace || with && in Diff::diff_conformance

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace || with && in Diff::diff_conformance
@@ -398,17 +398,17 @@
                 .conformance()
                 .find(|earlier| earlier.pattern() == claim.pattern())
             else {
                 changes.push(Change::PatternClaimed { reference });
                 continue;
             };
 
             let (added, removed) = difference(&bindings(old, previous), &bindings(new, claim));
-            if !added.is_empty() || !removed.is_empty() {
+            if !added.is_empty() && /* ~ changed by cargo-mutants ~ */ !removed.is_empty() {
                 changes.push(Change::PatternBindingsChanged {
                     reference,
                     added,
                     removed,
                 });
             }
         }

*** result: Success
