*** crates/casm-diff/src/semantic.rs:406:37: delete ! in Diff::diff_conformance

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in Diff::diff_conformance
@@ -398,17 +398,17 @@
                 .conformance()
                 .find(|earlier| earlier.pattern() == claim.pattern())
             else {
                 changes.push(Change::PatternClaimed { reference });
                 continue;
             };
 
             let (added, removed) = difference(&bindings(old, previous), &bindings(new, claim));
-            if !added.is_empty() || !removed.is_empty() {
+            if !added.is_empty() ||  /* ~ changed by cargo-mutants ~ */removed.is_empty() {
                 changes.push(Change::PatternBindingsChanged {
                     reference,
                     added,
                     removed,
                 });
             }
         }

---- semantic::tests::an_unchanged_claim_produces_nothing stdout ----

thread 'semantic::tests::an_unchanged_claim_produces_nothing' (552070) panicked at crates/casm-diff/src/semantic.rs:897:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding stdout ----

thread 'semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding' (552078) panicked at crates/casm-diff/src/semantic.rs:906:9:
assertion failed: Diff::compute(&first, &second).is_empty()

failures:
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
