*** crates/casm-diff/src/semantic.rs:418:50: replace == with != in Diff::diff_conformance

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace == with != in Diff::diff_conformance
@@ -410,17 +410,17 @@
                     removed,
                 });
             }
         }
 
         for claim in old.conformance() {
             let still_claimed = new
                 .conformance()
-                .any(|current| current.pattern() == claim.pattern());
+                .any(|current| current.pattern() != /* ~ changed by cargo-mutants ~ */ claim.pattern());
             if !still_claimed {
                 changes.push(Change::PatternDropped {
                     reference: claim.pattern().to_string(),
                 });
             }
         }
     }

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (552257) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [PatternClaimed { reference: "p@2.0.0" }]
  left: 1
 right: 2

---- semantic::tests::an_unchanged_claim_produces_nothing stdout ----

thread 'semantic::tests::an_unchanged_claim_produces_nothing' (552262) panicked at crates/casm-diff/src/semantic.rs:897:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding stdout ----

thread 'semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding' (552270) panicked at crates/casm-diff/src/semantic.rs:906:9:
assertion failed: Diff::compute(&first, &second).is_empty()

failures:
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 37 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
