*** crates/casm-diff/src/semantic.rs:419:16: delete ! in Diff::diff_conformance

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in Diff::diff_conformance
@@ -411,17 +411,17 @@
                 });
             }
         }
 
         for claim in old.conformance() {
             let still_claimed = new
                 .conformance()
                 .any(|current| current.pattern() == claim.pattern());
-            if !still_claimed {
+            if  /* ~ changed by cargo-mutants ~ */still_claimed {
                 changes.push(Change::PatternDropped {
                     reference: claim.pattern().to_string(),
                 });
             }
         }
     }
 
     /// Appends relationship-level changes.

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (552109) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [PatternClaimed { reference: "p@2.0.0" }]
  left: 1
 right: 2

---- semantic::tests::rebinding_a_role_is_reported_without_being_breaking stdout ----

thread 'semantic::tests::rebinding_a_role_is_reported_without_being_breaking' (552120) panicked at crates/casm-diff/src/semantic.rs:883:9:
assertion `left == right` failed
  left: 2
 right: 1

---- semantic::tests::an_unchanged_claim_produces_nothing stdout ----

thread 'semantic::tests::an_unchanged_claim_produces_nothing' (552115) panicked at crates/casm-diff/src/semantic.rs:897:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

failures:
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 36 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
