*** crates/casm-diff/src/semantic.rs:429:9: replace Diff::diff_relationships with ()

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::diff_relationships with ()
@@ -421,46 +421,17 @@
                     reference: claim.pattern().to_string(),
                 });
             }
         }
     }
 
     /// Appends relationship-level changes.
     fn diff_relationships(old: &Architecture, new: &Architecture, changes: &mut Vec<Change>) {
-        for edge in new.relationships() {
-            let key = edge_key(new, edge);
-            match find_edge(old, &key) {
-                None => changes.push(Change::RelationshipAdded {
-                    source: key.0,
-                    target: key.1,
-                    kind: key.2,
-                }),
-                Some(previous) if previous.latency_budget_ms() != edge.latency_budget_ms() => {
-                    changes.push(Change::LatencyBudgetChanged {
-                        source: key.0,
-                        target: key.1,
-                        from: previous.latency_budget_ms(),
-                        to: edge.latency_budget_ms(),
-                    });
-                }
-                Some(_) => {}
-            }
-        }
-
-        for edge in old.relationships() {
-            let key = edge_key(old, edge);
-            if find_edge(new, &key).is_none() {
-                changes.push(Change::RelationshipRemoved {
-                    source: key.0,
-                    target: key.1,
-                    kind: key.2,
-                });
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the two architectures are semantically identical.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.changes.is_empty()
     }

---- semantic::tests::a_removed_relationship_is_breaking stdout ----

thread 'semantic::tests::a_removed_relationship_is_breaking' (552368) panicked at crates/casm-diff/src/semantic.rs:678:9:
assertion failed: diff.changes.iter().any(|c| matches!(c, Change::RelationshipRemoved { .. }))

---- semantic::tests::an_added_relationship_is_reported stdout ----

thread 'semantic::tests::an_added_relationship_is_reported' (552377) panicked at crates/casm-diff/src/semantic.rs:663:9:
[]

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (552366) panicked at crates/casm-diff/src/semantic.rs:691:9:
[]

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::a_removed_relationship_is_breaking
    semantic::tests::an_added_relationship_is_reported

test result: FAILED. 38 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
