*** crates/casm-diff/src/semantic.rs:437:35: replace match guard previous.latency_budget_ms() != edge.latency_budget_ms() with false in Diff::diff_relationships

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace match guard previous.latency_budget_ms() != edge.latency_budget_ms() with false in Diff::diff_relationships
@@ -429,17 +429,17 @@
         for edge in new.relationships() {
             let key = edge_key(new, edge);
             match find_edge(old, &key) {
                 None => changes.push(Change::RelationshipAdded {
                     source: key.0,
                     target: key.1,
                     kind: key.2,
                 }),
-                Some(previous) if previous.latency_budget_ms() != edge.latency_budget_ms() => {
+                Some(previous) if false /* ~ changed by cargo-mutants ~ */ => {
                     changes.push(Change::LatencyBudgetChanged {
                         source: key.0,
                         target: key.1,
                         from: previous.latency_budget_ms(),
                         to: edge.latency_budget_ms(),
                     });
                 }
                 Some(_) => {}

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (552969) panicked at crates/casm-diff/src/semantic.rs:720:9:
[]

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
