*** crates/casm-diff/src/semantic.rs:437:64: replace != with == in Diff::diff_relationships

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace != with == in Diff::diff_relationships
@@ -429,17 +429,17 @@
         for edge in new.relationships() {
             let key = edge_key(new, edge);
             match find_edge(old, &key) {
                 None => changes.push(Change::RelationshipAdded {
                     source: key.0,
                     target: key.1,
                     kind: key.2,
                 }),
-                Some(previous) if previous.latency_budget_ms() != edge.latency_budget_ms() => {
+                Some(previous) if previous.latency_budget_ms() == /* ~ changed by cargo-mutants ~ */ edge.latency_budget_ms() => {
                     changes.push(Change::LatencyBudgetChanged {
                         source: key.0,
                         target: key.1,
                         from: previous.latency_budget_ms(),
                         to: edge.latency_budget_ms(),
                     });
                 }
                 Some(_) => {}

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (553131) panicked at crates/casm-diff/src/semantic.rs:720:9:
[]

---- semantic::tests::an_architecture_does_not_differ_from_itself stdout ----

thread 'semantic::tests::an_architecture_does_not_differ_from_itself' (553140) panicked at crates/casm-diff/src/semantic.rs:565:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::an_empty_diff_renders_a_plain_statement stdout ----

thread 'semantic::tests::an_empty_diff_renders_a_plain_statement' (553141) panicked at crates/casm-diff/src/semantic.rs:808:9:
assertion `left == right` failed
  left: "~ relationship 'api' -> 'orders-db' latency budget 50ms -> 50ms\n"
 right: "no semantic changes\n"

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 30 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
