*** crates/casm-diff/src/semantic.rs:464:9: replace Diff::is_empty -> bool with true

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::is_empty -> bool with true
@@ -456,17 +456,17 @@
                 });
             }
         }
     }
 
     /// Returns `true` if the two architectures are semantically identical.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.changes.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if any change could break an existing consumer.
     #[must_use]
     pub fn has_breaking_changes(&self) -> bool {
         self.changes.iter().any(Change::is_breaking)
     }

---- semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated stdout ----

thread 'semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated' (553245) panicked at crates/casm-diff/src/semantic.rs:818:9:
no semantic changes

failures:
    semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated

test result: FAILED. 40 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
