*** crates/casm-diff/src/semantic.rs:464:9: replace Diff::is_empty -> bool with false

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::is_empty -> bool with false
@@ -456,17 +456,17 @@
                 });
             }
         }
     }
 
     /// Returns `true` if the two architectures are semantically identical.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.changes.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if any change could break an existing consumer.
     #[must_use]
     pub fn has_breaking_changes(&self) -> bool {
         self.changes.iter().any(Change::is_breaking)
     }

---- semantic::tests::an_unchanged_claim_produces_nothing stdout ----

thread 'semantic::tests::an_unchanged_claim_produces_nothing' (553944) panicked at crates/casm-diff/src/semantic.rs:897:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::an_architecture_does_not_differ_from_itself stdout ----

thread 'semantic::tests::an_architecture_does_not_differ_from_itself' (553942) panicked at crates/casm-diff/src/semantic.rs:565:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::an_empty_diff_renders_a_plain_statement stdout ----

thread 'semantic::tests::an_empty_diff_renders_a_plain_statement' (553943) panicked at crates/casm-diff/src/semantic.rs:808:9:
assertion `left == right` failed
  left: ""
 right: "no semantic changes\n"

failures:
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 35 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
