*** crates/casm-diff/src/semantic.rs:470:9: replace Diff::has_breaking_changes -> bool with true

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::has_breaking_changes -> bool with true
@@ -462,17 +462,17 @@
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.changes.is_empty()
     }
 
     /// Returns `true` if any change could break an existing consumer.
     #[must_use]
     pub fn has_breaking_changes(&self) -> bool {
-        self.changes.iter().any(Change::is_breaking)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders the diff as a marker-prefixed list.
     #[must_use]
     pub fn render(&self) -> String {
         if self.is_empty() {
             return "no semantic changes\n".to_owned();
         }

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (553827) panicked at crates/casm-diff/src/semantic.rs:730:9:
assertion failed: !diff.has_breaking_changes()

---- semantic::tests::an_added_node_is_reported_and_is_not_breaking stdout ----

thread 'semantic::tests::an_added_node_is_reported_and_is_not_breaking' (553836) panicked at crates/casm-diff/src/semantic.rs:627:9:
assertion failed: !diff.has_breaking_changes()

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::an_added_node_is_reported_and_is_not_breaking

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
