*** crates/casm-diff/src/semantic.rs:470:9: replace Diff::has_breaking_changes -> bool with false

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::has_breaking_changes -> bool with false
@@ -462,17 +462,17 @@
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.changes.is_empty()
     }
 
     /// Returns `true` if any change could break an existing consumer.
     #[must_use]
     pub fn has_breaking_changes(&self) -> bool {
-        self.changes.iter().any(Change::is_breaking)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders the diff as a marker-prefixed list.
     #[must_use]
     pub fn render(&self) -> String {
         if self.is_empty() {
             return "no semantic changes\n".to_owned();
         }

---- semantic::tests::a_removed_node_is_breaking stdout ----

thread 'semantic::tests::a_removed_node_is_breaking' (553996) panicked at crates/casm-diff/src/semantic.rs:639:9:
assertion failed: diff.has_breaking_changes()

---- semantic::tests::a_removed_relationship_is_breaking stdout ----

thread 'semantic::tests::a_removed_relationship_is_breaking' (553997) panicked at crates/casm-diff/src/semantic.rs:712:9:
assertion failed: diff.has_breaking_changes()

---- semantic::tests::a_changed_node_type_is_breaking stdout ----

thread 'semantic::tests::a_changed_node_type_is_breaking' (553994) panicked at crates/casm-diff/src/semantic.rs:659:9:
assertion failed: diff.has_breaking_changes()

failures:
    semantic::tests::a_changed_node_type_is_breaking
    semantic::tests::a_removed_node_is_breaking
    semantic::tests::a_removed_relationship_is_breaking
    semantic::tests::a_renamed_node_shows_as_a_removal_and_an_addition
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim

test result: FAILED. 36 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
