*** crates/casm-diff/src/semantic.rs:476:9: replace Diff::render -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace Diff::render -> String with "xyzzy".into()
@@ -468,28 +468,17 @@
     #[must_use]
     pub fn has_breaking_changes(&self) -> bool {
         self.changes.iter().any(Change::is_breaking)
     }
 
     /// Renders the diff as a marker-prefixed list.
     #[must_use]
     pub fn render(&self) -> String {
-        if self.is_empty() {
-            return "no semantic changes\n".to_owned();
-        }
-
-        let mut out = String::new();
-        for change in &self.changes {
-            out.push(change.marker());
-            out.push(' ');
-            out.push_str(&change.to_string());
-            out.push('\n');
-        }
-        out
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Builds a relationship's name-based identity key.
 fn edge_key(architecture: &Architecture, edge: &Relationship) -> (String, String, String) {
     let name_of = |id| {
         architecture
             .node(id)

---- semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated stdout ----

thread 'semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated' (554827) panicked at crates/casm-diff/src/semantic.rs:807:9:
xyzzy

---- semantic::tests::an_empty_diff_renders_a_plain_statement stdout ----

thread 'semantic::tests::an_empty_diff_renders_a_plain_statement' (554833) panicked at crates/casm-diff/src/semantic.rs:797:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "no semantic changes\n"

failures:
    semantic::tests::a_rendered_diff_is_marker_prefixed_and_newline_terminated
    semantic::tests::an_empty_diff_renders_a_plain_statement

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
