*** crates/casm-diff/src/semantic.rs:493:5: replace edge_key -> (String, String, String) with ("xyzzy".into(), String::new(), String::new())

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace edge_key -> (String, String, String) with ("xyzzy".into(), String::new(), String::new())
@@ -485,26 +485,17 @@
             out.push('\n');
         }
         out
     }
 }
 
 /// Builds a relationship's name-based identity key.
 fn edge_key(architecture: &Architecture, edge: &Relationship) -> (String, String, String) {
-    let name_of = |id| {
-        architecture
-            .node(id)
-            .map_or_else(|| "?".to_owned(), |node| node.name().as_str().to_owned())
-    };
-    (
-        name_of(edge.source()),
-        name_of(edge.target()),
-        edge.relationship_type().to_string(),
-    )
+    ("xyzzy".into(), String::new(), String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Finds a relationship in `architecture` matching a name-based key.
 fn find_edge<'a>(
     architecture: &'a Architecture,
     key: &(String, String, String),
 ) -> Option<&'a Relationship> {
     architecture

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (555709) panicked at crates/casm-diff/src/semantic.rs:711:9:
[LatencyBudgetChanged { source: "xyzzy", target: "", from: Some(50), to: Some(500) }]

---- semantic::tests::an_added_relationship_is_reported stdout ----

thread 'semantic::tests::an_added_relationship_is_reported' (555717) panicked at crates/casm-diff/src/semantic.rs:683:9:
[LatencyBudgetChanged { source: "xyzzy", target: "", from: Some(50), to: None }]

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::an_added_relationship_is_reported

test result: FAILED. 39 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
