*** crates/casm-diff/src/semantic.rs:510:5: replace find_edge -> Option<&'a Relationship> with None

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace find_edge -> Option<&'a Relationship> with None
@@ -502,19 +502,17 @@
     )
 }
 
 /// Finds a relationship in `architecture` matching a name-based key.
 fn find_edge<'a>(
     architecture: &'a Architecture,
     key: &(String, String, String),
 ) -> Option<&'a Relationship> {
-    architecture
-        .relationships()
-        .find(|edge| &edge_key(architecture, edge) == key)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns the items added to and removed from `old` to reach `new`.
 fn difference(old: &[String], new: &[String]) -> (Vec<String>, Vec<String>) {
     let added = new
         .iter()
         .filter(|item| !old.contains(item))
         .cloned()

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (556517) panicked at crates/casm-diff/src/semantic.rs:718:9:
[RelationshipAdded { source: "api", target: "orders-db", kind: "sync" }, RelationshipRemoved { source: "api", target: "orders-db", kind: "sync" }]

---- semantic::tests::an_architecture_does_not_differ_from_itself stdout ----

thread 'semantic::tests::an_architecture_does_not_differ_from_itself' (556526) panicked at crates/casm-diff/src/semantic.rs:563:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::an_empty_diff_renders_a_plain_statement stdout ----

thread 'semantic::tests::an_empty_diff_renders_a_plain_statement' (556527) panicked at crates/casm-diff/src/semantic.rs:806:9:
assertion `left == right` failed
  left: "+ relationship 'api' -> 'orders-db' added (sync)\n- relationship 'api' -> 'orders-db' removed (sync)\n"
 right: "no semantic changes\n"

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_added_node_is_reported_and_is_not_breaking
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding

test result: FAILED. 29 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
