*** crates/casm-diff/src/semantic.rs:512:52: replace == with != in find_edge

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace == with != in find_edge
@@ -504,17 +504,17 @@
 
 /// Finds a relationship in `architecture` matching a name-based key.
 fn find_edge<'a>(
     architecture: &'a Architecture,
     key: &(String, String, String),
 ) -> Option<&'a Relationship> {
     architecture
         .relationships()
-        .find(|edge| &edge_key(architecture, edge) == key)
+        .find(|edge| &edge_key(architecture, edge) != /* ~ changed by cargo-mutants ~ */ key)
 }
 
 /// Returns the items added to and removed from `old` to reach `new`.
 fn difference(old: &[String], new: &[String]) -> (Vec<String>, Vec<String>) {
     let added = new
         .iter()
         .filter(|item| !old.contains(item))
         .cloned()

---- semantic::tests::a_latency_budget_change_is_reported_but_not_breaking stdout ----

thread 'semantic::tests::a_latency_budget_change_is_reported_but_not_breaking' (556560) panicked at crates/casm-diff/src/semantic.rs:720:9:
[RelationshipAdded { source: "api", target: "orders-db", kind: "sync" }, RelationshipRemoved { source: "api", target: "orders-db", kind: "sync" }]

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (556566) panicked at crates/casm-diff/src/semantic.rs:915:9:
assertion `left == right` failed: [RelationshipAdded { source: "api", target: "orders-db", kind: "sync" }, RelationshipRemoved { source: "api", target: "orders-db", kind: "sync" }, PatternClaimed { reference: "p@2.0.0" }, PatternDropped { reference: "p@1.0.0" }]
  left: 4
 right: 2

---- semantic::tests::an_added_node_is_reported_and_is_not_breaking stdout ----

thread 'semantic::tests::an_added_node_is_reported_and_is_not_breaking' (556567) panicked at crates/casm-diff/src/semantic.rs:627:9:
assertion failed: !diff.has_breaking_changes()

failures:
    semantic::tests::a_latency_budget_change_is_reported_but_not_breaking
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_added_node_is_reported_and_is_not_breaking
    semantic::tests::an_added_relationship_is_reported
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff

test result: FAILED. 28 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
