*** crates/casm-diff/src/semantic.rs:517:5: replace difference -> (Vec<String>, Vec<String>) with (vec![], vec![])

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace difference -> (Vec<String>, Vec<String>) with (vec![], vec![])
@@ -509,27 +509,17 @@
 ) -> Option<&'a Relationship> {
     architecture
         .relationships()
         .find(|edge| &edge_key(architecture, edge) == key)
 }
 
 /// Returns the items added to and removed from `old` to reach `new`.
 fn difference(old: &[String], new: &[String]) -> (Vec<String>, Vec<String>) {
-    let added = new
-        .iter()
-        .filter(|item| !old.contains(item))
-        .cloned()
-        .collect();
-    let removed = old
-        .iter()
-        .filter(|item| !new.contains(item))
-        .cloned()
-        .collect();
-    (added, removed)
+    (vec![], vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- semantic::tests::interface_and_control_changes_are_reported stdout ----

thread 'semantic::tests::interface_and_control_changes_are_reported' (556925) panicked at crates/casm-diff/src/semantic.rs:749:9:
[]

---- semantic::tests::rebinding_a_role_is_reported_without_being_breaking stdout ----

thread 'semantic::tests::rebinding_a_role_is_reported_without_being_breaking' (556927) panicked at crates/casm-diff/src/semantic.rs:873:9:
assertion `left == right` failed
  left: 0
 right: 1

---- semantic::tests::the_difference_helper_partitions_correctly stdout ----

thread 'semantic::tests::the_difference_helper_partitions_correctly' (556933) panicked at crates/casm-diff/src/semantic.rs:820:9:
assertion `left == right` failed
  left: []
 right: ["c"]

failures:
    semantic::tests::interface_and_control_changes_are_reported
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::the_difference_helper_partitions_correctly

test result: FAILED. 38 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
