*** crates/casm-diff/src/semantic.rs:517:5: replace difference -> (Vec<String>, Vec<String>) with (vec![], vec![String::new()])

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ replace difference -> (Vec<String>, Vec<String>) with (vec![], vec![String::new()])
@@ -509,27 +509,17 @@
 ) -> Option<&'a Relationship> {
     architecture
         .relationships()
         .find(|edge| &edge_key(architecture, edge) == key)
 }
 
 /// Returns the items added to and removed from `old` to reach `new`.
 fn difference(old: &[String], new: &[String]) -> (Vec<String>, Vec<String>) {
-    let added = new
-        .iter()
-        .filter(|item| !old.contains(item))
-        .cloned()
-        .collect();
-    let removed = old
-        .iter()
-        .filter(|item| !new.contains(item))
-        .cloned()
-        .collect();
-    (added, removed)
+    (vec![], vec![String::new()]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- semantic::tests::an_empty_diff_renders_a_plain_statement stdout ----

thread 'semantic::tests::an_empty_diff_renders_a_plain_statement' (557279) panicked at crates/casm-diff/src/semantic.rs:798:9:
assertion `left == right` failed
  left: "~ node 'api' interfaces: -[]\n~ node 'api' controls: -[]\n~ node 'orders-db' interfaces: -[]\n~ node 'orders-db' controls: -[]\n"
 right: "no semantic changes\n"

---- semantic::tests::an_architecture_does_not_differ_from_itself stdout ----

thread 'semantic::tests::an_architecture_does_not_differ_from_itself' (557278) panicked at crates/casm-diff/src/semantic.rs:555:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim stdout ----

thread 'semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim' (557275) panicked at crates/casm-diff/src/semantic.rs:905:9:
  left: 6
 right: 2

failures:
    semantic::tests::a_version_bump_of_a_pattern_is_a_drop_and_a_claim
    semantic::tests::an_architecture_does_not_differ_from_itself
    semantic::tests::an_empty_diff_renders_a_plain_statement
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::claiming_a_pattern_is_a_change
    semantic::tests::dropping_a_claim_is_breaking
    semantic::tests::interface_and_control_changes_are_reported
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::regenerated_identifiers_produce_no_diff
    semantic::tests::reordering_nodes_produces_no_diff
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding
    semantic::tests::the_difference_helper_partitions_correctly

test result: FAILED. 29 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
