*** crates/casm-diff/src/semantic.rs:519:24: delete ! in difference

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in difference
@@ -511,17 +511,17 @@
         .relationships()
         .find(|edge| &edge_key(architecture, edge) == key)
 }
 
 /// Returns the items added to and removed from `old` to reach `new`.
 fn difference(old: &[String], new: &[String]) -> (Vec<String>, Vec<String>) {
     let added = new
         .iter()
-        .filter(|item| !old.contains(item))
+        .filter(|item|  /* ~ changed by cargo-mutants ~ */old.contains(item))
         .cloned()
         .collect();
     let removed = old
         .iter()
         .filter(|item| !new.contains(item))
         .cloned()
         .collect();
     (added, removed)

---- semantic::tests::an_unchanged_claim_produces_nothing stdout ----

thread 'semantic::tests::an_unchanged_claim_produces_nothing' (558812) panicked at crates/casm-diff/src/semantic.rs:897:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::interface_and_control_changes_are_reported stdout ----

thread 'semantic::tests::interface_and_control_changes_are_reported' (558816) panicked at crates/casm-diff/src/semantic.rs:759:9:
[]

---- semantic::tests::rebinding_a_role_is_reported_without_being_breaking stdout ----

thread 'semantic::tests::rebinding_a_role_is_reported_without_being_breaking' (558818) panicked at crates/casm-diff/src/semantic.rs:886:17:
assertion `left == right` failed
  left: []
 right: ["store=orders-db"]

failures:
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::interface_and_control_changes_are_reported
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding
    semantic::tests::the_difference_helper_partitions_correctly

test result: FAILED. 36 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
