*** crates/casm-diff/src/semantic.rs:524:24: delete ! in difference

*** mutation diff:
--- crates/casm-diff/src/semantic.rs
+++ delete ! in difference
@@ -516,17 +516,17 @@
 fn difference(old: &[String], new: &[String]) -> (Vec<String>, Vec<String>) {
     let added = new
         .iter()
         .filter(|item| !old.contains(item))
         .cloned()
         .collect();
     let removed = old
         .iter()
-        .filter(|item| !new.contains(item))
+        .filter(|item|  /* ~ changed by cargo-mutants ~ */new.contains(item))
         .cloned()
         .collect();
     (added, removed)
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,

---- semantic::tests::an_unchanged_claim_produces_nothing stdout ----

thread 'semantic::tests::an_unchanged_claim_produces_nothing' (559134) panicked at crates/casm-diff/src/semantic.rs:897:9:
assertion failed: Diff::compute(&architecture, &architecture).is_empty()

---- semantic::tests::rebinding_a_role_is_reported_without_being_breaking stdout ----

thread 'semantic::tests::rebinding_a_role_is_reported_without_being_breaking' (559139) panicked at crates/casm-diff/src/semantic.rs:887:17:
assertion `left == right` failed
  left: []
 right: ["store=api"]

---- semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding stdout ----

thread 'semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding' (559142) panicked at crates/casm-diff/src/semantic.rs:906:9:
assertion failed: Diff::compute(&first, &second).is_empty()

failures:
    semantic::tests::an_unchanged_claim_produces_nothing
    semantic::tests::rebinding_a_role_is_reported_without_being_breaking
    semantic::tests::reparsing_a_file_does_not_look_like_a_rebinding
    semantic::tests::the_difference_helper_partitions_correctly

test result: FAILED. 37 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
