*** crates/casm-formal/src/alloy.rs:123:5: replace module_name -> String with String::new()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace module_name -> String with String::new()
@@ -115,35 +115,17 @@
         NodeType::Human => "Human",
         NodeType::Boundary => "Boundary",
     }
 }
 
 /// Converts an architecture name into a legal Alloy module name.
 #[must_use]
 pub fn module_name(architecture_name: &str) -> String {
-    let sanitised: String = architecture_name
-        .chars()
-        .map(|character| {
-            if character.is_ascii_alphanumeric() {
-                character
-            } else {
-                '_'
-            }
-        })
-        .collect();
-
-    let trimmed = sanitised.trim_matches('_').to_owned();
-    if trimmed.is_empty() || trimmed.chars().next().is_some_and(|c| c.is_ascii_digit()) {
-        format!("architecture_{trimmed}")
-            .trim_end_matches('_')
-            .to_owned()
-    } else {
-        trimmed
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a set of identifiers as an Alloy union, or `none` when empty.
 fn union(members: &[String]) -> String {
     if members.is_empty() {
         "none".to_owned()
     } else {
         members.join(" + ")

---- alloy::tests::an_empty_architecture_produces_a_parseable_model stdout ----

thread 'alloy::tests::an_empty_architecture_produces_a_parseable_model' (564420) panicked at crates/casm-formal/src/alloy.rs:618:9:
assertion failed: output.model.contains("module empty")

---- alloy::tests::module_names_become_legal_identifiers stdout ----

thread 'alloy::tests::module_names_become_legal_identifiers' (564431) panicked at crates/casm-formal/src/alloy.rs:447:9:
assertion `left == right` failed
  left: ""
 right: "checkout"

---- alloy::tests::the_filename_matches_the_module stdout ----

thread 'alloy::tests::the_filename_matches_the_module' (564438) panicked at crates/casm-formal/src/alloy.rs:456:9:
assertion `left == right` failed
  left: ".als"
 right: "checkout.als"

failures:
    alloy::tests::an_empty_architecture_produces_a_parseable_model
    alloy::tests::module_names_become_legal_identifiers
    alloy::tests::the_filename_matches_the_module

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
