*** crates/casm-formal/src/alloy.rs:135:27: replace || with && in module_name

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace || with && in module_name
@@ -127,17 +127,17 @@
                 character
             } else {
                 '_'
             }
         })
         .collect();
 
     let trimmed = sanitised.trim_matches('_').to_owned();
-    if trimmed.is_empty() || trimmed.chars().next().is_some_and(|c| c.is_ascii_digit()) {
+    if trimmed.is_empty() && /* ~ changed by cargo-mutants ~ */ trimmed.chars().next().is_some_and(|c| c.is_ascii_digit()) {
         format!("architecture_{trimmed}")
             .trim_end_matches('_')
             .to_owned()
     } else {
         trimmed
     }
 }

---- alloy::tests::module_names_become_legal_identifiers stdout ----

thread 'alloy::tests::module_names_become_legal_identifiers' (564867) panicked at crates/casm-formal/src/alloy.rs:467:9:
assertion `left == right` failed
  left: "2fa"
 right: "architecture_2fa"

failures:
    alloy::tests::module_names_become_legal_identifiers

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
