*** crates/casm-formal/src/alloy.rs:146:5: replace union -> String with String::new()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace union -> String with String::new()
@@ -138,21 +138,17 @@
             .to_owned()
     } else {
         trimmed
     }
 }
 
 /// Renders a set of identifiers as an Alloy union, or `none` when empty.
 fn union(members: &[String]) -> String {
-    if members.is_empty() {
-        "none".to_owned()
-    } else {
-        members.join(" + ")
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Emits the Alloy model.
 #[must_use]
 pub fn emit(model: &FormalModel) -> AlloyOutput {
     let module = module_name(&model.name);
     let identifiers = identifiers(&model.node_names());
     let scope = model.nodes.len().max(1);

---- alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing stdout ----

thread 'alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing' (564929) panicked at crates/casm-formal/src/alloy.rs:549:9:
/*
 * Generated by CASIMIR from 'x' v0.1.0.
 * Source fingerprint: 3487b92f51623144
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::asynchronous_edges_land_in_notifies_not_blocks stdout ----

thread 'alloy::tests::asynchronous_edges_land_in_notifies_not_blocks' (564925) panicked at crates/casm-formal/src/alloy.rs:514:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::a_node_with_no_edges_is_pinned_to_none stdout ----

thread 'alloy::tests::a_node_with_no_edges_is_pinned_to_none' (564923) panicked at crates/casm-formal/src/alloy.rs:504:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

failures:
    alloy::tests::a_node_with_no_edges_is_pinned_to_none
    alloy::tests::asynchronous_edges_land_in_notifies_not_blocks
    alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing
    alloy::tests::the_external_and_stateful_groups_are_populated

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
