*** crates/casm-formal/src/alloy.rs:181:5: replace write_header with ()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace write_header with ()
@@ -173,61 +173,17 @@
 
 /// Writes the module header and the identifier mapping.
 fn write_header(
     out: &mut String,
     module: &str,
     model: &FormalModel,
     identifiers: &BTreeMap<String, String>,
 ) {
-    let _ = writeln!(out, "/*");
-    let _ = writeln!(
-        out,
-        " * Generated by CASIMIR from '{}' v{}.",
-        model.name, model.version
-    );
-    let _ = writeln!(out, " * Source fingerprint: {}", model.fingerprint);
-    let _ = writeln!(out, " *");
-    let _ = writeln!(
-        out,
-        " * Models the STATIC STRUCTURE of an architecture. Alloy has no"
-    );
-    let _ = writeln!(
-        out,
-        " * notion of time; failure and recovery are in the TLA+ module."
-    );
-    let _ = writeln!(out, " *");
-    let _ = writeln!(
-        out,
-        " * 'blocks' means the source cannot serve while the target is"
-    );
-    let _ = writeln!(
-        out,
-        " * unavailable. 'notifies' is asynchronous and carries no such"
-    );
-    let _ = writeln!(
-        out,
-        " * dependency -- which is what a queue between two services buys."
-    );
-    let _ = writeln!(out, " *");
-    let _ = writeln!(out, " * Regenerate with:  casm formal --format alloy");
-    let _ = writeln!(out, " */");
-    let _ = writeln!(out, "module {module}\n");
-
-    let _ = writeln!(
-        out,
-        "// Identifier mapping, for reading counterexamples back:"
-    );
-    for (identifier, original) in identifiers {
-        if identifier.trim_start_matches("N_") == original {
-            continue;
-        }
-        let _ = writeln!(out, "//   {identifier} = \"{original}\"");
-    }
-    let _ = writeln!(out);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the node signatures.
 fn write_signatures(out: &mut String, model: &FormalModel, identifiers: &BTreeMap<String, String>) {
     let _ = writeln!(out, "abstract sig Node {{");
     let _ = writeln!(
         out,
         "    blocks:   set Node,   // cannot serve while the target is down"

---- alloy::tests::an_empty_architecture_produces_a_parseable_model stdout ----

thread 'alloy::tests::an_empty_architecture_produces_a_parseable_model' (566482) panicked at crates/casm-formal/src/alloy.rs:592:9:
assertion failed: output.model.contains("module empty")

---- alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs stdout ----

thread 'alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs' (566498) panicked at crates/casm-formal/src/alloy.rs:565:9:
abstract sig Node {
    blocks:   set Node,   // cannot serve while the target is down
    notifies: set Node    // asynchronous; no availability dependency
}

sig Database, Gateway, Human, Queue, Service extends Node {}

one sig N_customer extends Human {}
one sig N_events extends Queue {}
one sig N_gateway extends Gateway {}
one sig N_orders extends Service {}

---- alloy::tests::the_filename_matches_the_module stdout ----

thread 'alloy::tests::the_filename_matches_the_module' (566497) panicked at crates/casm-formal/src/alloy.rs:431:9:
assertion failed: output.model.contains("module checkout")

failures:
    alloy::tests::an_empty_architecture_produces_a_parseable_model
    alloy::tests::the_filename_matches_the_module
    alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
