*** crates/casm-formal/src/alloy.rs:220:48: replace == with != in write_header

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace == with != in write_header
@@ -212,17 +212,17 @@
     let _ = writeln!(out, " */");
     let _ = writeln!(out, "module {module}\n");
 
     let _ = writeln!(
         out,
         "// Identifier mapping, for reading counterexamples back:"
     );
     for (identifier, original) in identifiers {
-        if identifier.trim_start_matches("N_") == original {
+        if identifier.trim_start_matches("N_") != /* ~ changed by cargo-mutants ~ */ original {
             continue;
         }
         let _ = writeln!(out, "//   {identifier} = \"{original}\"");
     }
     let _ = writeln!(out);
 }
 
 /// Writes the node signatures.

---- alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs stdout ----

thread 'alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs' (566558) panicked at crates/casm-formal/src/alloy.rs:609:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

failures:
    alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
