*** crates/casm-formal/src/alloy.rs:230:5: replace write_signatures with ()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace write_signatures with ()
@@ -222,49 +222,17 @@
         }
         let _ = writeln!(out, "//   {identifier} = \"{original}\"");
     }
     let _ = writeln!(out);
 }
 
 /// Writes the node signatures.
 fn write_signatures(out: &mut String, model: &FormalModel, identifiers: &BTreeMap<String, String>) {
-    let _ = writeln!(out, "abstract sig Node {{");
-    let _ = writeln!(
-        out,
-        "    blocks:   set Node,   // cannot serve while the target is down"
-    );
-    let _ = writeln!(
-        out,
-        "    notifies: set Node    // asynchronous; no availability dependency"
-    );
-    let _ = writeln!(out, "}}\n");
-
-    // Only the types actually present, so the model has no empty signatures to explain.
-    let mut kinds: Vec<&'static str> = model
-        .nodes
-        .iter()
-        .map(|node| signature_of(node.node_type))
-        .collect();
-    kinds.sort_unstable();
-    kinds.dedup();
-
-    if !kinds.is_empty() {
-        let _ = writeln!(out, "sig {} extends Node {{}}\n", kinds.join(", "));
-    }
-
-    for node in &model.nodes {
-        let _ = writeln!(
-            out,
-            "one sig {} extends {} {{}}",
-            identifier_of(identifiers, &node.name),
-            signature_of(node.node_type)
-        );
-    }
-    let _ = writeln!(out);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the topology as a fact.
 fn write_topology(out: &mut String, model: &FormalModel, identifiers: &BTreeMap<String, String>) {
     let _ = writeln!(out, "fact Topology {{");
 
     for node in &model.nodes {
         let identifier = identifier_of(identifiers, &node.name);

---- alloy::tests::only_the_node_types_in_use_are_declared stdout ----

thread 'alloy::tests::only_the_node_types_in_use_are_declared' (566636) panicked at crates/casm-formal/src/alloy.rs:449:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

failures:
    alloy::tests::only_the_node_types_in_use_are_declared

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
