*** crates/casm-formal/src/alloy.rs:250:8: delete ! in write_signatures

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ delete ! in write_signatures
@@ -242,17 +242,17 @@
     let mut kinds: Vec<&'static str> = model
         .nodes
         .iter()
         .map(|node| signature_of(node.node_type))
         .collect();
     kinds.sort_unstable();
     kinds.dedup();
 
-    if !kinds.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */kinds.is_empty() {
         let _ = writeln!(out, "sig {} extends Node {{}}\n", kinds.join(", "));
     }
 
     for node in &model.nodes {
         let _ = writeln!(
             out,
             "one sig {} extends {} {{}}",
             identifier_of(identifiers, &node.name),

*** result: Success
