*** crates/casm-formal/src/alloy.rs:267:5: replace write_topology with ()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace write_topology with ()
@@ -259,39 +259,17 @@
             signature_of(node.node_type)
         );
     }
     let _ = writeln!(out);
 }
 
 /// Writes the topology as a fact.
 fn write_topology(out: &mut String, model: &FormalModel, identifiers: &BTreeMap<String, String>) {
-    let _ = writeln!(out, "fact Topology {{");
-
-    for node in &model.nodes {
-        let identifier = identifier_of(identifiers, &node.name);
-
-        let blocks: Vec<String> = model
-            .blocking
-            .iter()
-            .filter(|edge| edge.source == node.name)
-            .map(|edge| identifier_of(identifiers, &edge.target))
-            .collect();
-        let notifies: Vec<String> = model
-            .asynchronous
-            .iter()
-            .filter(|edge| edge.source == node.name)
-            .map(|edge| identifier_of(identifiers, &edge.target))
-            .collect();
-
-        let _ = writeln!(out, "    {identifier}.blocks = {}", union(&blocks));
-        let _ = writeln!(out, "    {identifier}.notifies = {}", union(&notifies));
-    }
-
-    let _ = writeln!(out, "}}\n");
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the named groups the assertions quantify over.
 fn write_groups(out: &mut String, model: &FormalModel, identifiers: &BTreeMap<String, String>) {
     let external: Vec<String> = model
         .external_names()
         .iter()
         .map(|name| identifier_of(identifiers, name))

---- alloy::tests::a_node_with_no_edges_is_pinned_to_none stdout ----

thread 'alloy::tests::a_node_with_no_edges_is_pinned_to_none' (568055) panicked at crates/casm-formal/src/alloy.rs:486:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::asynchronous_edges_land_in_notifies_not_blocks stdout ----

thread 'alloy::tests::asynchronous_edges_land_in_notifies_not_blocks' (568057) panicked at crates/casm-formal/src/alloy.rs:496:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::every_node_declares_both_relations stdout ----

thread 'alloy::tests::every_node_declares_both_relations' (568062) panicked at crates/casm-formal/src/alloy.rs:472:13:
N_customer has no blocks constraint

failures:
    alloy::tests::a_node_with_no_edges_is_pinned_to_none
    alloy::tests::asynchronous_edges_land_in_notifies_not_blocks
    alloy::tests::every_node_declares_both_relations

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
