*** crates/casm-formal/src/alloy.rs:294:5: replace write_groups with ()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace write_groups with ()
@@ -286,33 +286,17 @@
         let _ = writeln!(out, "    {identifier}.notifies = {}", union(&notifies));
     }
 
     let _ = writeln!(out, "}}\n");
 }
 
 /// Writes the named groups the assertions quantify over.
 fn write_groups(out: &mut String, model: &FormalModel, identifiers: &BTreeMap<String, String>) {
-    let external: Vec<String> = model
-        .external_names()
-        .iter()
-        .map(|name| identifier_of(identifiers, name))
-        .collect();
-    let stateful: Vec<String> = model
-        .nodes
-        .iter()
-        .filter(|node| node.stateful)
-        .map(|node| identifier_of(identifiers, &node.name))
-        .collect();
-
-    let _ = writeln!(out, "// Nodes outside the control boundary.");
-    let _ = writeln!(out, "fun External: set Node {{ {} }}\n", union(&external));
-
-    let _ = writeln!(out, "// Nodes holding state that survives a restart.");
-    let _ = writeln!(out, "fun Stateful: set Node {{ {} }}\n", union(&stateful));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the assertions and their checks.
 fn write_assertions(out: &mut String, model: &FormalModel, scope: usize) {
     let _ = writeln!(
         out,
         "// No node depends on itself, however indirectly. Restates the"
     );

---- alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing stdout ----

thread 'alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing' (568400) panicked at crates/casm-formal/src/alloy.rs:537:9:
/*
 * Generated by CASIMIR from 'x' v0.1.0.
 * Source fingerprint: 3487b92f51623144
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::the_external_and_stateful_groups_are_populated stdout ----

thread 'alloy::tests::the_external_and_stateful_groups_are_populated' (568410) panicked at crates/casm-formal/src/alloy.rs:517:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

failures:
    alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing
    alloy::tests::the_external_and_stateful_groups_are_populated

test result: FAILED. 45 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
