*** crates/casm-formal/src/alloy.rs:315:5: replace write_assertions with ()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace write_assertions with ()
@@ -307,71 +307,17 @@
     let _ = writeln!(out, "fun External: set Node {{ {} }}\n", union(&external));
 
     let _ = writeln!(out, "// Nodes holding state that survives a restart.");
     let _ = writeln!(out, "fun Stateful: set Node {{ {} }}\n", union(&stateful));
 }
 
 /// Writes the assertions and their checks.
 fn write_assertions(out: &mut String, model: &FormalModel, scope: usize) {
-    let _ = writeln!(
-        out,
-        "// No node depends on itself, however indirectly. Restates the"
-    );
-    let _ = writeln!(
-        out,
-        "// 'no-dependency-cycles' rule; a counterexample names the ring."
-    );
-    let _ = writeln!(out, "assert NoBlockingCycles {{");
-    let _ = writeln!(out, "    no n: Node | n in n.^blocks");
-    let _ = writeln!(out, "}}");
-    let _ = writeln!(out, "check NoBlockingCycles for {scope}\n");
-
-    let _ = writeln!(
-        out,
-        "// Nothing outside the control boundary reaches a datastore"
-    );
-    let _ = writeln!(
-        out,
-        "// directly. Restates 'no-publicly-exposed-datastores'."
-    );
-    let _ = writeln!(out, "assert NoDirectExternalAccessToState {{");
-    let _ = writeln!(out, "    no e: External, d: Stateful | d in e.blocks");
-    let _ = writeln!(out, "}}");
-    let _ = writeln!(out, "check NoDirectExternalAccessToState for {scope}\n");
-
-    // Meaningless for a single node, which is a legitimate starting point.
-    if model.nodes.len() > 1 {
-        let _ = writeln!(
-            out,
-            "// Every node participates in the architecture somehow."
-        );
-        let _ = writeln!(out, "// Restates 'no-isolated-nodes'.");
-        let _ = writeln!(out, "assert NoIsolatedNodes {{");
-        let _ = writeln!(out, "    all n: Node |");
-        let _ = writeln!(
-            out,
-            "        some n.blocks + blocks.n + n.notifies + notifies.n"
-        );
-        let _ = writeln!(out, "}}");
-        let _ = writeln!(out, "check NoIsolatedNodes for {scope}\n");
-    }
-
-    let _ = writeln!(
-        out,
-        "// A node behind an asynchronous boundary cannot be reached by"
-    );
-    let _ = writeln!(
-        out,
-        "// following blocking edges. This is the property a queue is FOR."
-    );
-    let _ = writeln!(out, "assert AsyncBoundariesHold {{");
-    let _ = writeln!(out, "    all n: Node | no (n.notifies & n.^blocks)");
-    let _ = writeln!(out, "}}");
-    let _ = writeln!(out, "check AsyncBoundariesHold for {scope}");
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- alloy::tests::an_empty_architecture_produces_a_parseable_model stdout ----

thread 'alloy::tests::an_empty_architecture_produces_a_parseable_model' (569130) panicked at crates/casm-formal/src/alloy.rs:583:9:
scope must not be 0

---- alloy::tests::the_check_scope_covers_every_node stdout ----

thread 'alloy::tests::the_check_scope_covers_every_node' (569152) panicked at crates/casm-formal/src/alloy.rs:516:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::the_isolated_nodes_assertion_is_omitted_for_a_single_node stdout ----

thread 'alloy::tests::the_isolated_nodes_assertion_is_omitted_for_a_single_node' (569165) panicked at crates/casm-formal/src/alloy.rs:532:9:
assertion failed: output.model.contains("check NoBlockingCycles for 1")

failures:
    alloy::tests::an_empty_architecture_produces_a_parseable_model
    alloy::tests::the_check_scope_covers_every_node
    alloy::tests::the_isolated_nodes_assertion_is_omitted_for_a_single_node

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
