*** crates/casm-formal/src/alloy.rs:52:9: replace AlloyOutput::filename -> String with String::new()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace AlloyOutput::filename -> String with String::new()
@@ -44,17 +44,17 @@
     /// Identifier to original node name, for reading counterexamples back.
     pub identifiers: BTreeMap<String, String>,
 }
 
 impl AlloyOutput {
     /// The filename the model must be written to.
     #[must_use]
     pub fn filename(&self) -> String {
-        format!("{}.als", self.module)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Assigns each node a collision-free Alloy identifier.
 ///
 /// Deterministic: the same model always yields the same mapping, because nodes arrive
 /// sorted and collisions are numbered in that order.
 #[must_use]

---- alloy::tests::the_filename_matches_the_module stdout ----

thread 'alloy::tests::the_filename_matches_the_module' (559880) panicked at crates/casm-formal/src/alloy.rs:474:9:
assertion `left == right` failed
  left: ""
 right: "checkout.als"

failures:
    alloy::tests::the_filename_matches_the_module

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
