*** crates/casm-formal/src/alloy.rs:62:5: replace identifiers -> BTreeMap<String, String> with BTreeMap::from_iter([(String::new(), String::new())])

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace identifiers -> BTreeMap<String, String> with BTreeMap::from_iter([(String::new(), String::new())])
@@ -54,45 +54,17 @@
 }
 
 /// Assigns each node a collision-free Alloy identifier.
 ///
 /// Deterministic: the same model always yields the same mapping, because nodes arrive
 /// sorted and collisions are numbered in that order.
 #[must_use]
 pub fn identifiers(names: &[&str]) -> BTreeMap<String, String> {
-    let mut assigned: BTreeMap<String, String> = BTreeMap::new();
-    let mut taken: Vec<String> = Vec::new();
-
-    for name in names {
-        let sanitised: String = name
-            .chars()
-            .map(|character| {
-                if character.is_ascii_alphanumeric() {
-                    character
-                } else {
-                    '_'
-                }
-            })
-            .collect();
-
-        let base = format!("N_{sanitised}");
-        let mut candidate = base.clone();
-        let mut suffix = 2_u32;
-
-        while taken.contains(&candidate) {
-            candidate = format!("{base}_{suffix}");
-            suffix = suffix.saturating_add(1);
-        }
-
-        taken.push(candidate.clone());
-        assigned.insert(candidate, (*name).to_owned());
-    }
-
-    assigned
+    BTreeMap::from_iter([(String::new(), String::new())]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Looks up the identifier assigned to `name`.
 fn identifier_of(identifiers: &BTreeMap<String, String>, name: &str) -> String {
     identifiers
         .iter()
         .find(|(_, original)| original.as_str() == name)
         .map_or_else(

---- alloy::tests::a_node_with_no_edges_is_pinned_to_none stdout ----

thread 'alloy::tests::a_node_with_no_edges_is_pinned_to_none' (560845) panicked at crates/casm-formal/src/alloy.rs:480:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::asynchronous_edges_land_in_notifies_not_blocks stdout ----

thread 'alloy::tests::asynchronous_edges_land_in_notifies_not_blocks' (560847) panicked at crates/casm-formal/src/alloy.rs:490:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::colliding_names_are_disambiguated_deterministically stdout ----

thread 'alloy::tests::colliding_names_are_disambiguated_deterministically' (560863) panicked at crates/casm-formal/src/alloy.rs:415:9:
assertion `left == right` failed: one identifier was lost: {"": ""}
  left: 1
 right: 3

failures:
    alloy::tests::a_node_with_no_edges_is_pinned_to_none
    alloy::tests::asynchronous_edges_land_in_notifies_not_blocks
    alloy::tests::colliding_names_are_disambiguated_deterministically
    alloy::tests::every_node_gets_exactly_one_identifier
    alloy::tests::identifiers_are_prefixed_and_sanitised
    alloy::tests::the_external_and_stateful_groups_are_populated
    alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs
    alloy::tests::the_prefix_makes_a_keyword_collision_impossible

test result: FAILED. 39 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
