*** crates/casm-formal/src/alloy.rs:62:5: replace identifiers -> BTreeMap<String, String> with BTreeMap::from_iter([("xyzzy".into(), String::new())])

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace identifiers -> BTreeMap<String, String> with BTreeMap::from_iter([("xyzzy".into(), String::new())])
@@ -54,45 +54,17 @@
 }
 
 /// Assigns each node a collision-free Alloy identifier.
 ///
 /// Deterministic: the same model always yields the same mapping, because nodes arrive
 /// sorted and collisions are numbered in that order.
 #[must_use]
 pub fn identifiers(names: &[&str]) -> BTreeMap<String, String> {
-    let mut assigned: BTreeMap<String, String> = BTreeMap::new();
-    let mut taken: Vec<String> = Vec::new();
-
-    for name in names {
-        let sanitised: String = name
-            .chars()
-            .map(|character| {
-                if character.is_ascii_alphanumeric() {
-                    character
-                } else {
-                    '_'
-                }
-            })
-            .collect();
-
-        let base = format!("N_{sanitised}");
-        let mut candidate = base.clone();
-        let mut suffix = 2_u32;
-
-        while taken.contains(&candidate) {
-            candidate = format!("{base}_{suffix}");
-            suffix = suffix.saturating_add(1);
-        }
-
-        taken.push(candidate.clone());
-        assigned.insert(candidate, (*name).to_owned());
-    }
-
-    assigned
+    BTreeMap::from_iter([("xyzzy".into(), String::new())]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Looks up the identifier assigned to `name`.
 fn identifier_of(identifiers: &BTreeMap<String, String>, name: &str) -> String {
     identifiers
         .iter()
         .find(|(_, original)| original.as_str() == name)
         .map_or_else(

---- alloy::tests::colliding_names_are_disambiguated_deterministically stdout ----

thread 'alloy::tests::colliding_names_are_disambiguated_deterministically' (561342) panicked at crates/casm-formal/src/alloy.rs:415:9:
assertion `left == right` failed: one identifier was lost: {"xyzzy": ""}
  left: 1
 right: 3

---- alloy::tests::every_node_gets_exactly_one_identifier stdout ----

thread 'alloy::tests::every_node_gets_exactly_one_identifier' (561346) panicked at crates/casm-formal/src/alloy.rs:432:9:
assertion `left == right` failed
  left: 1
 right: 6

---- alloy::tests::identifiers_are_prefixed_and_sanitised stdout ----

thread 'alloy::tests::identifiers_are_prefixed_and_sanitised' (561352) panicked at crates/casm-formal/src/alloy.rs:393:9:
{"xyzzy": ""}

failures:
    alloy::tests::a_node_with_no_edges_is_pinned_to_none
    alloy::tests::asynchronous_edges_land_in_notifies_not_blocks
    alloy::tests::colliding_names_are_disambiguated_deterministically
    alloy::tests::every_node_declares_both_relations
    alloy::tests::every_node_gets_exactly_one_identifier
    alloy::tests::identifiers_are_prefixed_and_sanitised
    alloy::tests::the_external_and_stateful_groups_are_populated
    alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs
    alloy::tests::the_prefix_makes_a_keyword_collision_impossible

test result: FAILED. 38 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
