*** crates/casm-formal/src/alloy.rs:95:5: replace identifier_of -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace identifier_of -> String with "xyzzy".into()
@@ -87,23 +87,17 @@
         assigned.insert(candidate, (*name).to_owned());
     }
 
     assigned
 }
 
 /// Looks up the identifier assigned to `name`.
 fn identifier_of(identifiers: &BTreeMap<String, String>, name: &str) -> String {
-    identifiers
-        .iter()
-        .find(|(_, original)| original.as_str() == name)
-        .map_or_else(
-            || "N_unknown".to_owned(),
-            |(identifier, _)| identifier.clone(),
-        )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The Alloy signature name for a node type.
 const fn signature_of(node_type: NodeType) -> &'static str {
     match node_type {
         NodeType::Service => "Service",
         NodeType::Database => "Database",
         NodeType::Queue => "Queue",

---- alloy::tests::asynchronous_edges_land_in_notifies_not_blocks stdout ----

thread 'alloy::tests::asynchronous_edges_land_in_notifies_not_blocks' (563154) panicked at crates/casm-formal/src/alloy.rs:512:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::every_node_declares_both_relations stdout ----

thread 'alloy::tests::every_node_declares_both_relations' (563159) panicked at crates/casm-formal/src/alloy.rs:488:13:
N_customer has no blocks constraint

---- alloy::tests::a_node_with_no_edges_is_pinned_to_none stdout ----

thread 'alloy::tests::a_node_with_no_edges_is_pinned_to_none' (563152) panicked at crates/casm-formal/src/alloy.rs:502:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

failures:
    alloy::tests::a_node_with_no_edges_is_pinned_to_none
    alloy::tests::asynchronous_edges_land_in_notifies_not_blocks
    alloy::tests::every_node_declares_both_relations
    alloy::tests::the_external_and_stateful_groups_are_populated

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
