*** crates/casm-formal/src/alloy.rs:97:49: replace == with != in identifier_of

*** mutation diff:
--- crates/casm-formal/src/alloy.rs
+++ replace == with != in identifier_of
@@ -89,17 +89,17 @@
 
     assigned
 }
 
 /// Looks up the identifier assigned to `name`.
 fn identifier_of(identifiers: &BTreeMap<String, String>, name: &str) -> String {
     identifiers
         .iter()
-        .find(|(_, original)| original.as_str() == name)
+        .find(|(_, original)| original.as_str() != /* ~ changed by cargo-mutants ~ */ name)
         .map_or_else(
             || "N_unknown".to_owned(),
             |(identifier, _)| identifier.clone(),
         )
 }
 
 /// The Alloy signature name for a node type.
 const fn signature_of(node_type: NodeType) -> &'static str {

---- alloy::tests::every_node_declares_both_relations stdout ----

thread 'alloy::tests::every_node_declares_both_relations' (563213) panicked at crates/casm-formal/src/alloy.rs:494:13:
N_gateway has no blocks constraint

---- alloy::tests::asynchronous_edges_land_in_notifies_not_blocks stdout ----

thread 'alloy::tests::asynchronous_edges_land_in_notifies_not_blocks' (563208) panicked at crates/casm-formal/src/alloy.rs:518:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::the_external_and_stateful_groups_are_populated stdout ----

thread 'alloy::tests::the_external_and_stateful_groups_are_populated' (563220) panicked at crates/casm-formal/src/alloy.rs:533:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

failures:
    alloy::tests::a_node_with_no_edges_is_pinned_to_none
    alloy::tests::asynchronous_edges_land_in_notifies_not_blocks
    alloy::tests::every_node_declares_both_relations
    alloy::tests::the_external_and_stateful_groups_are_populated

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
