*** crates/casm-formal/src/model.rs:124:9: replace FormalModel::node_names -> Vec<&str> with vec![""]

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace FormalModel::node_names -> Vec<&str> with vec![""]
@@ -116,17 +116,17 @@
             asynchronous,
             closure,
         }
     }
 
     /// The names of every node, sorted.
     #[must_use]
     pub fn node_names(&self) -> Vec<&str> {
-        self.nodes.iter().map(|node| node.name.as_str()).collect()
+        vec![""] /* ~ changed by cargo-mutants ~ */
     }
 
     /// The names of nodes outside the control boundary, sorted.
     #[must_use]
     pub fn external_names(&self) -> Vec<&str> {
         self.nodes
             .iter()
             .filter(|node| node.external)

---- alloy::tests::asynchronous_edges_land_in_notifies_not_blocks stdout ----

thread 'alloy::tests::asynchronous_edges_land_in_notifies_not_blocks' (571042) panicked at crates/casm-formal/src/alloy.rs:518:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::a_node_with_no_edges_is_pinned_to_none stdout ----

thread 'alloy::tests::a_node_with_no_edges_is_pinned_to_none' (571040) panicked at crates/casm-formal/src/alloy.rs:508:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::every_node_declares_both_relations stdout ----

thread 'alloy::tests::every_node_declares_both_relations' (571047) panicked at crates/casm-formal/src/alloy.rs:494:13:
N_ has no blocks constraint

failures:
    alloy::tests::a_node_with_no_edges_is_pinned_to_none
    alloy::tests::asynchronous_edges_land_in_notifies_not_blocks
    alloy::tests::every_node_declares_both_relations
    alloy::tests::the_external_and_stateful_groups_are_populated
    alloy::tests::the_identifier_mapping_is_emitted_only_where_it_differs
    tla::tests::an_empty_architecture_still_produces_a_wellformed_module

test result: FAILED. 41 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
