*** crates/casm-formal/src/model.rs:130:9: replace FormalModel::external_names -> Vec<&str> with vec!["xyzzy"]

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace FormalModel::external_names -> Vec<&str> with vec!["xyzzy"]
@@ -122,21 +122,17 @@
     #[must_use]
     pub fn node_names(&self) -> Vec<&str> {
         self.nodes.iter().map(|node| node.name.as_str()).collect()
     }
 
     /// The names of nodes outside the control boundary, sorted.
     #[must_use]
     pub fn external_names(&self) -> Vec<&str> {
-        self.nodes
-            .iter()
-            .filter(|node| node.external)
-            .map(|node| node.name.as_str())
-            .collect()
+        vec!["xyzzy"] /* ~ changed by cargo-mutants ~ */
     }
 
     /// The nodes nothing blocks on — failing one cannot make anything else unavailable.
     #[must_use]
     pub fn independent_names(&self) -> Vec<&str> {
         self.nodes
             .iter()
             .filter(|node| !self.closure.iter().any(|(_, target)| target == &node.name))

---- alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing stdout ----

thread 'alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing' (572541) panicked at crates/casm-formal/src/alloy.rs:553:9:
/*
 * Generated by CASIMIR from 'x' v0.1.0.
 * Source fingerprint: 3487b92f51623144
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- alloy::tests::the_external_and_stateful_groups_are_populated stdout ----

thread 'alloy::tests::the_external_and_stateful_groups_are_populated' (572550) panicked at crates/casm-formal/src/alloy.rs:533:9:
/*
 * Generated by CASIMIR from 'checkout' v1.0.0.
 * Source fingerprint: 62a2af8b556ee4e4
 *
 * Models the STATIC STRUCTURE of an architecture. Alloy has no
 * notion of time; failure and recovery are in the TLA+ module.
 *
 * 'blocks' means the source cannot serve while the target is
 * unavailable. 'notifies' is asynchronous and carries no such
 * dependency -- which is what a queue between two services buys.
 *

---- model::tests::external_nodes_are_identified stdout ----

thread 'model::tests::external_nodes_are_identified' (572563) panicked at crates/casm-formal/src/model.rs:348:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["partner"]

failures:
    alloy::tests::empty_groups_are_rendered_as_none_not_as_nothing
    alloy::tests::the_external_and_stateful_groups_are_populated
    model::tests::external_nodes_are_identified

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
