*** crates/casm-formal/src/model.rs:140:9: replace FormalModel::independent_names -> Vec<&str> with vec![""]

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace FormalModel::independent_names -> Vec<&str> with vec![""]
@@ -132,21 +132,17 @@
             .filter(|node| node.external)
             .map(|node| node.name.as_str())
             .collect()
     }
 
     /// The nodes nothing blocks on — failing one cannot make anything else unavailable.
     #[must_use]
     pub fn independent_names(&self) -> Vec<&str> {
-        self.nodes
-            .iter()
-            .filter(|node| !self.closure.iter().any(|(_, target)| target == &node.name))
-            .map(|node| node.name.as_str())
-            .collect()
+        vec![""] /* ~ changed by cargo-mutants ~ */
     }
 
     /// The largest number of nodes any single failure can make unavailable.
     ///
     /// The generated specs use this to seed a blast-radius bound that already holds, so
     /// the assertion documents the architecture rather than failing on first run.
     #[must_use]
     pub fn blast_radius(&self) -> usize {

---- model::tests::independent_nodes_are_those_nothing_blocks_on stdout ----

thread 'model::tests::independent_nodes_are_those_nothing_blocks_on' (572636) panicked at crates/casm-formal/src/model.rs:335:9:
[""]

failures:
    model::tests::independent_nodes_are_those_nothing_blocks_on

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
