*** crates/casm-formal/src/model.rs:142:74: replace == with != in FormalModel::independent_names

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace == with != in FormalModel::independent_names
@@ -134,17 +134,17 @@
             .collect()
     }
 
     /// The nodes nothing blocks on — failing one cannot make anything else unavailable.
     #[must_use]
     pub fn independent_names(&self) -> Vec<&str> {
         self.nodes
             .iter()
-            .filter(|node| !self.closure.iter().any(|(_, target)| target == &node.name))
+            .filter(|node| !self.closure.iter().any(|(_, target)| target != /* ~ changed by cargo-mutants ~ */ &node.name))
             .map(|node| node.name.as_str())
             .collect()
     }
 
     /// The largest number of nodes any single failure can make unavailable.
     ///
     /// The generated specs use this to seed a blast-radius bound that already holds, so
     /// the assertion documents the architecture rather than failing on first run.

---- model::tests::independent_nodes_are_those_nothing_blocks_on stdout ----

thread 'model::tests::independent_nodes_are_those_nothing_blocks_on' (574350) panicked at crates/casm-formal/src/model.rs:339:9:
[]

failures:
    model::tests::independent_nodes_are_those_nothing_blocks_on

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
