*** crates/casm-formal/src/model.rs:153:9: replace FormalModel::blast_radius -> usize with 1

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace FormalModel::blast_radius -> usize with 1
@@ -145,26 +145,17 @@
     }
 
     /// The largest number of nodes any single failure can make unavailable.
     ///
     /// The generated specs use this to seed a blast-radius bound that already holds, so
     /// the assertion documents the architecture rather than failing on first run.
     #[must_use]
     pub fn blast_radius(&self) -> usize {
-        self.nodes
-            .iter()
-            .map(|node| {
-                self.closure
-                    .iter()
-                    .filter(|(_, target)| target == &node.name)
-                    .count()
-            })
-            .max()
-            .unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if any node blocks on itself, however indirectly.
     ///
     /// Always `false` for an architecture that passed `casm validate`; the generated
     /// assertions restate it so a checker confirms it independently.
     #[must_use]
     pub fn has_cycle(&self) -> bool {

---- model::tests::an_empty_architecture_produces_an_empty_model stdout ----

thread 'model::tests::an_empty_architecture_produces_an_empty_model' (574546) panicked at crates/casm-formal/src/model.rs:405:9:
assertion `left == right` failed
  left: 1
 right: 0

---- model::tests::the_blast_radius_counts_transitive_dependents stdout ----

thread 'model::tests::the_blast_radius_counts_transitive_dependents' (574551) panicked at crates/casm-formal/src/model.rs:322:9:
assertion `left == right` failed
  left: 1
 right: 2

---- tla::tests::the_blast_radius_bound_is_seeded_so_it_holds stdout ----

thread 'tla::tests::the_blast_radius_bound_is_seeded_so_it_holds' (574566) panicked at crates/casm-formal/src/tla.rs:619:9:
\* Generated by CASIMIR -- safety properties.
\* Run with: tlc <Module>.tla
SPECIFICATION Spec

CONSTANT MaxBlastRadius = 1
CONSTANT MaxConcurrentFailures = 2

INVARIANT TypeOK
INVARIANT NoBlockingCycles
INVARIANT BlastRadiusWithinLimit
INVARIANT AsyncIsolation

failures:
    model::tests::an_empty_architecture_produces_an_empty_model
    model::tests::the_blast_radius_counts_transitive_dependents
    tla::tests::the_blast_radius_bound_is_seeded_so_it_holds

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
