*** crates/casm-formal/src/model.rs:171:9: replace FormalModel::has_cycle -> bool with false

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace FormalModel::has_cycle -> bool with false
@@ -163,17 +163,17 @@
     }
 
     /// Returns `true` if any node blocks on itself, however indirectly.
     ///
     /// Always `false` for an architecture that passed `casm validate`; the generated
     /// assertions restate it so a checker confirms it independently.
     #[must_use]
     pub fn has_cycle(&self) -> bool {
-        self.closure.iter().any(|(source, target)| source == target)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the model has nothing to check.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.nodes.is_empty()
     }
 }

---- model::tests::a_cycle_is_detected_without_the_walk_hanging stdout ----

thread 'model::tests::a_cycle_is_detected_without_the_walk_hanging' (575890) panicked at crates/casm-formal/src/model.rs:318:9:
assertion failed: model.has_cycle()

failures:
    model::tests::a_cycle_is_detected_without_the_walk_hanging

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
