*** crates/casm-formal/src/model.rs:171:9: replace FormalModel::has_cycle -> bool with true

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace FormalModel::has_cycle -> bool with true
@@ -163,17 +163,17 @@
     }
 
     /// Returns `true` if any node blocks on itself, however indirectly.
     ///
     /// Always `false` for an architecture that passed `casm validate`; the generated
     /// assertions restate it so a checker confirms it independently.
     #[must_use]
     pub fn has_cycle(&self) -> bool {
-        self.closure.iter().any(|(source, target)| source == target)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the model has nothing to check.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.nodes.is_empty()
     }
 }

---- model::tests::an_acyclic_architecture_has_no_cycle stdout ----

thread 'model::tests::an_acyclic_architecture_has_no_cycle' (575959) panicked at crates/casm-formal/src/model.rs:324:9:
assertion failed: !FormalModel::of(&parse(CHAIN)).has_cycle()

---- model::tests::an_empty_architecture_produces_an_empty_model stdout ----

thread 'model::tests::an_empty_architecture_produces_an_empty_model' (575962) panicked at crates/casm-formal/src/model.rs:415:9:
assertion failed: !model.has_cycle()

failures:
    model::tests::an_acyclic_architecture_has_no_cycle
    model::tests::an_empty_architecture_produces_an_empty_model

test result: FAILED. 45 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
