*** crates/casm-formal/src/model.rs:200:5: replace transitive_closure -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ replace transitive_closure -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]
@@ -192,42 +192,17 @@
 
 /// Computes the transitive closure of a set of edges.
 ///
 /// A breadth-first walk from each node. Bounded by construction: the frontier only ever
 /// contains nodes not already seen, so the work is `O(V·E)` and cannot loop even when the
 /// input contains a cycle — which matters, because detecting one is a thing the caller
 /// wants to ask about afterwards.
 fn transitive_closure(edges: &[ModelEdge]) -> Vec<(String, String)> {
-    let mut adjacency: BTreeMap<&str, Vec<&str>> = BTreeMap::new();
-    for edge in edges {
-        adjacency
-            .entry(edge.source.as_str())
-            .or_default()
-            .push(edge.target.as_str());
-    }
-
-    let mut closure: BTreeSet<(String, String)> = BTreeSet::new();
-
-    for start in adjacency.keys().copied() {
-        let mut seen: BTreeSet<&str> = BTreeSet::new();
-        let mut frontier: Vec<&str> = adjacency.get(start).cloned().unwrap_or_default();
-
-        while let Some(current) = frontier.pop() {
-            if !seen.insert(current) {
-                continue;
-            }
-            closure.insert((start.to_owned(), current.to_owned()));
-            if let Some(next) = adjacency.get(current) {
-                frontier.extend(next.iter().copied());
-            }
-        }
-    }
-
-    closure.into_iter().collect()
+    vec![("xyzzy".into(), "xyzzy".into())] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- model::tests::an_empty_architecture_produces_an_empty_model stdout ----

thread 'model::tests::an_empty_architecture_produces_an_empty_model' (578817) panicked at crates/casm-formal/src/model.rs:388:9:
assertion failed: model.closure.is_empty()

---- model::tests::a_cycle_is_detected_without_the_walk_hanging stdout ----

thread 'model::tests::a_cycle_is_detected_without_the_walk_hanging' (578814) panicked at crates/casm-formal/src/model.rs:294:9:
assertion failed: model.closure.contains(&("a".to_owned(), "a".to_owned()))

---- model::tests::a_diamond_does_not_duplicate_closure_entries stdout ----

thread 'model::tests::a_diamond_does_not_duplicate_closure_entries' (578815) panicked at crates/casm-formal/src/model.rs:426:9:
assertion `left == right` failed: two paths, one closure entry
  left: 0
 right: 1

failures:
    model::tests::a_cycle_is_detected_without_the_walk_hanging
    model::tests::a_diamond_does_not_duplicate_closure_entries
    model::tests::an_acyclic_architecture_has_no_cycle
    model::tests::an_empty_architecture_produces_an_empty_model
    model::tests::independent_nodes_are_those_nothing_blocks_on
    model::tests::the_blast_radius_counts_transitive_dependents
    model::tests::the_closure_reaches_through_the_chain
    tla::tests::asynchronous_edges_are_absent_from_the_closure
    tla::tests::the_blast_radius_bound_is_seeded_so_it_holds

test result: FAILED. 38 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
