*** crates/casm-formal/src/model.rs:215:16: delete ! in transitive_closure

*** mutation diff:
--- crates/casm-formal/src/model.rs
+++ delete ! in transitive_closure
@@ -207,17 +207,17 @@
 
     let mut closure: BTreeSet<(String, String)> = BTreeSet::new();
 
     for start in adjacency.keys().copied() {
         let mut seen: BTreeSet<&str> = BTreeSet::new();
         let mut frontier: Vec<&str> = adjacency.get(start).cloned().unwrap_or_default();
 
         while let Some(current) = frontier.pop() {
-            if !seen.insert(current) {
+            if  /* ~ changed by cargo-mutants ~ */seen.insert(current) {
                 continue;
             }
             closure.insert((start.to_owned(), current.to_owned()));
             if let Some(next) = adjacency.get(current) {
                 frontier.extend(next.iter().copied());
             }
         }
     }

---- model::tests::a_diamond_does_not_duplicate_closure_entries stdout ----

thread 'model::tests::a_diamond_does_not_duplicate_closure_entries' (578962) panicked at crates/casm-formal/src/model.rs:451:9:
assertion `left == right` failed: two paths, one closure entry
  left: 0
 right: 1

---- model::tests::a_cycle_is_detected_without_the_walk_hanging stdout ----

thread 'model::tests::a_cycle_is_detected_without_the_walk_hanging' (578961) panicked at crates/casm-formal/src/model.rs:318:9:
assertion failed: model.has_cycle()

---- model::tests::independent_nodes_are_those_nothing_blocks_on stdout ----

thread 'model::tests::independent_nodes_are_those_nothing_blocks_on' (578967) panicked at crates/casm-formal/src/model.rs:344:9:
["events", "gateway", "orders", "orders-db"]

failures:
    model::tests::a_cycle_is_detected_without_the_walk_hanging
    model::tests::a_diamond_does_not_duplicate_closure_entries
    model::tests::independent_nodes_are_those_nothing_blocks_on
    model::tests::the_blast_radius_counts_transitive_dependents
    model::tests::the_closure_reaches_through_the_chain
    tla::tests::asynchronous_edges_are_absent_from_the_closure
    tla::tests::the_blast_radius_bound_is_seeded_so_it_holds

test result: FAILED. 40 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
