*** crates/casm-formal/src/tla.rs:105:5: replace string_set -> String with String::new()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace string_set -> String with String::new()
@@ -97,21 +97,17 @@
         "Architecture".to_owned()
     } else {
         out
     }
 }
 
 /// Renders a set of strings as a TLA+ set literal.
 fn string_set(values: &[&str]) -> String {
-    if values.is_empty() {
-        return "{}".to_owned();
-    }
-    let rendered: Vec<String> = values.iter().map(|value| format!("\"{value}\"")).collect();
-    format!("{{ {} }}", rendered.join(", "))
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a set of pairs as a TLA+ set of tuples.
 fn pair_set(pairs: &[(String, String)]) -> String {
     if pairs.is_empty() {
         return "{}".to_owned();
     }

---- tla::tests::an_empty_architecture_still_produces_a_wellformed_module stdout ----

thread 'tla::tests::an_empty_architecture_still_produces_a_wellformed_module' (582323) panicked at crates/casm-formal/src/tla.rs:674:9:
assertion failed: output.specification.contains("Nodes == {}")

---- tla::tests::set_literals_use_tla_syntax stdout ----

thread 'tla::tests::set_literals_use_tla_syntax' (582331) panicked at crates/casm-formal/src/tla.rs:693:9:
assertion `left == right` failed
  left: ""
 right: "{}"

failures:
    tla::tests::an_empty_architecture_still_produces_a_wellformed_module
    tla::tests::set_literals_use_tla_syntax

test result: FAILED. 45 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
