*** crates/casm-formal/src/tla.rs:114:5: replace pair_set -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace pair_set -> String with "xyzzy".into()
@@ -106,27 +106,17 @@
         return "{}".to_owned();
     }
     let rendered: Vec<String> = values.iter().map(|value| format!("\"{value}\"")).collect();
     format!("{{ {} }}", rendered.join(", "))
 }
 
 /// Renders a set of pairs as a TLA+ set of tuples.
 fn pair_set(pairs: &[(String, String)]) -> String {
-    if pairs.is_empty() {
-        return "{}".to_owned();
-    }
-
-    let mut out = String::from("{\n");
-    for (index, (source, target)) in pairs.iter().enumerate() {
-        let separator = if index + 1 == pairs.len() { "" } else { "," };
-        let _ = writeln!(out, "        <<\"{source}\", \"{target}\">>{separator}");
-    }
-    out.push_str("    }");
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Emits the TLA+ module and its TLC configuration.
 #[must_use]
 pub fn emit(model: &FormalModel) -> TlaOutput {
     let module = module_name(&model.name);
 
     let blocking_pairs: Vec<(String, String)> = model

---- tla::tests::an_empty_architecture_still_produces_a_wellformed_module stdout ----

thread 'tla::tests::an_empty_architecture_still_produces_a_wellformed_module' (583718) panicked at crates/casm-formal/src/tla.rs:669:9:
assertion failed: output.specification.contains("BlockingDeps == {}")

---- tla::tests::pair_sets_separate_every_element_but_the_last stdout ----

thread 'tla::tests::pair_sets_separate_every_element_but_the_last' (583725) panicked at crates/casm-formal/src/tla.rs:700:9:
assertion `left == right` failed: two inside tuples, one separator
  left: 0
 right: 3

---- tla::tests::set_literals_use_tla_syntax stdout ----

thread 'tla::tests::set_literals_use_tla_syntax' (583726) panicked at crates/casm-formal/src/tla.rs:690:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "{}"

failures:
    tla::tests::an_empty_architecture_still_produces_a_wellformed_module
    tla::tests::asynchronous_edges_are_absent_from_the_closure
    tla::tests::asynchronous_edges_are_still_recorded_for_the_reader
    tla::tests::pair_sets_separate_every_element_but_the_last
    tla::tests::set_literals_use_tla_syntax

test result: FAILED. 42 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
