*** crates/casm-formal/src/tla.rs:120:34: replace + with - in pair_set

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace + with - in pair_set
@@ -112,17 +112,17 @@
 /// Renders a set of pairs as a TLA+ set of tuples.
 fn pair_set(pairs: &[(String, String)]) -> String {
     if pairs.is_empty() {
         return "{}".to_owned();
     }
 
     let mut out = String::from("{\n");
     for (index, (source, target)) in pairs.iter().enumerate() {
-        let separator = if index + 1 == pairs.len() { "" } else { "," };
+        let separator = if index - /* ~ changed by cargo-mutants ~ */ 1 == pairs.len() { "" } else { "," };
         let _ = writeln!(out, "        <<\"{source}\", \"{target}\">>{separator}");
     }
     out.push_str("    }");
     out
 }
 
 /// Emits the TLA+ module and its TLC configuration.
 #[must_use]

---- tla::tests::asynchronous_edges_are_absent_from_the_closure stdout ----

thread 'tla::tests::asynchronous_edges_are_absent_from_the_closure' (584965) panicked at crates/casm-formal/src/tla.rs:120:28:
attempt to subtract with overflow

---- tla::tests::pair_sets_separate_every_element_but_the_last stdout ----

thread 'tla::tests::pair_sets_separate_every_element_but_the_last' (584994) panicked at crates/casm-formal/src/tla.rs:120:28:
attempt to subtract with overflow

---- tla::tests::generation_is_deterministic stdout ----

thread 'tla::tests::generation_is_deterministic' (584973) panicked at crates/casm-formal/src/tla.rs:120:28:
attempt to subtract with overflow

failures:
    tla::tests::asynchronous_edges_are_absent_from_the_closure
    tla::tests::asynchronous_edges_are_still_recorded_for_the_reader
    tla::tests::generation_is_deterministic
    tla::tests::latency_budgets_appear_only_as_comments
    tla::tests::node_names_are_strings_so_hyphens_survive
    tla::tests::pair_sets_separate_every_element_but_the_last
    tla::tests::the_blast_radius_bound_is_seeded_so_it_holds
    tla::tests::the_config_declares_every_constant_the_module_takes
    tla::tests::the_config_names_only_operators_the_module_defines
    tla::tests::the_filenames_agree_with_the_module_name
    tla::tests::the_module_is_terminated

test result: FAILED. 36 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
