*** crates/casm-formal/src/tla.rs:120:38: replace == with != in pair_set

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace == with != in pair_set
@@ -112,17 +112,17 @@
 /// Renders a set of pairs as a TLA+ set of tuples.
 fn pair_set(pairs: &[(String, String)]) -> String {
     if pairs.is_empty() {
         return "{}".to_owned();
     }
 
     let mut out = String::from("{\n");
     for (index, (source, target)) in pairs.iter().enumerate() {
-        let separator = if index + 1 == pairs.len() { "" } else { "," };
+        let separator = if index + 1 != /* ~ changed by cargo-mutants ~ */ pairs.len() { "" } else { "," };
         let _ = writeln!(out, "        <<\"{source}\", \"{target}\">>{separator}");
     }
     out.push_str("    }");
     out
 }
 
 /// Emits the TLA+ module and its TLC configuration.
 #[must_use]

---- tla::tests::pair_sets_separate_every_element_but_the_last stdout ----

thread 'tla::tests::pair_sets_separate_every_element_but_the_last' (583801) panicked at crates/casm-formal/src/tla.rs:715:9:
a trailing comma would not parse

failures:
    tla::tests::pair_sets_separate_every_element_but_the_last

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
