*** crates/casm-formal/src/tla.rs:169:5: replace write_header with ()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace write_header with ()
@@ -161,66 +161,17 @@
         specification: spec,
         config: emit_config(blast_radius, max_failures),
         liveness_config: emit_liveness_config(blast_radius, max_failures),
     }
 }
 
 /// Writes the module header and its explanatory comment.
 fn write_header(out: &mut String, module: &str, model: &FormalModel) {
-    let _ = writeln!(out, "---- MODULE {module} ----");
-    let _ = writeln!(
-        out,
-        "(***************************************************************"
-    );
-    let _ = writeln!(
-        out,
-        " * Generated by CASIMIR from '{}' v{}.",
-        model.name, model.version
-    );
-    let _ = writeln!(out, " * Source fingerprint: {}", model.fingerprint);
-    let _ = writeln!(out, " *");
-    let _ = writeln!(
-        out,
-        " * This module models FAILURE PROPAGATION. A node is unavailable"
-    );
-    let _ = writeln!(
-        out,
-        " * if it has failed, or if anything it blocks on is unavailable."
-    );
-    let _ = writeln!(
-        out,
-        " * Asynchronous and event-driven edges deliberately do NOT"
-    );
-    let _ = writeln!(
-        out,
-        " * propagate failure -- putting a queue between two services is"
-    );
-    let _ = writeln!(
-        out,
-        " * what makes them independent, and this model says so."
-    );
-    let _ = writeln!(out, " *");
-    let _ = writeln!(
-        out,
-        " * Latency budgets are recorded in comments but are NOT modelled."
-    );
-    let _ = writeln!(
-        out,
-        " * These properties prove WHETHER a node degrades, not how fast."
-    );
-    let _ = writeln!(out, " *");
-    let _ = writeln!(out, " * Regenerate with:  casm formal --format tla");
-    let _ = writeln!(out, " * Check with:       tlc {module}.tla");
-    let _ = writeln!(
-        out,
-        " ***************************************************************)"
-    );
-    let _ = writeln!(out, "EXTENDS FiniteSets, Naturals\n");
-    let _ = writeln!(out, "CONSTANTS MaxBlastRadius, MaxConcurrentFailures\n");
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the architecture's topology as constants.
 fn write_topology(
     out: &mut String,
     model: &FormalModel,
     blocking: &[(String, String)],
     asynchronous: &[(String, String)],

---- tla::tests::the_filenames_agree_with_the_module_name stdout ----

thread 'tla::tests::the_filenames_agree_with_the_module_name' (585238) panicked at crates/casm-formal/src/tla.rs:512:9:
assertion failed: output.specification.contains("---- MODULE Checkout ----")

failures:
    tla::tests::the_filenames_agree_with_the_module_name

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
