*** crates/casm-formal/src/tla.rs:286:5: replace write_behaviour with ()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace write_behaviour with ()
@@ -278,46 +278,17 @@
     let _ = writeln!(
         out,
         "-------------------------------------------------------------\n"
     );
 }
 
 /// Writes the state machine.
 fn write_behaviour(out: &mut String) {
-    let _ = writeln!(out, "VARIABLE failed\n");
-    let _ = writeln!(out, "TypeOK == failed \\subseteq Nodes\n");
-    let _ = writeln!(out, "Init == failed = {{}}\n");
-    let _ = writeln!(out, "Fail(n) == /\\ n \\in Nodes");
-    let _ = writeln!(out, "           /\\ n \\notin failed");
-    let _ = writeln!(out, "           /\\ failed' = failed \\cup {{n}}\n");
-    let _ = writeln!(out, "Recover(n) == /\\ n \\in failed");
-    let _ = writeln!(out, "              /\\ failed' = failed \\ {{n}}\n");
-    let _ = writeln!(out, "Next == \\E n \\in Nodes : Fail(n) \\/ Recover(n)\n");
-    let _ = writeln!(
-        out,
-        "(* Weak fairness on recovery: a node that stays down while repair"
-    );
-    let _ = writeln!(
-        out,
-        "   remains possible must eventually come back. Without this,"
-    );
-    let _ = writeln!(
-        out,
-        "   'every failure is repaired' is trivially violable. *)"
-    );
-    let _ = writeln!(
-        out,
-        "Fairness == \\A n \\in Nodes : WF_failed(Recover(n))\n"
-    );
-    let _ = writeln!(out, "Spec == Init /\\ [][Next]_failed /\\ Fairness\n");
-    let _ = writeln!(
-        out,
-        "-------------------------------------------------------------\n"
-    );
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the operators the properties are stated in terms of.
 fn write_derived_operators(out: &mut String) {
     let _ = writeln!(
         out,
         "(* A node is unavailable if it has failed, or if anything it"
     );

---- tla::tests::the_config_names_only_operators_the_module_defines stdout ----

thread 'tla::tests::the_config_names_only_operators_the_module_defines' (586388) panicked at crates/casm-formal/src/tla.rs:608:13:
the config references 'TypeOK', which the module does not define

failures:
    tla::tests::the_config_names_only_operators_the_module_defines

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
