*** crates/casm-formal/src/tla.rs:353:5: replace write_properties with ()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace write_properties with ()
@@ -345,102 +345,17 @@
     let _ = writeln!(
         out,
         "Independent == {{ n \\in Nodes : Dependents(n) = {{}} }}\n"
     );
 }
 
 /// Writes the properties to check, and the bound on the state space.
 fn write_properties(out: &mut String) {
-    let _ = writeln!(
-        out,
-        "(* --- Invariants ------------------------------------------- *)\n"
-    );
-
-    let _ = writeln!(
-        out,
-        "(* No node depends on itself, however indirectly. Restates the"
-    );
-    let _ = writeln!(
-        out,
-        "   'no-dependency-cycles' rule so a checker confirms it. *)"
-    );
-    let _ = writeln!(
-        out,
-        "NoBlockingCycles == \\A n \\in Nodes : <<n, n>> \\notin BlockingClosure\n"
-    );
-
-    let _ = writeln!(
-        out,
-        "(* No single failure takes down more than the agreed number of"
-    );
-    let _ = writeln!(
-        out,
-        "   nodes. Seeded from the architecture as it stands; lower it to"
-    );
-    let _ = writeln!(
-        out,
-        "   turn this into a real constraint on future changes. *)"
-    );
-    let _ = writeln!(out, "BlastRadiusWithinLimit ==");
-    let _ = writeln!(
-        out,
-        "    \\A n \\in Nodes : Cardinality(Dependents(n)) <= MaxBlastRadius\n"
-    );
-
-    let _ = writeln!(
-        out,
-        "(* A node behind an asynchronous boundary cannot take anything"
-    );
-    let _ = writeln!(out, "   else down. This is the property a queue is FOR. *)");
-    let _ = writeln!(out, "AsyncIsolation ==");
-    let _ = writeln!(
-        out,
-        "    \\A n \\in Independent : (failed = {{n}}) => (Unavailable = {{n}})\n"
-    );
-
-    let _ = writeln!(
-        out,
-        "(* --- Temporal properties ----------------------------------- *)\n"
-    );
-
-    let _ = writeln!(
-        out,
-        "(* Every failure is eventually repaired. Holds under Fairness;"
-    );
-    let _ = writeln!(
-        out,
-        "   if it ever fails, the model has a genuine liveness bug. *)"
-    );
-    let _ = writeln!(out, "EveryFailureIsRepaired ==");
-    let _ = writeln!(
-        out,
-        "    \\A n \\in Nodes : [](n \\in failed => <>(n \\notin failed))\n"
-    );
-
-    let _ = writeln!(
-        out,
-        "(* --- State space bound ------------------------------------- *)\n"
-    );
-    let _ = writeln!(
-        out,
-        "(* Without this the state space is 2^|Nodes|. Simultaneous"
-    );
-    let _ = writeln!(
-        out,
-        "   failures beyond a couple are rarely the interesting case;"
-    );
-    let _ = writeln!(
-        out,
-        "   raise MaxConcurrentFailures in the .cfg to explore further. *)"
-    );
-    let _ = writeln!(
-        out,
-        "FailureBound == Cardinality(failed) <= MaxConcurrentFailures"
-    );
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Emits the safety configuration: invariants over a bounded state space.
 fn emit_config(blast_radius: usize, max_failures: usize) -> String {
     let mut config = String::new();
     let _ = writeln!(config, "\\* Generated by CASIMIR -- safety properties.");
     let _ = writeln!(config, "\\* Run with: tlc <Module>.tla");
     let _ = writeln!(config, "SPECIFICATION Spec\n");

---- tla::tests::the_config_names_only_operators_the_module_defines stdout ----

thread 'tla::tests::the_config_names_only_operators_the_module_defines' (586988) panicked at crates/casm-formal/src/tla.rs:552:13:
the config references 'NoBlockingCycles', which the module does not define

failures:
    tla::tests::the_config_names_only_operators_the_module_defines

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
