*** crates/casm-formal/src/tla.rs:443:5: replace emit_config -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace emit_config -> String with "xyzzy".into()
@@ -435,37 +435,17 @@
     let _ = writeln!(
         out,
         "FailureBound == Cardinality(failed) <= MaxConcurrentFailures"
     );
 }
 
 /// Emits the safety configuration: invariants over a bounded state space.
 fn emit_config(blast_radius: usize, max_failures: usize) -> String {
-    let mut config = String::new();
-    let _ = writeln!(config, "\\* Generated by CASIMIR -- safety properties.");
-    let _ = writeln!(config, "\\* Run with: tlc <Module>.tla");
-    let _ = writeln!(config, "SPECIFICATION Spec\n");
-    let _ = writeln!(config, "CONSTANT MaxBlastRadius = {blast_radius}");
-    let _ = writeln!(config, "CONSTANT MaxConcurrentFailures = {max_failures}\n");
-    let _ = writeln!(config, "INVARIANT TypeOK");
-    let _ = writeln!(config, "INVARIANT NoBlockingCycles");
-    let _ = writeln!(config, "INVARIANT BlastRadiusWithinLimit");
-    let _ = writeln!(config, "INVARIANT AsyncIsolation\n");
-    let _ = writeln!(
-        config,
-        "\\* Bounds the state space to a realistic number of"
-    );
-    let _ = writeln!(
-        config,
-        "\\* simultaneous failures. Sound for invariants; see the"
-    );
-    let _ = writeln!(config, "\\* liveness config for why it is not used there.");
-    let _ = writeln!(config, "CONSTRAINT FailureBound");
-    config
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Emits the liveness configuration: the temporal property, unconstrained.
 ///
 /// No `CONSTRAINT`. TLC warns that a state constraint during liveness checking is
 /// dangerous, and it is right: pruning states can hide the very counterexample the
 /// property exists to find. The cost is a state space of `2^|Nodes|`, which is why this
 /// is a separate run rather than the default one.

---- tla::tests::a_single_node_architecture_bounds_failures_sensibly stdout ----

thread 'tla::tests::a_single_node_architecture_bounds_failures_sensibly' (587762) panicked at crates/casm-formal/src/tla.rs:668:9:
xyzzy

---- tla::tests::the_config_declares_every_constant_the_module_takes stdout ----

thread 'tla::tests::the_config_declares_every_constant_the_module_takes' (587781) panicked at crates/casm-formal/src/tla.rs:632:13:
the config never assigns MaxBlastRadius

---- tla::tests::the_blast_radius_bound_is_seeded_so_it_holds stdout ----

thread 'tla::tests::the_blast_radius_bound_is_seeded_so_it_holds' (587780) panicked at crates/casm-formal/src/tla.rs:599:9:
xyzzy

failures:
    tla::tests::a_single_node_architecture_bounds_failures_sensibly
    tla::tests::the_blast_radius_bound_is_seeded_so_it_holds
    tla::tests::the_config_declares_every_constant_the_module_takes

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
