*** crates/casm-formal/src/tla.rs:473:5: replace emit_liveness_config -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace emit_liveness_config -> String with "xyzzy".into()
@@ -465,40 +465,17 @@
 
 /// Emits the liveness configuration: the temporal property, unconstrained.
 ///
 /// No `CONSTRAINT`. TLC warns that a state constraint during liveness checking is
 /// dangerous, and it is right: pruning states can hide the very counterexample the
 /// property exists to find. The cost is a state space of `2^|Nodes|`, which is why this
 /// is a separate run rather than the default one.
 fn emit_liveness_config(blast_radius: usize, max_failures: usize) -> String {
-    let mut config = String::new();
-    let _ = writeln!(config, "\\* Generated by CASIMIR -- liveness properties.");
-    let _ = writeln!(
-        config,
-        "\\* Run with: tlc -config <Module>Liveness.cfg <Module>.tla"
-    );
-    let _ = writeln!(config, "\\*");
-    let _ = writeln!(
-        config,
-        "\\* Deliberately has no CONSTRAINT: pruning the state space"
-    );
-    let _ = writeln!(
-        config,
-        "\\* can hide a liveness counterexample. The state space is"
-    );
-    let _ = writeln!(
-        config,
-        "\\* therefore 2^|Nodes|, so this run is the expensive one."
-    );
-    let _ = writeln!(config, "SPECIFICATION Spec\n");
-    let _ = writeln!(config, "CONSTANT MaxBlastRadius = {blast_radius}");
-    let _ = writeln!(config, "CONSTANT MaxConcurrentFailures = {max_failures}\n");
-    let _ = writeln!(config, "PROPERTY EveryFailureIsRepaired");
-    config
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

*** result: Success
