*** crates/casm-formal/src/tla.rs:51:9: replace TlaOutput::specification_filename -> String with String::new()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace TlaOutput::specification_filename -> String with String::new()
@@ -43,17 +43,17 @@
     /// then appear to hold only because the counterexample was cut off.
     pub liveness_config: String,
 }
 
 impl TlaOutput {
     /// The filename the specification must be written to.
     #[must_use]
     pub fn specification_filename(&self) -> String {
-        format!("{}.tla", self.module)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The filename the safety configuration must be written to.
     #[must_use]
     pub fn config_filename(&self) -> String {
         format!("{}.cfg", self.module)
     }

---- tla::tests::the_filenames_agree_with_the_module_name stdout ----

thread 'tla::tests::the_filenames_agree_with_the_module_name' (580622) panicked at crates/casm-formal/src/tla.rs:559:9:
assertion `left == right` failed
  left: ""
 right: "Checkout.tla"

failures:
    tla::tests::the_filenames_agree_with_the_module_name

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
