*** crates/casm-formal/src/tla.rs:57:9: replace TlaOutput::config_filename -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace TlaOutput::config_filename -> String with "xyzzy".into()
@@ -49,17 +49,17 @@
     #[must_use]
     pub fn specification_filename(&self) -> String {
         format!("{}.tla", self.module)
     }
 
     /// The filename the safety configuration must be written to.
     #[must_use]
     pub fn config_filename(&self) -> String {
-        format!("{}.cfg", self.module)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The filename the liveness configuration must be written to.
     #[must_use]
     pub fn liveness_config_filename(&self) -> String {
         format!("{}Liveness.cfg", self.module)
     }
 }

---- tla::tests::the_filenames_agree_with_the_module_name stdout ----

thread 'tla::tests::the_filenames_agree_with_the_module_name' (580280) panicked at crates/casm-formal/src/tla.rs:560:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "Checkout.cfg"

failures:
    tla::tests::the_filenames_agree_with_the_module_name

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
