*** crates/casm-formal/src/tla.rs:63:9: replace TlaOutput::liveness_config_filename -> String with String::new()

*** mutation diff:
--- crates/casm-formal/src/tla.rs
+++ replace TlaOutput::liveness_config_filename -> String with String::new()
@@ -55,17 +55,17 @@
     #[must_use]
     pub fn config_filename(&self) -> String {
         format!("{}.cfg", self.module)
     }
 
     /// The filename the liveness configuration must be written to.
     #[must_use]
     pub fn liveness_config_filename(&self) -> String {
-        format!("{}Liveness.cfg", self.module)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Converts an architecture name into a legal TLA+ module name.
 ///
 /// TLA+ requires the module name to match the filename and to be an identifier, so
 /// `edge-storefront` becomes `EdgeStorefront`. A name that reduces to nothing — one made
 /// entirely of punctuation — falls back to `Architecture` rather than producing a module

*** result: Success
