*** crates/casm-git/src/lib.rs:112:9: replace Revision::short_commit -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace Revision::short_commit -> String with "xyzzy".into()
@@ -104,17 +104,17 @@
     /// `true` if this is the commit that introduced the file.
     pub introduced: bool,
 }
 
 impl Revision {
     /// The abbreviated commit hash, as Git would show it.
     #[must_use]
     pub fn short_commit(&self) -> String {
-        self.commit.get(..7).unwrap_or(&self.commit).to_owned()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The author time as a UTC civil date and time.
     #[must_use]
     pub const fn dated(&self) -> DateTime {
         DateTime::from_unix(self.timestamp)
     }
 }

---- tests::a_short_commit_does_not_panic_on_an_unexpectedly_short_hash stdout ----

thread 'tests::a_short_commit_does_not_panic_on_an_unexpectedly_short_hash' (594206) panicked at crates/casm-git/src/lib.rs:421:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "abc"

---- tests::a_short_commit_is_seven_characters stdout ----

thread 'tests::a_short_commit_is_seven_characters' (594207) panicked at crates/casm-git/src/lib.rs:406:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "0123456"

failures:
    tests::a_short_commit_does_not_panic_on_an_unexpectedly_short_hash
    tests::a_short_commit_is_seven_characters

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
