*** crates/casm-git/src/lib.rs:160:9: replace Repository::relative_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace Repository::relative_path -> PathBuf with Default::default()
@@ -152,27 +152,17 @@
 
     /// Expresses `path` relative to the repository root, as Git stores it.
     ///
     /// Git addresses blobs by repository-relative path, so a path given on the command
     /// line — absolute, or relative to wherever the user happened to be — has to be
     /// translated before any lookup will find it.
     #[must_use]
     pub fn relative_path(&self, path: &Path) -> PathBuf {
-        let absolute = if path.is_absolute() {
-            path.to_path_buf()
-        } else {
-            std::env::current_dir().map_or_else(|_| path.to_path_buf(), |cwd| cwd.join(path))
-        };
-
-        // `strip_prefix` fails for a path outside the repository; keeping the original is
-        // the honest fallback, and the lookup will then report it as not found.
-        absolute
-            .strip_prefix(&self.root)
-            .map_or_else(|_| path.to_path_buf(), Path::to_path_buf)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reads a file's contents at a given revision.
     ///
     /// # Errors
     ///
     /// - [`GitError::UnknownRevision`] if `revision` does not resolve.
     /// - [`GitError::PathNotFound`] if the file is not tracked there.

---- a_path_relative_to_the_repository_root_resolves stdout ----

thread 'a_path_relative_to_the_repository_root_resolves' (594961) panicked at crates/casm-git/tests/history.rs:469:5:
assertion `left == right` failed
  left: ""
 right: "architecture.yaml"

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (594960) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_change_names_the_nodes_it_touched stdout ----

thread 'a_change_names_the_nodes_it_touched' (594958) panicked at crates/casm-git/tests/history.rs:200:23:
index out of bounds: the len is 0 but the index is 0

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_path_relative_to_the_repository_root_resolves
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reading_a_file_at_a_past_revision_returns_the_old_contents
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 8 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
