*** crates/casm-git/src/lib.rs:181:9: replace Repository::read_at -> Result<String> with Ok(String::new())

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace Repository::read_at -> Result<String> with Ok(String::new())
@@ -173,43 +173,17 @@
     /// Reads a file's contents at a given revision.
     ///
     /// # Errors
     ///
     /// - [`GitError::UnknownRevision`] if `revision` does not resolve.
     /// - [`GitError::PathNotFound`] if the file is not tracked there.
     /// - [`GitError::NotText`] if the blob is not valid UTF-8.
     pub fn read_at(&self, revision: &str, path: &Path) -> Result<String> {
-        let id = self
-            .inner
-            .rev_parse_single(revision)
-            .map_err(|_| GitError::UnknownRevision {
-                spec: revision.to_owned(),
-            })?;
-
-        let commit = id
-            .object()
-            .map_err(|_| GitError::UnknownRevision {
-                spec: revision.to_owned(),
-            })?
-            .peel_to_commit()
-            .map_err(|_| GitError::UnknownRevision {
-                spec: revision.to_owned(),
-            })?;
-
-        let relative = self.relative_path(path);
-        let bytes = read_blob(&commit, &relative).ok_or_else(|| GitError::PathNotFound {
-            path: relative.clone(),
-            revision: revision.to_owned(),
-        })?;
-
-        String::from_utf8(bytes).map_err(|_| GitError::NotText {
-            path: relative,
-            revision: revision.to_owned(),
-        })
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the commits at which the architecture's meaning changed, newest first.
     ///
     /// Commits that touched the file without changing its meaning are omitted, as are
     /// commits where the file did not exist or did not parse.
     ///
     /// # Errors

---- reading_an_unknown_revision_is_reported_as_such stdout ----

thread 'reading_an_unknown_revision_is_reported_as_such' (595309) panicked at crates/casm-git/tests/history.rs:314:5:
assertion failed: matches!(repository.read_at("no-such-ref", &fixture.path()),
    Err(GitError::UnknownRevision { .. }))

---- reading_a_file_at_a_past_revision_returns_the_old_contents stdout ----

thread 'reading_a_file_at_a_past_revision_returns_the_old_contents' (595304) panicked at crates/casm-git/tests/history.rs:299:5:

---- reading_an_untracked_path_is_reported_as_such stdout ----

thread 'reading_an_untracked_path_is_reported_as_such' (595316) panicked at crates/casm-git/tests/history.rs:329:5:
assertion failed: matches!(repository.read_at("HEAD", &missing),
    Err(GitError::PathNotFound { .. }))

failures:
    reading_a_file_at_a_past_revision_returns_the_old_contents
    reading_an_unknown_revision_is_reported_as_such
    reading_an_untracked_path_is_reported_as_such

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
