*** crates/casm-git/src/lib.rs:220:9: replace Repository::semantic_history -> Result<Vec<Revision>> with Ok(vec![])

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace Repository::semantic_history -> Result<Vec<Revision>> with Ok(vec![])
@@ -212,59 +212,17 @@
     /// Commits that touched the file without changing its meaning are omitted, as are
     /// commits where the file did not exist or did not parse.
     ///
     /// # Errors
     ///
     /// - [`GitError::NoCommits`] if the repository has no history.
     /// - [`GitError::ObjectDatabase`] if the object database cannot be read.
     pub fn semantic_history(&self, path: &Path, options: HistoryOptions) -> Result<Vec<Revision>> {
-        let relative = self.relative_path(path);
-        let head = self.inner.head_commit().map_err(|_| GitError::NoCommits)?;
-
-        let walk = head
-            .ancestors()
-            .all()
-            .map_err(|error| GitError::ObjectDatabase {
-                message: error.to_string(),
-            })?;
-
-        let mut revisions = Vec::new();
-        // The sliding window is what bounds memory: two snapshots, never the whole history.
-        let mut newer: Option<Snapshot> = None;
-        let mut examined = 0_usize;
-
-        for step in walk {
-            if examined >= options.max_commits || revisions.len() >= options.max_revisions {
-                break;
-            }
-            examined = examined.saturating_add(1);
-
-            let Ok(info) = step else { continue };
-            let Some(current) = self.snapshot(info.id, &relative) else {
-                continue;
-            };
-
-            if let Some(previous) = newer.take()
-                && let Some(revision) = previous.into_revision(Some(&current))
-            {
-                revisions.push(revision);
-            }
-            newer = Some(current);
-        }
-
-        // The oldest snapshot we hold has no parent in view, so it introduced the file.
-        if revisions.len() < options.max_revisions
-            && let Some(oldest) = newer
-            && let Some(revision) = oldest.into_revision(None)
-        {
-            revisions.push(revision);
-        }
-
-        Ok(revisions)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the commits at which a single node's meaning changed, newest first.
     ///
     /// # Errors
     ///
     /// As [`Repository::semantic_history`].
     pub fn blame_node(

---- a_repository_with_no_commits_says_so stdout ----

thread 'a_repository_with_no_commits_says_so' (595462) panicked at crates/casm-git/tests/history.rs:359:5:
assertion failed: matches!(repository.semantic_history(&fixture.path(),
    HistoryOptions::default()), Err(GitError::NoCommits))

---- a_change_names_the_nodes_it_touched stdout ----

thread 'a_change_names_the_nodes_it_touched' (595454) panicked at crates/casm-git/tests/history.rs:200:23:
index out of bounds: the len is 0 but the index is 0

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (595457) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_real_change_is_reported
    a_repository_with_no_commits_says_so
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 9 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
