*** crates/casm-git/src/lib.rs:236:25: replace >= with < in Repository::semantic_history

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace >= with < in Repository::semantic_history
@@ -228,17 +228,17 @@
             })?;
 
         let mut revisions = Vec::new();
         // The sliding window is what bounds memory: two snapshots, never the whole history.
         let mut newer: Option<Snapshot> = None;
         let mut examined = 0_usize;
 
         for step in walk {
-            if examined >= options.max_commits || revisions.len() >= options.max_revisions {
+            if examined < /* ~ changed by cargo-mutants ~ */ options.max_commits || revisions.len() >= options.max_revisions {
                 break;
             }
             examined = examined.saturating_add(1);
 
             let Ok(info) = step else { continue };
             let Some(current) = self.snapshot(info.id, &relative) else {
                 continue;
             };

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (596586) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (596594) panicked at crates/casm-git/tests/history.rs:236:18:
index out of bounds: the len is 0 but the index is 0

---- a_change_names_the_nodes_it_touched stdout ----

thread 'a_change_names_the_nodes_it_touched' (596584) panicked at crates/casm-git/tests/history.rs:200:23:
index out of bounds: the len is 0 but the index is 0

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 10 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
