*** crates/casm-git/src/lib.rs:236:48: replace || with && in Repository::semantic_history

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace || with && in Repository::semantic_history
@@ -228,17 +228,17 @@
             })?;
 
         let mut revisions = Vec::new();
         // The sliding window is what bounds memory: two snapshots, never the whole history.
         let mut newer: Option<Snapshot> = None;
         let mut examined = 0_usize;
 
         for step in walk {
-            if examined >= options.max_commits || revisions.len() >= options.max_revisions {
+            if examined >= options.max_commits && /* ~ changed by cargo-mutants ~ */ revisions.len() >= options.max_revisions {
                 break;
             }
             examined = examined.saturating_add(1);
 
             let Ok(info) = step else { continue };
             let Some(current) = self.snapshot(info.id, &relative) else {
                 continue;
             };

---- the_commit_walk_ceiling_is_honoured stdout ----

thread 'the_commit_walk_ceiling_is_honoured' (596493) panicked at crates/casm-git/tests/history.rs:406:5:
walked further than permitted: 5

---- the_revision_limit_is_honoured stdout ----

thread 'the_revision_limit_is_honoured' (596508) panicked at crates/casm-git/tests/history.rs:384:5:
assertion `left == right` failed
  left: 4
 right: 2

failures:
    the_commit_walk_ceiling_is_honoured
    the_revision_limit_is_honoured

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
