*** crates/casm-git/src/lib.rs:255:28: replace < with == in Repository::semantic_history

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace < with == in Repository::semantic_history
@@ -247,17 +247,17 @@
                 && let Some(revision) = previous.into_revision(Some(&current))
             {
                 revisions.push(revision);
             }
             newer = Some(current);
         }
 
         // The oldest snapshot we hold has no parent in view, so it introduced the file.
-        if revisions.len() < options.max_revisions
+        if revisions.len() == /* ~ changed by cargo-mutants ~ */ options.max_revisions
             && let Some(oldest) = newer
             && let Some(revision) = oldest.into_revision(None)
         {
             revisions.push(revision);
         }
 
         Ok(revisions)
     }

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (598357) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

---- commit_metadata_is_carried_through stdout ----

thread 'commit_metadata_is_carried_through' (598402) panicked at crates/casm-git/tests/history.rs:215:23:
index out of bounds: the len is 0 but the index is 0

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (598365) panicked at crates/casm-git/tests/history.rs:241:5:
assertion `left == right` failed: api changed once: when it was introduced
  left: 0
 right: 1

failures:
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 11 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
