*** crates/casm-git/src/lib.rs:255:28: replace < with <= in Repository::semantic_history

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace < with <= in Repository::semantic_history
@@ -247,17 +247,17 @@
                 && let Some(revision) = previous.into_revision(Some(&current))
             {
                 revisions.push(revision);
             }
             newer = Some(current);
         }
 
         // The oldest snapshot we hold has no parent in view, so it introduced the file.
-        if revisions.len() < options.max_revisions
+        if revisions.len() <= /* ~ changed by cargo-mutants ~ */ options.max_revisions
             && let Some(oldest) = newer
             && let Some(revision) = oldest.into_revision(None)
         {
             revisions.push(revision);
         }
 
         Ok(revisions)
     }

---- the_revision_limit_is_honoured stdout ----

thread 'the_revision_limit_is_honoured' (598275) panicked at crates/casm-git/tests/history.rs:384:5:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    the_revision_limit_is_honoured

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
