*** crates/casm-git/src/lib.rs:276:9: replace Repository::blame_node -> Result<Vec<Revision>> with Ok(vec![])

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace Repository::blame_node -> Result<Vec<Revision>> with Ok(vec![])
@@ -268,21 +268,17 @@
     ///
     /// As [`Repository::semantic_history`].
     pub fn blame_node(
         &self,
         path: &Path,
         node: &str,
         options: HistoryOptions,
     ) -> Result<Vec<Revision>> {
-        Ok(self
-            .semantic_history(path, options)?
-            .into_iter()
-            .filter(|revision| revision.changed_nodes.iter().any(|name| name == node))
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Builds a snapshot of the architecture at one commit, if it parses there.
     fn snapshot(&self, id: gix::ObjectId, relative: &Path) -> Option<Snapshot> {
         let commit = self.inner.find_commit(id).ok()?;
         let bytes = read_blob(&commit, relative)?;
         let source = String::from_utf8(bytes).ok()?;

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (598610) panicked at crates/casm-git/tests/history.rs:236:18:
index out of bounds: the len is 0 but the index is 0

failures:
    blame_attributes_a_node_to_the_commit_that_changed_it

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
