*** crates/casm-git/src/lib.rs:279:78: replace == with != in Repository::blame_node

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace == with != in Repository::blame_node
@@ -271,17 +271,17 @@
         &self,
         path: &Path,
         node: &str,
         options: HistoryOptions,
     ) -> Result<Vec<Revision>> {
         Ok(self
             .semantic_history(path, options)?
             .into_iter()
-            .filter(|revision| revision.changed_nodes.iter().any(|name| name == node))
+            .filter(|revision| revision.changed_nodes.iter().any(|name| name != /* ~ changed by cargo-mutants ~ */ node))
             .collect())
     }
 
     /// Builds a snapshot of the architecture at one commit, if it parses there.
     fn snapshot(&self, id: gix::ObjectId, relative: &Path) -> Option<Snapshot> {
         let commit = self.inner.find_commit(id).ok()?;
         let bytes = read_blob(&commit, relative)?;
         let source = String::from_utf8(bytes).ok()?;

---- blame_of_an_unknown_node_is_empty stdout ----

thread 'blame_of_an_unknown_node_is_empty' (599489) panicked at crates/casm-git/tests/history.rs:253:5:
assertion failed: repository.blame_node(&fixture.path(), "nonexistent",
            HistoryOptions::default()).unwrap().is_empty()

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (599488) panicked at crates/casm-git/tests/history.rs:236:5:
assertion `left == right` failed: not the reformat
  left: "initial"
 right: "change the datastore"

failures:
    blame_attributes_a_node_to_the_commit_that_changed_it
    blame_of_an_unknown_node_is_empty

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
