*** crates/casm-git/src/lib.rs:285:9: replace Repository::snapshot -> Option<Snapshot> with None

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace Repository::snapshot -> Option<Snapshot> with None
@@ -277,35 +277,17 @@
             .semantic_history(path, options)?
             .into_iter()
             .filter(|revision| revision.changed_nodes.iter().any(|name| name == node))
             .collect())
     }
 
     /// Builds a snapshot of the architecture at one commit, if it parses there.
     fn snapshot(&self, id: gix::ObjectId, relative: &Path) -> Option<Snapshot> {
-        let commit = self.inner.find_commit(id).ok()?;
-        let bytes = read_blob(&commit, relative)?;
-        let source = String::from_utf8(bytes).ok()?;
-
-        // A commit where the file was mid-refactor and did not parse is not a semantic
-        // change; it is a commit we cannot say anything about. Skipping it means
-        // `casm log` compares the states either side of it, which is what a reader wants.
-        let architecture = casm_parser::parse_str(&source, relative).ok()?;
-        let author = commit.author().ok()?;
-        let message = commit.message().ok()?;
-
-        Some(Snapshot {
-            commit: id.to_string(),
-            author: author.name.to_string(),
-            email: author.email.to_string(),
-            timestamp: author.time().map(|time| time.seconds).unwrap_or_default(),
-            summary: message.title.trim().to_str_lossy().into_owned(),
-            tree: MerkleTree::of(&architecture),
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The architecture at one commit, reduced to what history needs.
 struct Snapshot {
     commit: String,
     author: String,
     email: String,

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (600016) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_change_names_the_nodes_it_touched stdout ----

thread 'a_change_names_the_nodes_it_touched' (600014) panicked at crates/casm-git/tests/history.rs:200:23:
index out of bounds: the len is 0 but the index is 0

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (600020) panicked at crates/casm-git/tests/history.rs:236:18:
index out of bounds: the len is 0 but the index is 0

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 10 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
