*** crates/casm-git/src/lib.rs:323:9: replace Snapshot::into_revision -> Option<Revision> with None

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace Snapshot::into_revision -> Option<Revision> with None
@@ -315,37 +315,17 @@
 }
 
 impl Snapshot {
     /// Turns this snapshot into a [`Revision`] if it differs from its parent.
     ///
     /// `parent` is `None` when the snapshot is the oldest one examined, which means the
     /// file was introduced here as far as this walk can see.
     fn into_revision(self, parent: Option<&Self>) -> Option<Revision> {
-        let changed_nodes = parent.map_or_else(
-            || self.tree.nodes().keys().cloned().collect(),
-            |older| self.tree.changed_nodes(&older.tree),
-        );
-
-        if let Some(older) = parent
-            && older.tree.root() == self.tree.root()
-        {
-            return None;
-        }
-
-        Some(Revision {
-            commit: self.commit,
-            author: self.author,
-            email: self.email,
-            timestamp: self.timestamp,
-            summary: self.summary,
-            fingerprint: self.tree.root(),
-            changed_nodes,
-            introduced: parent.is_none(),
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Reads a blob from a commit's tree by repository-relative path.
 fn read_blob(commit: &gix::Commit<'_>, relative: &Path) -> Option<Vec<u8>> {
     let tree = commit.tree().ok()?;
     let entry = tree.lookup_entry_by_path(relative).ok()??;
     Some(entry.object().ok()?.data.clone())

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (599968) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_change_names_the_nodes_it_touched stdout ----

thread 'a_change_names_the_nodes_it_touched' (599966) panicked at crates/casm-git/tests/history.rs:200:23:
index out of bounds: the len is 0 but the index is 0

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (599977) panicked at crates/casm-git/tests/history.rs:236:18:
index out of bounds: the len is 0 but the index is 0

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 10 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
