*** crates/casm-git/src/lib.rs:329:34: replace == with != in Snapshot::into_revision

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace == with != in Snapshot::into_revision
@@ -321,17 +321,17 @@
     /// file was introduced here as far as this walk can see.
     fn into_revision(self, parent: Option<&Self>) -> Option<Revision> {
         let changed_nodes = parent.map_or_else(
             || self.tree.nodes().keys().cloned().collect(),
             |older| self.tree.changed_nodes(&older.tree),
         );
 
         if let Some(older) = parent
-            && older.tree.root() == self.tree.root()
+            && older.tree.root() != /* ~ changed by cargo-mutants ~ */ self.tree.root()
         {
             return None;
         }
 
         Some(Revision {
             commit: self.commit,
             author: self.author,
             email: self.email,

---- a_change_names_the_nodes_it_touched stdout ----

thread 'a_change_names_the_nodes_it_touched' (600710) panicked at crates/casm-git/tests/history.rs:200:5:
assertion `left == right` failed: api was untouched
  left: ["api", "orders-db"]
 right: ["orders-db"]

---- a_commit_where_the_file_did_not_parse_is_skipped stdout ----

thread 'a_commit_where_the_file_did_not_parse_is_skipped' (600711) panicked at crates/casm-git/tests/history.rs:280:5:
assertion `left == right` failed: the broken commit is invisible, and the states either side are identical: ["restore", "initial"]
  left: 2
 right: 1

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (600721) panicked at crates/casm-git/tests/history.rs:236:5:
assertion `left == right` failed: not the reformat
  left: "initial"
 right: "change the datastore"

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 12 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
