*** crates/casm-git/src/lib.rs:349:5: replace read_blob -> Option<Vec<u8>> with None

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace read_blob -> Option<Vec<u8>> with None
@@ -341,19 +341,17 @@
             changed_nodes,
             introduced: parent.is_none(),
         })
     }
 }
 
 /// Reads a blob from a commit's tree by repository-relative path.
 fn read_blob(commit: &gix::Commit<'_>, relative: &Path) -> Option<Vec<u8>> {
-    let tree = commit.tree().ok()?;
-    let entry = tree.lookup_entry_by_path(relative).ok()??;
-    Some(entry.object().ok()?.data.clone())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (601222) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

---- commit_metadata_is_carried_through stdout ----

thread 'commit_metadata_is_carried_through' (601262) panicked at crates/casm-git/tests/history.rs:215:23:
index out of bounds: the len is 0 but the index is 0

---- a_commit_where_the_file_did_not_parse_is_skipped stdout ----

thread 'a_commit_where_the_file_did_not_parse_is_skipped' (601221) panicked at crates/casm-git/tests/history.rs:280:5:
assertion `left == right` failed: the broken commit is invisible, and the states either side are identical: []
  left: 0
 right: 1

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reading_a_file_at_a_past_revision_returns_the_old_contents
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 9 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
