*** crates/casm-git/src/lib.rs:349:5: replace read_blob -> Option<Vec<u8>> with Some(vec![1])

*** mutation diff:
--- crates/casm-git/src/lib.rs
+++ replace read_blob -> Option<Vec<u8>> with Some(vec![1])
@@ -341,19 +341,17 @@
             changed_nodes,
             introduced: parent.is_none(),
         })
     }
 }
 
 /// Reads a blob from a commit's tree by repository-relative path.
 fn read_blob(commit: &gix::Commit<'_>, relative: &Path) -> Option<Vec<u8>> {
-    let tree = commit.tree().ok()?;
-    let entry = tree.lookup_entry_by_path(relative).ok()??;
-    Some(entry.object().ok()?.data.clone())
+    Some(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- a_nested_architecture_file_is_found stdout ----

thread 'a_nested_architecture_file_is_found' (602359) panicked at crates/casm-git/tests/history.rs:490:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_change_names_the_nodes_it_touched stdout ----

thread 'a_change_names_the_nodes_it_touched' (602357) panicked at crates/casm-git/tests/history.rs:200:23:
index out of bounds: the len is 0 but the index is 0

---- blame_attributes_a_node_to_the_commit_that_changed_it stdout ----

thread 'blame_attributes_a_node_to_the_commit_that_changed_it' (602364) panicked at crates/casm-git/tests/history.rs:236:18:
index out of bounds: the len is 0 but the index is 0

failures:
    a_change_names_the_nodes_it_touched
    a_commit_where_the_file_did_not_parse_is_skipped
    a_nested_architecture_file_is_found
    a_real_change_is_reported
    blame_attributes_a_node_to_the_commit_that_changed_it
    commit_metadata_is_carried_through
    reading_a_file_at_a_past_revision_returns_the_old_contents
    reading_an_untracked_path_is_reported_as_such
    reformatting_is_not_a_semantic_change
    the_revision_limit_is_honoured

test result: FAILED. 8 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
