*** crates/casm-git/src/time.rs:101:26: replace >= with < in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace >= with < in civil_from_days
@@ -93,17 +93,17 @@
 /// Howard Hinnant's `civil_from_days`. The era trick shifts the calendar so that March is
 /// the first month, which makes the leap day fall at the end of a year and removes every
 /// special case for February.
 #[allow(clippy::cast_sign_loss, clippy::cast_possible_truncation)]
 const fn civil_from_days(days: i64) -> (i64, u32, u32) {
     // Shift the epoch from 1970-01-01 to 0000-03-01.
     let shifted = days + 719_468;
 
-    let era = if shifted >= 0 {
+    let era = if shifted < /* ~ changed by cargo-mutants ~ */ 0 {
         shifted
     } else {
         shifted - 146_096
     } / 146_097;
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
         (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (609466) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "2023-11-15"
 right: "2023-11-14"

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (609472) panicked at crates/casm-git/src/time.rs:190:9:
assertion `left == right` failed
  left: "1970-01-01 00:00:00"
 right: "1969-12-31 00:00:00"

---- time::tests::leap_days_are_handled stdout ----

thread 'time::tests::leap_days_are_handled' (609477) panicked at crates/casm-git/src/time.rs:164:9:
assertion `left == right` failed
  left: "2024-02-30"
 right: "2024-02-29"

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 13 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
