*** crates/casm-git/src/time.rs:104:17: replace - with / in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace - with / in civil_from_days
@@ -96,17 +96,17 @@
 #[allow(clippy::cast_sign_loss, clippy::cast_possible_truncation)]
 const fn civil_from_days(days: i64) -> (i64, u32, u32) {
     // Shift the epoch from 1970-01-01 to 0000-03-01.
     let shifted = days + 719_468;
 
     let era = if shifted >= 0 {
         shifted
     } else {
-        shifted - 146_096
+        shifted / /* ~ changed by cargo-mutants ~ */ 146_096
     } / 146_097;
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
         (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based

*** result: Success
