*** crates/casm-git/src/time.rs:114:35: replace * with / in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace * with / in civil_from_days
@@ -106,17 +106,17 @@
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
         (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based
 
-    let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;
+    let day = (day_of_year - (153 / /* ~ changed by cargo-mutants ~ */ month_prime + 2) / 5 + 1) as u32;
     let month = if month_prime < 10 {
         month_prime + 3
     } else {
         month_prime - 9
     } as u32;
 
     (if month <= 2 { year + 1 } else { year }, month, day)
 }

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (621493) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "2023-11-255"
 right: "2023-11-14"

---- time::tests::conversion_is_monotonic stdout ----

thread 'time::tests::conversion_is_monotonic' (621500) panicked at crates/casm-git/src/time.rs:114:31:
attempt to divide by zero

---- time::tests::every_component_stays_in_range_across_a_wide_span stdout ----

thread 'time::tests::every_component_stays_in_range_across_a_wide_span' (621501) panicked at crates/casm-git/src/time.rs:203:13:
day at -998999997

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::conversion_is_monotonic
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 11 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
