*** crates/casm-git/src/time.rs:121:27: replace + with * in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace + with * in civil_from_days
@@ -113,17 +113,17 @@
 
     let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;
     let month = if month_prime < 10 {
         month_prime + 3
     } else {
         month_prime - 9
     } as u32;
 
-    (if month <= 2 { year + 1 } else { year }, month, day)
+    (if month <= 2 { year * /* ~ changed by cargo-mutants ~ */ 1 } else { year }, month, day)
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- time::tests::conversion_is_monotonic stdout ----

thread 'time::tests::conversion_is_monotonic' (623958) panicked at crates/casm-git/src/time.rs:219:13:
went backwards at 129999883

---- time::tests::nineteen_hundred_was_not_a_leap_year stdout ----

thread 'time::tests::nineteen_hundred_was_not_a_leap_year' (623963) panicked at crates/casm-git/src/time.rs:177:9:
assertion `left == right` failed
  left: "1899-02-28"
 right: "1900-02-28"

---- time::tests::leap_days_are_handled stdout ----

thread 'time::tests::leap_days_are_handled' (623962) panicked at crates/casm-git/src/time.rs:162:9:
assertion `left == right` failed
  left: "1999-02-29"
 right: "2000-02-29"

failures:
    time::tests::conversion_is_monotonic
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly

test result: FAILED. 15 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
