*** crates/casm-git/src/time.rs:63:30: replace / with % in DateTime::from_unix

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace / with % in DateTime::from_unix
@@ -55,17 +55,17 @@
         let remainder = seconds.rem_euclid(SECONDS_PER_DAY);
 
         let (year, month, day) = civil_from_days(days);
 
         Self {
             year,
             month,
             day,
-            hour: (remainder / 3_600) as u32,
+            hour: (remainder % /* ~ changed by cargo-mutants ~ */ 3_600) as u32,
             minute: ((remainder % 3_600) / 60) as u32,
             second: (remainder % 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {

---- time::tests::every_component_stays_in_range_across_a_wide_span stdout ----

thread 'time::tests::every_component_stays_in_range_across_a_wide_span' (603153) panicked at crates/casm-git/src/time.rs:204:13:
hour at -1000000000

---- time::tests::known_timestamps_convert_correctly stdout ----

thread 'time::tests::known_timestamps_convert_correctly' (603155) panicked at crates/casm-git/src/time.rs:150:13:
assertion `left == right` failed: at 1000000000
  left: "2001-09-09 2800:46:40"
 right: "2001-09-09 01:46:40"

---- time::tests::timestamps_before_the_epoch_do_not_produce_negative_times stdout ----

thread 'time::tests::timestamps_before_the_epoch_do_not_produce_negative_times' (603162) panicked at crates/casm-git/src/time.rs:184:9:
assertion `left == right` failed
  left: "1969-12-31 3599:59:59"
 right: "1969-12-31 23:59:59"

failures:
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
