*** crates/casm-git/src/time.rs:64:33: replace % with / in DateTime::from_unix

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace % with / in DateTime::from_unix
@@ -56,17 +56,17 @@
 
         let (year, month, day) = civil_from_days(days);
 
         Self {
             year,
             month,
             day,
             hour: (remainder / 3_600) as u32,
-            minute: ((remainder % 3_600) / 60) as u32,
+            minute: ((remainder / /* ~ changed by cargo-mutants ~ */ 3_600) / 60) as u32,
             second: (remainder % 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {
         format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)

---- time::tests::known_timestamps_convert_correctly stdout ----

thread 'time::tests::known_timestamps_convert_correctly' (603896) panicked at crates/casm-git/src/time.rs:150:13:
assertion `left == right` failed: at 1000000000
  left: "2001-09-09 01:00:40"
 right: "2001-09-09 01:46:40"

---- time::tests::timestamps_before_the_epoch_do_not_produce_negative_times stdout ----

thread 'time::tests::timestamps_before_the_epoch_do_not_produce_negative_times' (603902) panicked at crates/casm-git/src/time.rs:184:9:
assertion `left == right` failed
  left: "1969-12-31 23:00:59"
 right: "1969-12-31 23:59:59"

failures:
    time::tests::known_timestamps_convert_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
