*** crates/casm-git/src/time.rs:64:33: replace % with + in DateTime::from_unix

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace % with + in DateTime::from_unix
@@ -56,17 +56,17 @@
 
         let (year, month, day) = civil_from_days(days);
 
         Self {
             year,
             month,
             day,
             hour: (remainder / 3_600) as u32,
-            minute: ((remainder % 3_600) / 60) as u32,
+            minute: ((remainder + /* ~ changed by cargo-mutants ~ */ 3_600) / 60) as u32,
             second: (remainder % 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {
         format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (604200) panicked at crates/casm-git/src/time.rs:190:9:
assertion `left == right` failed
  left: "1969-12-31 00:60:00"
 right: "1969-12-31 00:00:00"

---- time::tests::the_epoch_itself_converts_correctly stdout ----

thread 'time::tests::the_epoch_itself_converts_correctly' (604209) panicked at crates/casm-git/src/time.rs:137:9:
assertion `left == right` failed
  left: "1970-01-01 00:60:00"
 right: "1970-01-01 00:00:00"

---- time::tests::known_timestamps_convert_correctly stdout ----

thread 'time::tests::known_timestamps_convert_correctly' (604204) panicked at crates/casm-git/src/time.rs:150:13:
assertion `left == right` failed: at 1000000000
  left: "2001-09-09 01:166:40"
 right: "2001-09-09 01:46:40"

failures:
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::the_epoch_itself_converts_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 16 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
