*** crates/casm-git/src/time.rs:72:9: replace DateTime::to_date -> String with String::new()

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace DateTime::to_date -> String with String::new()
@@ -64,17 +64,17 @@
             minute: ((remainder % 3_600) / 60) as u32,
             second: (remainder % 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {
-        format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders as `YYYY-MM-DD HH:MM:SS`.
     #[must_use]
     pub fn to_datetime(&self) -> String {
         format!(
             "{:04}-{:02}-{:02} {:02}:{:02}:{:02}",
             self.year, self.month, self.day, self.hour, self.minute, self.second

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (604796) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: ""
 right: "2023-11-14"

---- time::tests::the_day_before_and_after_a_leap_day_are_correct stdout ----

thread 'time::tests::the_day_before_and_after_a_leap_day_are_correct' (604810) panicked at crates/casm-git/src/time.rs:169:9:
assertion `left == right` failed
  left: ""
 right: "2024-02-28"

---- time::tests::leap_days_are_handled stdout ----

thread 'time::tests::leap_days_are_handled' (604807) panicked at crates/casm-git/src/time.rs:162:9:
assertion `left == right` failed
  left: ""
 right: "2000-02-29"

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct

test result: FAILED. 17 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
