*** crates/casm-git/src/time.rs:87:9: replace <impl core::fmt::Display for DateTime>::fmt -> core::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace <impl core::fmt::Display for DateTime>::fmt -> core::fmt::Result with Ok(Default::default())
@@ -79,17 +79,17 @@
             "{:04}-{:02}-{:02} {:02}:{:02}:{:02}",
             self.year, self.month, self.day, self.hour, self.minute, self.second
         )
     }
 }
 
 impl core::fmt::Display for DateTime {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
-        f.write_str(&self.to_datetime())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Converts days since the Unix epoch into a proleptic Gregorian date.
 ///
 /// Howard Hinnant's `civil_from_days`. The era trick shifts the calendar so that March is
 /// the first month, which makes the leap day fall at the end of a year and removes every
 /// special case for February.

---- time::tests::the_date_form_is_a_prefix_of_the_datetime_form stdout ----

thread 'time::tests::the_date_form_is_a_prefix_of_the_datetime_form' (605806) panicked at crates/casm-git/src/time.rs:235:9:
assertion `left == right` failed
  left: ""
 right: "2023-11-14 22:13:20"

failures:
    time::tests::the_date_form_is_a_prefix_of_the_datetime_form

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
