*** crates/casm-lsp/src/actions.rs:102:9: delete match arm "stateful-nodes-require-controls" in quick_fixes

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ delete match arm "stateful-nodes-require-controls" in quick_fixes
@@ -94,23 +94,17 @@
     match diagnostic.code.as_str() {
         "services-require-security-controls" => vec![add_controls(
             index,
             node,
             &diagnostic.code,
             "Add the missing security controls",
             SECURITY_CONTROLS,
         )],
-        "stateful-nodes-require-controls" => vec![add_controls(
-            index,
-            node,
-            &diagnostic.code,
-            "Add controls for this datastore",
-            DATASTORE_CONTROLS,
-        )],
+         /* ~ changed by cargo-mutants ~ */
         _ => Vec::new(),
     }
 }
 
 /// Builds the actions that apply to the document as a whole.
 #[must_use]
 pub fn source_actions() -> Vec<CodeAction> {
     vec![

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (633430) panicked at crates/casm-lsp/src/actions.rs:333:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (633428) panicked at crates/casm-lsp/src/actions.rs:333:9:
no quick-fix offered for 'stateful-nodes-require-controls'

failures:
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
