*** crates/casm-lsp/src/actions.rs:116:5: replace source_actions -> Vec<CodeAction> with vec![]

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace source_actions -> Vec<CodeAction> with vec![]
@@ -108,48 +108,17 @@
         )],
         _ => Vec::new(),
     }
 }
 
 /// Builds the actions that apply to the document as a whole.
 #[must_use]
 pub fn source_actions() -> Vec<CodeAction> {
-    vec![
-        CodeAction {
-            title: "CASIMIR: generate Mermaid diagram".to_owned(),
-            kind: ActionKind::Source,
-            edits: Vec::new(),
-            command: Some(Command {
-                id: GENERATE_DIAGRAM.to_owned(),
-                title: "Generate Mermaid diagram".to_owned(),
-            }),
-            resolves: None,
-        },
-        CodeAction {
-            title: "CASIMIR: validate every architecture in the workspace".to_owned(),
-            kind: ActionKind::Source,
-            edits: Vec::new(),
-            command: Some(Command {
-                id: VALIDATE_WORKSPACE.to_owned(),
-                title: "Validate workspace".to_owned(),
-            }),
-            resolves: None,
-        },
-        CodeAction {
-            title: "CASIMIR: reload the pattern library".to_owned(),
-            kind: ActionKind::Source,
-            edits: Vec::new(),
-            command: Some(Command {
-                id: RELOAD_PATTERNS.to_owned(),
-                title: "Reload patterns".to_owned(),
-            }),
-            resolves: None,
-        },
-    ]
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// The controls offered for a service that declares too few.
 const SECURITY_CONTROLS: &[(&str, &str, &str)] = &[
     (
         "security",
         "TODO-AUTHENTICATION",
         "TODO describe how callers of this node are authenticated",

---- actions::tests::source_actions_offer_the_workspace_commands stdout ----

thread 'actions::tests::source_actions_offer_the_workspace_commands' (632007) panicked at crates/casm-lsp/src/actions.rs:551:9:
assertion failed: ids.contains(&GENERATE_DIAGRAM)

failures:
    actions::tests::source_actions_offer_the_workspace_commands

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
