*** crates/casm-lsp/src/actions.rs:183:32: replace >= with < in node_at

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace >= with < in node_at
@@ -175,17 +175,17 @@
     ),
 ];
 
 /// Finds the node whose declaration `span` sits on.
 fn node_at(index: &DocumentIndex, span: Span) -> Option<&NodeEntry> {
     index
         .nodes()
         .iter()
-        .find(|node| span.line >= node.item_line && span.line <= node.last_line)
+        .find(|node| span.line < /* ~ changed by cargo-mutants ~ */ node.item_line && span.line <= node.last_line)
 }
 
 /// Builds an action that appends controls to a node.
 fn add_controls(
     index: &DocumentIndex,
     node: &NodeEntry,
     code: &str,
     title: &str,

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (637218) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (637222) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (637224) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented

test result: FAILED. 204 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
