*** crates/casm-lsp/src/actions.rs:183:50: replace && with || in node_at

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace && with || in node_at
@@ -175,17 +175,17 @@
     ),
 ];
 
 /// Finds the node whose declaration `span` sits on.
 fn node_at(index: &DocumentIndex, span: Span) -> Option<&NodeEntry> {
     index
         .nodes()
         .iter()
-        .find(|node| span.line >= node.item_line && span.line <= node.last_line)
+        .find(|node| span.line >= node.item_line || /* ~ changed by cargo-mutants ~ */ span.line <= node.last_line)
 }
 
 /// Builds an action that appends controls to a node.
 fn add_controls(
     index: &DocumentIndex,
     node: &NodeEntry,
     code: &str,
     title: &str,

---- actions::tests::a_diagnostic_that_is_not_about_a_node_offers_no_fix stdout ----

thread 'actions::tests::a_diagnostic_that_is_not_about_a_node_offers_no_fix' (634771) panicked at crates/casm-lsp/src/actions.rs:571:9:
assertion failed: quick_fixes(&index, &unrelated).is_empty()

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (634774) panicked at crates/casm-lsp/src/actions.rs:491:9:
assertion failed: !diagnostics.iter().any(|d| d.code == "stateful-nodes-require-controls")

failures:
    actions::tests::a_diagnostic_that_is_not_about_a_node_offers_no_fix
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
