*** crates/casm-lsp/src/actions.rs:243:5: replace controls_block -> Option<ControlsBlock> with None

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace controls_block -> Option<ControlsBlock> with None
@@ -235,46 +235,17 @@
 /// Where an existing `controls:` block sits within a node.
 struct ControlsBlock {
     last_line: u32,
     entry_indent: usize,
 }
 
 /// Locates a node's existing `controls:` block, if it has one.
 fn controls_block(index: &DocumentIndex, node: &NodeEntry) -> Option<ControlsBlock> {
-    let in_node = |line: &&LineInfo| line.number >= node.item_line && line.number <= node.last_line;
-
-    let header =
-        index.lines().iter().filter(in_node).find(|line| {
-            line.key.as_deref() == Some("controls") && line.indent == node.field_indent
-        })?;
-
-    // A sequence entry may sit at the same indent as its key, so a list item at the
-    // header's indent is part of the block, not a sibling field.
-    let body: Vec<&LineInfo> = index
-        .lines()
-        .iter()
-        .filter(in_node)
-        .filter(|line| {
-            line.number > header.number
-                && (line.indent > header.indent
-                    || (line.indent == header.indent && line.is_list_item))
-        })
-        .collect();
-
-    // The author's own indentation wins over anything this module would pick.
-    let entry_indent = body
-        .iter()
-        .find(|line| line.is_list_item)
-        .map_or_else(|| header.indent.saturating_add(2), |line| line.indent);
-
-    Some(ControlsBlock {
-        last_line: body.last().map_or(header.number, |line| line.number),
-        entry_indent,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Applies `edits` to `source`, for tests and for clients without an edit engine.
 ///
 /// Edits are applied last-first so that earlier spans keep their offsets.
 #[must_use]
 pub fn apply(source: &str, edits: &[TextEdit]) -> String {
     let mut lines: Vec<String> = source.lines().map(ToOwned::to_owned).collect();

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (642868) panicked at crates/casm-lsp/src/actions.rs:396:9:
assertion `left == right` failed: no second block:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: OIDC
        description: tokens required
    controls:
      - type: security

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (642869) panicked at crates/casm-lsp/src/actions.rs:425:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    type: service
    controls:
    - type: security
      standard: OIDC
      description: tokens required
    controls:
      - type: security

failures:
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
