*** crates/casm-lsp/src/actions.rs:243:68: replace && with || in controls_block

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace && with || in controls_block
@@ -235,17 +235,17 @@
 /// Where an existing `controls:` block sits within a node.
 struct ControlsBlock {
     last_line: u32,
     entry_indent: usize,
 }
 
 /// Locates a node's existing `controls:` block, if it has one.
 fn controls_block(index: &DocumentIndex, node: &NodeEntry) -> Option<ControlsBlock> {
-    let in_node = |line: &&LineInfo| line.number >= node.item_line && line.number <= node.last_line;
+    let in_node = |line: &&LineInfo| line.number >= node.item_line || /* ~ changed by cargo-mutants ~ */ line.number <= node.last_line;
 
     let header =
         index.lines().iter().filter(in_node).find(|line| {
             line.key.as_deref() == Some("controls") && line.indent == node.field_indent
         })?;
 
     // A sequence entry may sit at the same indent as its key, so a list item at the
     // header's indent is part of the block, not a sibling field.

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (640305) panicked at crates/casm-lsp/src/actions.rs:491:9:
assertion failed: !diagnostics.iter().any(|d| d.code == "stateful-nodes-require-controls")

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (640304) panicked at crates/casm-lsp/src/actions.rs:523:9:
assertion failed: !diagnostics.iter().any(|d| d.code == "services-require-security-controls")

failures:
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
