*** crates/casm-lsp/src/actions.rs:243:83: replace <= with > in controls_block

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace <= with > in controls_block
@@ -235,17 +235,17 @@
 /// Where an existing `controls:` block sits within a node.
 struct ControlsBlock {
     last_line: u32,
     entry_indent: usize,
 }
 
 /// Locates a node's existing `controls:` block, if it has one.
 fn controls_block(index: &DocumentIndex, node: &NodeEntry) -> Option<ControlsBlock> {
-    let in_node = |line: &&LineInfo| line.number >= node.item_line && line.number <= node.last_line;
+    let in_node = |line: &&LineInfo| line.number >= node.item_line && line.number > /* ~ changed by cargo-mutants ~ */ node.last_line;
 
     let header =
         index.lines().iter().filter(in_node).find(|line| {
             line.key.as_deref() == Some("controls") && line.indent == node.field_indent
         })?;
 
     // A sequence entry may sit at the same indent as its key, so a list item at the
     // header's indent is part of the block, not a sibling field.

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (652330) panicked at crates/casm-lsp/src/actions.rs:454:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    type: service
    controls:
    - type: security
      standard: OIDC
      description: tokens required
    controls:
      - type: security

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (652329) panicked at crates/casm-lsp/src/actions.rs:425:9:
assertion `left == right` failed: no second block:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: OIDC
        description: tokens required
    controls:
      - type: security

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (652323) panicked at crates/casm-lsp/src/actions.rs:523:9:
assertion failed: !diagnostics.iter().any(|d| d.code == "services-require-security-controls")

failures:
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
