*** crates/casm-lsp/src/actions.rs:247:53: replace && with || in controls_block

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace && with || in controls_block
@@ -239,17 +239,17 @@
 }
 
 /// Locates a node's existing `controls:` block, if it has one.
 fn controls_block(index: &DocumentIndex, node: &NodeEntry) -> Option<ControlsBlock> {
     let in_node = |line: &&LineInfo| line.number >= node.item_line && line.number <= node.last_line;
 
     let header =
         index.lines().iter().filter(in_node).find(|line| {
-            line.key.as_deref() == Some("controls") && line.indent == node.field_indent
+            line.key.as_deref() == Some("controls") || /* ~ changed by cargo-mutants ~ */ line.indent == node.field_indent
         })?;
 
     // A sequence entry may sit at the same indent as its key, so a list item at the
     // header's indent is part of the block, not a sibling field.
     let body: Vec<&LineInfo> = index
         .lines()
         .iter()
         .filter(in_node)

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (643952) panicked at crates/casm-lsp/src/actions.rs:517:9:
name: x
nodes:
  - name: api
    type: service
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do
  - name: orders-db

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (643949) panicked at crates/casm-lsp/src/actions.rs:408:9:
assertion `left == right` failed: name: x
nodes:
  - name: api
    type: service
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (643953) panicked at crates/casm-lsp/src/actions.rs:485:9:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: A
        description: first
      - type: security
        standard: B
        description: second

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
