*** crates/casm-lsp/src/actions.rs:247:68: replace == with != in controls_block

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace == with != in controls_block
@@ -239,17 +239,17 @@
 }
 
 /// Locates a node's existing `controls:` block, if it has one.
 fn controls_block(index: &DocumentIndex, node: &NodeEntry) -> Option<ControlsBlock> {
     let in_node = |line: &&LineInfo| line.number >= node.item_line && line.number <= node.last_line;
 
     let header =
         index.lines().iter().filter(in_node).find(|line| {
-            line.key.as_deref() == Some("controls") && line.indent == node.field_indent
+            line.key.as_deref() == Some("controls") && line.indent != /* ~ changed by cargo-mutants ~ */ node.field_indent
         })?;
 
     // A sequence entry may sit at the same indent as its key, so a list item at the
     // header's indent is part of the block, not a sibling field.
     let body: Vec<&LineInfo> = index
         .lines()
         .iter()
         .filter(in_node)

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (647717) panicked at crates/casm-lsp/src/actions.rs:425:9:
assertion `left == right` failed: no second block:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: OIDC
        description: tokens required
    controls:
      - type: security

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (647718) panicked at crates/casm-lsp/src/actions.rs:454:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    type: service
    controls:
    - type: security
      standard: OIDC
      description: tokens required
    controls:
      - type: security

failures:
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
