*** crates/casm-lsp/src/actions.rs:257:25: replace > with >= in controls_block

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace > with >= in controls_block
@@ -249,17 +249,17 @@
 
     // A sequence entry may sit at the same indent as its key, so a list item at the
     // header's indent is part of the block, not a sibling field.
     let body: Vec<&LineInfo> = index
         .lines()
         .iter()
         .filter(in_node)
         .filter(|line| {
-            line.number > header.number
+            line.number >= /* ~ changed by cargo-mutants ~ */ header.number
                 && (line.indent > header.indent
                     || (line.indent == header.indent && line.is_list_item))
         })
         .collect();
 
     // The author's own indentation wins over anything this module would pick.
     let entry_indent = body
         .iter()

*** result: Success
