*** crates/casm-lsp/src/actions.rs:259:21: replace || with && in controls_block

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace || with && in controls_block
@@ -251,17 +251,17 @@
     // header's indent is part of the block, not a sibling field.
     let body: Vec<&LineInfo> = index
         .lines()
         .iter()
         .filter(in_node)
         .filter(|line| {
             line.number > header.number
                 && (line.indent > header.indent
-                    || (line.indent == header.indent && line.is_list_item))
+                    && /* ~ changed by cargo-mutants ~ */ (line.indent == header.indent && line.is_list_item))
         })
         .collect();
 
     // The author's own indentation wins over anything this module would pick.
     let entry_indent = body
         .iter()
         .find(|line| line.is_list_item)
         .map_or_else(|| header.indent.saturating_add(2), |line| line.indent);

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (652830) panicked at crates/casm-lsp/src/actions.rs:454:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION

failures:
    actions::tests::appended_controls_adopt_the_authors_indentation

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
