*** crates/casm-lsp/src/actions.rs:259:54: replace && with || in controls_block

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace && with || in controls_block
@@ -251,17 +251,17 @@
     // header's indent is part of the block, not a sibling field.
     let body: Vec<&LineInfo> = index
         .lines()
         .iter()
         .filter(in_node)
         .filter(|line| {
             line.number > header.number
                 && (line.indent > header.indent
-                    || (line.indent == header.indent && line.is_list_item))
+                    || (line.indent == header.indent || /* ~ changed by cargo-mutants ~ */ line.is_list_item))
         })
         .collect();
 
     // The author's own indentation wins over anything this module would pick.
     let entry_indent = body
         .iter()
         .find(|line| line.is_list_item)
         .map_or_else(|| header.indent.saturating_add(2), |line| line.indent);

*** result: Success
