*** crates/casm-lsp/src/actions.rs:280:5: replace apply -> String with String::new()

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace apply -> String with String::new()
@@ -272,39 +272,17 @@
     })
 }
 
 /// Applies `edits` to `source`, for tests and for clients without an edit engine.
 ///
 /// Edits are applied last-first so that earlier spans keep their offsets.
 #[must_use]
 pub fn apply(source: &str, edits: &[TextEdit]) -> String {
-    let mut lines: Vec<String> = source.lines().map(ToOwned::to_owned).collect();
-
-    let mut ordered: Vec<&TextEdit> = edits.iter().collect();
-    ordered.sort_by_key(|edit| core::cmp::Reverse(edit.span));
-
-    for edit in ordered {
-        let Some(line) = lines.get_mut(usize::try_from(edit.span.line).unwrap_or(usize::MAX))
-        else {
-            continue;
-        };
-        let start = crate::text::utf16_to_byte(line, edit.span.start);
-        let end = crate::text::utf16_to_byte(line, edit.span.end);
-        let (Some(head), Some(tail)) = (line.get(..start), line.get(end..)) else {
-            continue;
-        };
-        *line = format!("{head}{}{tail}", edit.new_text);
-    }
-
-    let mut out = lines.join("\n");
-    if source.ends_with('\n') {
-        out.push('\n');
-    }
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (659179) panicked at crates/casm-lsp/src/actions.rs:461:9:

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (659181) panicked at crates/casm-lsp/src/actions.rs:361:9:

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (659175) panicked at crates/casm-lsp/src/actions.rs:386:9:
assertion `left == right` failed: 
  left: 0
 right: 1

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::applying_an_out_of_range_edit_is_a_no_op_rather_than_a_panic
    actions::tests::applying_no_edits_leaves_the_document_untouched
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    actions::tests::several_edits_apply_without_disturbing_each_othe

test result: FAILED. 203 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
