*** crates/casm-lsp/src/actions.rs:90:5: replace quick_fixes -> Vec<CodeAction> with vec![]

*** mutation diff:
--- crates/casm-lsp/src/actions.rs
+++ replace quick_fixes -> Vec<CodeAction> with vec![]
@@ -82,37 +82,17 @@
 /// A client that watches files gets reloads for free. This exists for the ones that do
 /// not, and for the case a watcher cannot see: a library created, moved, or checked out
 /// after the session began.
 pub const RELOAD_PATTERNS: &str = "casm.reloadPatterns";
 
 /// Builds the quick-fixes available for `diagnostic`.
 #[must_use]
 pub fn quick_fixes(index: &DocumentIndex, diagnostic: &Diagnostic) -> Vec<CodeAction> {
-    let Some(node) = node_at(index, diagnostic.span) else {
-        return Vec::new();
-    };
-
-    match diagnostic.code.as_str() {
-        "services-require-security-controls" => vec![add_controls(
-            index,
-            node,
-            &diagnostic.code,
-            "Add the missing security controls",
-            SECURITY_CONTROLS,
-        )],
-        "stateful-nodes-require-controls" => vec![add_controls(
-            index,
-            node,
-            &diagnostic.code,
-            "Add controls for this datastore",
-            DATASTORE_CONTROLS,
-        )],
-        _ => Vec::new(),
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Builds the actions that apply to the document as a whole.
 #[must_use]
 pub fn source_actions() -> Vec<CodeAction> {
     vec![
         CodeAction {
             title: "CASIMIR: generate Mermaid diagram".to_owned(),

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (629046) panicked at crates/casm-lsp/src/actions.rs:319:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (629050) panicked at crates/casm-lsp/src/actions.rs:319:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (629051) panicked at crates/casm-lsp/src/actions.rs:519:20:
index out of bounds: the len is 0 but the index is 0

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented

test result: FAILED. 204 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
