*** crates/casm-lsp/src/completion.rs:240:42: replace && with || in key_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ replace && with || in key_completions
@@ -232,17 +232,17 @@
     let prefix = before_cursor
         .trim_start()
         .trim_start_matches("- ")
         .trim_start()
         .to_owned();
 
     // Inside `bind:` the keys are roles the claimed pattern defines, not a fixed
     // vocabulary, so they come from the library rather than from `schema`.
-    if line.section == Section::Patterns && line.block == Block::Bindings {
+    if line.section == Section::Patterns || /* ~ changed by cargo-mutants ~ */ line.block == Block::Bindings {
         let roles = enclosing_pattern(index, patterns, line.number)
             .map(|pattern| {
                 pattern
                     .requirements()
                     .iter()
                     .map(Completion::role)
                     .collect()
             })

---- completion::tests::a_claim_offers_the_claim_keys stdout ----

thread 'completion::tests::a_claim_offers_the_claim_keys' (662881) panicked at crates/casm-lsp/src/completion.rs:722:9:
assertion `left == right` failed
  left: BindingRoleKey
 right: ClaimKey

failures:
    completion::tests::a_claim_offers_the_claim_keys

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
