*** crates/casm-lsp/src/completion.rs:240:56: replace == with != in key_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ replace == with != in key_completions
@@ -232,17 +232,17 @@
     let prefix = before_cursor
         .trim_start()
         .trim_start_matches("- ")
         .trim_start()
         .to_owned();
 
     // Inside `bind:` the keys are roles the claimed pattern defines, not a fixed
     // vocabulary, so they come from the library rather than from `schema`.
-    if line.section == Section::Patterns && line.block == Block::Bindings {
+    if line.section == Section::Patterns && line.block != /* ~ changed by cargo-mutants ~ */ Block::Bindings {
         let roles = enclosing_pattern(index, patterns, line.number)
             .map(|pattern| {
                 pattern
                     .requirements()
                     .iter()
                     .map(Completion::role)
                     .collect()
             })

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (667202) panicked at crates/casm-lsp/src/completion.rs:763:9:
assertion `left == right` failed
  left: ClaimKey
 right: BindingRoleKey

---- completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library stdout ----

thread 'completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library' (667201) panicked at crates/casm-lsp/src/completion.rs:786:9:
assertion `left == right` failed
  left: ClaimKey
 right: BindingRoleKey

---- completion::tests::a_claim_offers_the_claim_keys stdout ----

thread 'completion::tests::a_claim_offers_the_claim_keys' (667205) panicked at crates/casm-lsp/src/completion.rs:722:9:
assertion `left == right` failed
  left: BindingRoleKey
 right: ClaimKey

failures:
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    completion::tests::a_claim_offers_the_claim_keys

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
