*** crates/casm-lsp/src/completion.rs:297:5: replace enclosing_pattern -> Option<&'a Pattern> with None

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ replace enclosing_pattern -> Option<&'a Pattern> with None
@@ -289,27 +289,17 @@
 /// Matched by the nearest claim opening at or above `line`, rather than by a line range: a
 /// blank line inside a half-written `bind:` block does not extend the entry, and the
 /// author completing on exactly that line is the case worth serving.
 fn enclosing_pattern<'a>(
     index: &DocumentIndex,
     patterns: &'a [Pattern],
     line: u32,
 ) -> Option<&'a Pattern> {
-    let reference = index
-        .claims()
-        .iter()
-        .rev()
-        .find(|claim| claim.item_line <= line)?
-        .reference
-        .as_deref()?;
-
-    patterns
-        .iter()
-        .find(|pattern| pattern.reference() == reference)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Completions for a position that is writing a value.
 fn value_completions(
     index: &DocumentIndex,
     patterns: &[Pattern],
     section: Section,
     block: Block,

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (663479) panicked at crates/casm-lsp/src/completion.rs:754:9:
assertion `left == right` failed
  left: []
 right: ["edge", "application"]

failures:
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
