*** crates/casm-lsp/src/completion.rs:301:39: replace <= with > in enclosing_pattern

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ replace <= with > in enclosing_pattern
@@ -293,17 +293,17 @@
     index: &DocumentIndex,
     patterns: &'a [Pattern],
     line: u32,
 ) -> Option<&'a Pattern> {
     let reference = index
         .claims()
         .iter()
         .rev()
-        .find(|claim| claim.item_line <= line)?
+        .find(|claim| claim.item_line > /* ~ changed by cargo-mutants ~ */ line)?
         .reference
         .as_deref()?;
 
     patterns
         .iter()
         .find(|pattern| pattern.reference() == reference)
 }

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (666280) panicked at crates/casm-lsp/src/completion.rs:764:9:
assertion `left == right` failed
  left: []
 right: ["edge", "application"]

failures:
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
