*** crates/casm-lsp/src/completion.rs:307:45: replace == with != in enclosing_pattern

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ replace == with != in enclosing_pattern
@@ -299,17 +299,17 @@
         .iter()
         .rev()
         .find(|claim| claim.item_line <= line)?
         .reference
         .as_deref()?;
 
     patterns
         .iter()
-        .find(|pattern| pattern.reference() == reference)
+        .find(|pattern| pattern.reference() != /* ~ changed by cargo-mutants ~ */ reference)
 }
 
 /// Completions for a position that is writing a value.
 fn value_completions(
     index: &DocumentIndex,
     patterns: &[Pattern],
     section: Section,
     block: Block,

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (667665) panicked at crates/casm-lsp/src/completion.rs:764:9:
assertion `left == right` failed
  left: []
 right: ["edge", "application"]

failures:
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
