*** crates/casm-lsp/src/completion.rs:327:9: delete match arm (Section::Patterns, Block::None, Some("pattern")) in value_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ delete match arm (Section::Patterns, Block::None, Some("pattern")) in value_completions
@@ -319,23 +319,17 @@
 ) -> CompletionResult {
     let prefix = before_cursor
         .get(separator.saturating_add(1)..)
         .unwrap_or("")
         .trim()
         .to_owned();
 
     let (context, terms) = match (section, block, key) {
-        (Section::Patterns, Block::None, Some("pattern")) => {
-            return CompletionResult {
-                context: CompletionContext::PatternReferenceValue,
-                prefix,
-                items: patterns.iter().map(Completion::pattern).collect(),
-            };
-        }
+         /* ~ changed by cargo-mutants ~ */
         // Every key inside `bind:` takes a node name, whatever the role is called.
         (Section::Patterns, Block::Bindings, _) => {
             return CompletionResult {
                 context: CompletionContext::NodeNameValue,
                 prefix,
                 items: index
                     .nodes()
                     .iter()

---- completion::tests::a_pattern_reference_is_completed_from_the_library stdout ----

thread 'completion::tests::a_pattern_reference_is_completed_from_the_library' (672000) panicked at crates/casm-lsp/src/completion.rs:736:9:
assertion `left == right` failed
  left: None
 right: PatternReferenceValue

---- completion::tests::an_empty_library_offers_no_references_rather_than_guessing stdout ----

thread 'completion::tests::an_empty_library_offers_no_references_rather_than_guessing' (672006) panicked at crates/casm-lsp/src/completion.rs:747:9:
assertion `left == right` failed
  left: None
 right: PatternReferenceValue

failures:
    completion::tests::a_pattern_reference_is_completed_from_the_library
    completion::tests::an_empty_library_offers_no_references_rather_than_guessing

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
