*** crates/casm-lsp/src/completion.rs:346:9: delete match arm (Section::Nodes, Block::None, Some("type")) in value_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ delete match arm (Section::Nodes, Block::None, Some("type")) in value_completions
@@ -338,19 +338,17 @@
                 prefix,
                 items: index
                     .nodes()
                     .iter()
                     .map(|node| Completion::reference(&node.name, node.node_type.as_deref()))
                     .collect(),
             };
         }
-        (Section::Nodes, Block::None, Some("type")) => {
-            (CompletionContext::NodeTypeValue, NODE_TYPES)
-        }
+         /* ~ changed by cargo-mutants ~ */
         (Section::Relationships, Block::None, Some("type")) => {
             (CompletionContext::RelationshipTypeValue, RELATIONSHIP_TYPES)
         }
         (_, Block::Controls, Some("type")) => (CompletionContext::ControlTypeValue, CONTROL_TYPES),
         (_, _, Some("protocol")) => (CompletionContext::ProtocolValue, PROTOCOLS),
         (Section::Relationships, Block::None, Some("source" | "target")) => {
             return CompletionResult {
                 context: CompletionContext::NodeNameValue,

---- completion::tests::a_node_type_value_offers_node_types stdout ----

thread 'completion::tests::a_node_type_value_offers_node_types' (671701) panicked at crates/casm-lsp/src/completion.rs:428:9:
assertion `left == right` failed
  left: None
 right: NodeTypeValue

---- completion::tests::a_value_completion_inserts_the_bare_label stdout ----

thread 'completion::tests::a_value_completion_inserts_the_bare_label' (671709) panicked at crates/casm-lsp/src/completion.rs:549:14:
offered

---- completion::tests::completion_works_immediately_after_a_colon_with_no_space_yet stdout ----

thread 'completion::tests::completion_works_immediately_after_a_colon_with_no_space_yet' (671719) panicked at crates/casm-lsp/src/completion.rs:616:9:
assertion `left == right` failed
  left: None
 right: NodeTypeValue

failures:
    completion::tests::a_node_type_value_offers_node_types
    completion::tests::a_value_completion_inserts_the_bare_label
    completion::tests::completion_works_immediately_after_a_colon_with_no_space_yet
    completion::tests::the_typed_prefix_is_reported_for_clients_that_want_it

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
