*** crates/casm-lsp/src/completion.rs:349:9: delete match arm (Section::Relationships, Block::None, Some("type")) in value_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ delete match arm (Section::Relationships, Block::None, Some("type")) in value_completions
@@ -341,19 +341,17 @@
                     .iter()
                     .map(|node| Completion::reference(&node.name, node.node_type.as_deref()))
                     .collect(),
             };
         }
         (Section::Nodes, Block::None, Some("type")) => {
             (CompletionContext::NodeTypeValue, NODE_TYPES)
         }
-        (Section::Relationships, Block::None, Some("type")) => {
-            (CompletionContext::RelationshipTypeValue, RELATIONSHIP_TYPES)
-        }
+         /* ~ changed by cargo-mutants ~ */
         (_, Block::Controls, Some("type")) => (CompletionContext::ControlTypeValue, CONTROL_TYPES),
         (_, _, Some("protocol")) => (CompletionContext::ProtocolValue, PROTOCOLS),
         (Section::Relationships, Block::None, Some("source" | "target")) => {
             return CompletionResult {
                 context: CompletionContext::NodeNameValue,
                 prefix,
                 items: index
                     .nodes()

---- completion::tests::a_relationship_type_value_offers_relationship_types_not_node_types stdout ----

thread 'completion::tests::a_relationship_type_value_offers_relationship_types_not_node_types' (672139) panicked at crates/casm-lsp/src/completion.rs:439:9:
assertion `left == right` failed
  left: None
 right: RelationshipTypeValue

failures:
    completion::tests::a_relationship_type_value_offers_relationship_types_not_node_types

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
