*** crates/casm-lsp/src/completion.rs:352:9: delete match arm (_, Block::Controls, Some("type")) in value_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ delete match arm (_, Block::Controls, Some("type")) in value_completions
@@ -344,17 +344,17 @@
             };
         }
         (Section::Nodes, Block::None, Some("type")) => {
             (CompletionContext::NodeTypeValue, NODE_TYPES)
         }
         (Section::Relationships, Block::None, Some("type")) => {
             (CompletionContext::RelationshipTypeValue, RELATIONSHIP_TYPES)
         }
-        (_, Block::Controls, Some("type")) => (CompletionContext::ControlTypeValue, CONTROL_TYPES),
+         /* ~ changed by cargo-mutants ~ */
         (_, _, Some("protocol")) => (CompletionContext::ProtocolValue, PROTOCOLS),
         (Section::Relationships, Block::None, Some("source" | "target")) => {
             return CompletionResult {
                 context: CompletionContext::NodeNameValue,
                 prefix,
                 items: index
                     .nodes()
                     .iter()

---- completion::tests::a_control_type_value_offers_control_types stdout ----

thread 'completion::tests::a_control_type_value_offers_control_types' (675029) panicked at crates/casm-lsp/src/completion.rs:455:9:
assertion `left == right` failed
  left: None
 right: ControlTypeValue

failures:
    completion::tests::a_control_type_value_offers_control_types

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
