*** crates/casm-lsp/src/completion.rs:353:9: delete match arm (_, _, Some("protocol")) in value_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ delete match arm (_, _, Some("protocol")) in value_completions
@@ -345,17 +345,17 @@
         }
         (Section::Nodes, Block::None, Some("type")) => {
             (CompletionContext::NodeTypeValue, NODE_TYPES)
         }
         (Section::Relationships, Block::None, Some("type")) => {
             (CompletionContext::RelationshipTypeValue, RELATIONSHIP_TYPES)
         }
         (_, Block::Controls, Some("type")) => (CompletionContext::ControlTypeValue, CONTROL_TYPES),
-        (_, _, Some("protocol")) => (CompletionContext::ProtocolValue, PROTOCOLS),
+         /* ~ changed by cargo-mutants ~ */
         (Section::Relationships, Block::None, Some("source" | "target")) => {
             return CompletionResult {
                 context: CompletionContext::NodeNameValue,
                 prefix,
                 items: index
                     .nodes()
                     .iter()
                     .map(|node| Completion::reference(&node.name, node.node_type.as_deref()))

---- completion::tests::a_protocol_value_offers_protocols_in_both_places_it_appears stdout ----

thread 'completion::tests::a_protocol_value_offers_protocols_in_both_places_it_appears' (675763) panicked at crates/casm-lsp/src/completion.rs:470:9:
assertion `left == right` failed
  left: None
 right: ProtocolValue

failures:
    completion::tests::a_protocol_value_offers_protocols_in_both_places_it_appears

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
