*** crates/casm-lsp/src/completion.rs:354:9: delete match arm (Section::Relationships, Block::None, Some("source" | "target")) in value_completions

*** mutation diff:
--- crates/casm-lsp/src/completion.rs
+++ delete match arm (Section::Relationships, Block::None, Some("source" | "target")) in value_completions
@@ -346,27 +346,17 @@
         (Section::Nodes, Block::None, Some("type")) => {
             (CompletionContext::NodeTypeValue, NODE_TYPES)
         }
         (Section::Relationships, Block::None, Some("type")) => {
             (CompletionContext::RelationshipTypeValue, RELATIONSHIP_TYPES)
         }
         (_, Block::Controls, Some("type")) => (CompletionContext::ControlTypeValue, CONTROL_TYPES),
         (_, _, Some("protocol")) => (CompletionContext::ProtocolValue, PROTOCOLS),
-        (Section::Relationships, Block::None, Some("source" | "target")) => {
-            return CompletionResult {
-                context: CompletionContext::NodeNameValue,
-                prefix,
-                items: index
-                    .nodes()
-                    .iter()
-                    .map(|node| Completion::reference(&node.name, node.node_type.as_deref()))
-                    .collect(),
-            };
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {
             return CompletionResult {
                 context: CompletionContext::None,
                 prefix,
                 items: Vec::new(),
             };
         }
     };

---- completion::tests::an_endpoint_completion_annotates_each_node_with_its_type stdout ----

thread 'completion::tests::an_endpoint_completion_annotates_each_node_with_its_type' (676607) panicked at crates/casm-lsp/src/completion.rs:490:14:
declared

---- completion::tests::an_endpoint_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::an_endpoint_offers_the_nodes_this_document_declares' (676608) panicked at crates/casm-lsp/src/completion.rs:472:9:
assertion `left == right` failed
  left: None
 right: NodeNameValue

failures:
    completion::tests::an_endpoint_completion_annotates_each_node_with_its_type
    completion::tests::an_endpoint_offers_the_nodes_this_document_declares

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
