*** crates/casm-lsp/src/diagnostics.rs:107:5: replace analyse -> Analysis with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace analyse -> Analysis with Default::default()
@@ -99,48 +99,17 @@
 #[must_use]
 pub fn analyse(
     source: &str,
     path: &Path,
     index: &DocumentIndex,
     config: &ValidatorConfig,
     patterns: &[Pattern],
 ) -> Analysis {
-    let architecture = match casm_parser::parse_str(source, path) {
-        Ok(architecture) => architecture,
-        Err(error) => {
-            return Analysis {
-                architecture: None,
-                diagnostics: vec![from_parse_error(&error, index)],
-            };
-        }
-    };
-
-    let report = Validator::with_config(config.clone())
-        .with_patterns(patterns.to_vec())
-        .validate(&architecture);
-    let diagnostics = report
-        .diagnostics
-        .iter()
-        .map(|finding| Diagnostic {
-            span: anchor(index, &finding.subject),
-            severity: finding.severity.into(),
-            code: finding.rule.clone(),
-            message: match &finding.suggestion {
-                Some(hint) => format!("{}\n\nSuggestion: {hint}", finding.message),
-                None => finding.message.clone(),
-            },
-            related: related_locations(index, &finding.subject),
-        })
-        .collect();
-
-    Analysis {
-        architecture: Some(architecture),
-        diagnostics,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a parse failure into a located diagnostic.
 fn from_parse_error(error: &casm_parser::ParseError, index: &DocumentIndex) -> Diagnostic {
     let span = match error.location() {
         // The parser reports 1-indexed positions; LSP is 0-indexed.
         Some(location) => {
             let line = u32::try_from(location.line).unwrap_or(1).saturating_sub(1);

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (685075) panicked at crates/casm-lsp/src/actions.rs:336:32:
'services-require-security-controls' did not fire on:
name: x
nodes:
  - name: api
    type: service

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (685079) panicked at crates/casm-lsp/src/actions.rs:336:32:
'stateful-nodes-require-controls' did not fire on:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: A
        description: first
      - type: security
        standard: B

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (685081) panicked at crates/casm-lsp/src/actions.rs:336:32:
'stateful-nodes-require-controls' did not fire on:
name: x
nodes:
  - name: orders-db
    type: database

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_diagnostic_with_no_fix_offers_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented

test result: FAILED. 182 passed; 33 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
