*** crates/casm-lsp/src/diagnostics.rs:177:5: replace unresolved_reference_span -> Span with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace unresolved_reference_span -> Span with Default::default()
@@ -169,30 +169,17 @@
     }
 }
 
 /// Locates an unresolved-reference error on the endpoint that failed.
 ///
 /// These carry no line or column — the parser resolves references after positions are
 /// gone — but the offending text is known, so the index can find it.
 fn unresolved_reference_span(error: &casm_parser::ParseError, index: &DocumentIndex) -> Span {
-    if let casm_parser::ParseError::UnresolvedReference { reference, .. } = error {
-        let found = index
-            .symbols()
-            .iter()
-            .find(|symbol| {
-                matches!(symbol.kind, crate::index::SymbolKind::NodeReference(_))
-                    && &symbol.text == reference
-            })
-            .map(|symbol| symbol.span);
-        if let Some(span) = found {
-            return span;
-        }
-    }
-    Span::line_start(0)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Finds the span a validator subject should be underlined at.
 fn anchor(index: &DocumentIndex, subject: &Subject) -> Span {
     match subject {
         Subject::Architecture => first_line_span(index),
         // On the `pattern:` value itself. A conformance finding is about the claim, and
         // the claim is a line the author wrote.

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (681974) panicked at crates/casm-lsp/src/diagnostics.rs:350:9:
assertion `left == right` failed: the `target: ghost` line
  left: 0
 right: 6

failures:
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
