*** crates/casm-lsp/src/diagnostics.rs:183:37: replace == with != in unresolved_reference_span

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace == with != in unresolved_reference_span
@@ -175,17 +175,17 @@
 /// gone — but the offending text is known, so the index can find it.
 fn unresolved_reference_span(error: &casm_parser::ParseError, index: &DocumentIndex) -> Span {
     if let casm_parser::ParseError::UnresolvedReference { reference, .. } = error {
         let found = index
             .symbols()
             .iter()
             .find(|symbol| {
                 matches!(symbol.kind, crate::index::SymbolKind::NodeReference(_))
-                    && &symbol.text == reference
+                    && &symbol.text != /* ~ changed by cargo-mutants ~ */ reference
             })
             .map(|symbol| symbol.span);
         if let Some(span) = found {
             return span;
         }
     }
     Span::line_start(0)
 }

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (684200) panicked at crates/casm-lsp/src/diagnostics.rs:363:9:
assertion `left == right` failed: the `target: ghost` line
  left: 5
 right: 6

failures:
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
