*** crates/casm-lsp/src/diagnostics.rs:195:5: replace anchor -> Span with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace anchor -> Span with Default::default()
@@ -187,40 +187,17 @@
             return span;
         }
     }
     Span::line_start(0)
 }
 
 /// Finds the span a validator subject should be underlined at.
 fn anchor(index: &DocumentIndex, subject: &Subject) -> Span {
-    match subject {
-        Subject::Architecture => first_line_span(index),
-        // On the `pattern:` value itself. A conformance finding is about the claim, and
-        // the claim is a line the author wrote.
-        Subject::Pattern { reference } => index.claim_of(reference).map_or_else(
-            || first_line_span(index),
-            crate::index::ClaimEntry::anchor_span,
-        ),
-        Subject::Node { name, .. } => index
-            .node_named(name)
-            .map_or_else(|| first_line_span(index), |node| node.name_span),
-        Subject::Relationship { source, target } => {
-            index.relationship_between(source, target).map_or_else(
-                || first_line_span(index),
-                crate::index::RelationshipEntry::anchor_span,
-            )
-        }
-        Subject::NodeSet { names } => names
-            .iter()
-            .filter_map(|name| index.node_named(name))
-            .map(|node| node.name_span)
-            .min()
-            .unwrap_or_else(|| first_line_span(index)),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Additional locations implicated in a finding.
 fn related_locations(index: &DocumentIndex, subject: &Subject) -> Vec<(String, Span)> {
     let Subject::NodeSet { names } = subject else {
         return Vec::new();
     };

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (686451) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (686455) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (686457) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on

test result: FAILED. 199 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
