*** crates/casm-lsp/src/diagnostics.rs:223:5: replace related_locations -> Vec<(String, Span)> with vec![]

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace related_locations -> Vec<(String, Span)> with vec![]
@@ -215,33 +215,17 @@
             .map(|node| node.name_span)
             .min()
             .unwrap_or_else(|| first_line_span(index)),
     }
 }
 
 /// Additional locations implicated in a finding.
 fn related_locations(index: &DocumentIndex, subject: &Subject) -> Vec<(String, Span)> {
-    let Subject::NodeSet { names } = subject else {
-        return Vec::new();
-    };
-
-    // Every member of a cycle is part of the problem, and the author needs to see all of
-    // them to choose which edge to break.
-    names
-        .iter()
-        .filter_map(|name| {
-            index.node_named(name).map(|node| {
-                (
-                    format!("`{name}` participates in this cycle"),
-                    node.name_span,
-                )
-            })
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// The span covering the document's first line.
 fn first_line_span(index: &DocumentIndex) -> Span {
     let width = index.raw_line(0).map_or(0, crate::text::utf16_len);
     Span::new(0, 0, width)
 }

---- diagnostics::tests::a_cycle_is_anchored_on_its_first_participant_with_the_rest_related stdout ----

thread 'diagnostics::tests::a_cycle_is_anchored_on_its_first_participant_with_the_rest_related' (687324) panicked at crates/casm-lsp/src/diagnostics.rs:404:9:
assertion `left == right` failed: both participants are listed
  left: 0
 right: 2

failures:
    diagnostics::tests::a_cycle_is_anchored_on_its_first_participant_with_the_rest_related

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
