*** crates/casm-lsp/src/diagnostics.rs:244:5: replace first_line_span -> Span with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace first_line_span -> Span with Default::default()
@@ -236,18 +236,17 @@
                 )
             })
         })
         .collect()
 }
 
 /// The span covering the document's first line.
 fn first_line_span(index: &DocumentIndex) -> Span {
-    let width = index.raw_line(0).map_or(0, crate::text::utf16_len);
-    Span::new(0, 0, width)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

*** result: Success
