*** crates/casm-lsp/src/diagnostics.rs:85:9: replace Analysis::has_errors -> bool with true

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace Analysis::has_errors -> bool with true
@@ -77,19 +77,17 @@
     /// Every finding, in rule order.
     pub diagnostics: Vec<Diagnostic>,
 }
 
 impl Analysis {
     /// Returns `true` if anything blocks the document from being used.
     #[must_use]
     pub fn has_errors(&self) -> bool {
-        self.diagnostics
-            .iter()
-            .any(|d| d.severity == Severity::Error)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Parses and validates `source`, locating every finding in the text.
 ///
 /// `path` is used only for the parser's error attribution. `patterns` is the loaded
 /// library: a claim naming a pattern it does not hold is reported as unchecked, so an
 /// empty library is a valid input rather than an error.

---- diagnostics::tests::has_errors_distinguishes_errors_from_warnings stdout ----

thread 'diagnostics::tests::has_errors_distinguishes_errors_from_warnings' (679562) panicked at crates/casm-lsp/src/diagnostics.rs:507:9:
assertion failed: !run(warning_only).has_errors()

failures:
    diagnostics::tests::has_errors_distinguishes_errors_from_warnings

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
