*** crates/casm-lsp/src/diagnostics.rs:87:33: replace == with != in Analysis::has_errors

*** mutation diff:
--- crates/casm-lsp/src/diagnostics.rs
+++ replace == with != in Analysis::has_errors
@@ -79,17 +79,17 @@
 }
 
 impl Analysis {
     /// Returns `true` if anything blocks the document from being used.
     #[must_use]
     pub fn has_errors(&self) -> bool {
         self.diagnostics
             .iter()
-            .any(|d| d.severity == Severity::Error)
+            .any(|d| d.severity != /* ~ changed by cargo-mutants ~ */ Severity::Error)
     }
 }
 
 /// Parses and validates `source`, locating every finding in the text.
 ///
 /// `path` is used only for the parser's error attribution. `patterns` is the loaded
 /// library: a claim naming a pattern it does not hold is reported as unchecked, so an
 /// empty library is a valid input rather than an error.

---- diagnostics::tests::has_errors_distinguishes_errors_from_warnings stdout ----

thread 'diagnostics::tests::has_errors_distinguishes_errors_from_warnings' (679003) panicked at crates/casm-lsp/src/diagnostics.rs:509:9:
assertion failed: !run(warning_only).has_errors()

failures:
    diagnostics::tests::has_errors_distinguishes_errors_from_warnings

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
