*** crates/casm-lsp/src/documents.rs:133:9: replace DocumentStore::reconfigure with ()

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::reconfigure with ()
@@ -125,18 +125,17 @@
     }
 
     /// Replaces the validator configuration and re-analyses every open document.
     ///
     /// Called when the client changes settings. Re-analysing eagerly means the next
     /// keystroke shows diagnostics consistent with the new thresholds rather than stale
     /// ones.
     pub fn reconfigure(&mut self, config: ValidatorConfig) {
-        self.config = config;
-        self.reanalyse_all();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Replaces the pattern library and re-analyses every open document.
     ///
     /// Called when the workspace is resolved and again whenever a pattern file changes.
     /// Re-analysing matters more here than for a threshold change: editing a pattern moves
     /// findings in every document that claims it, none of which the author has touched.
     pub fn load_patterns(&mut self, patterns: Vec<Pattern>) {

---- documents::tests::reconfiguring_re_analyses_every_open_document stdout ----

thread 'documents::tests::reconfiguring_re_analyses_every_open_document' (696475) panicked at crates/casm-lsp/src/documents.rs:572:9:
stale diagnostics survived a settings change

failures:
    documents::tests::reconfiguring_re_analyses_every_open_document

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
