*** crates/casm-lsp/src/documents.rs:149:9: replace DocumentStore::reanalyse_all with ()

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::reanalyse_all with ()
@@ -141,24 +141,17 @@
     /// findings in every document that claims it, none of which the author has touched.
     pub fn load_patterns(&mut self, patterns: Vec<Pattern>) {
         self.patterns = patterns;
         self.reanalyse_all();
     }
 
     /// Re-runs analysis over every open document, in place.
     fn reanalyse_all(&mut self) {
-        let uris: Vec<String> = self.documents.keys().cloned().collect();
-        for uri in uris {
-            let Some(existing) = self.documents.get(&uri) else {
-                continue;
-            };
-            let (text, version) = (existing.text.clone(), existing.version);
-            self.upsert(&uri, text, version);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Stores `text` for `uri`, analysing it.
     ///
     /// Analysis runs eagerly on every change rather than behind a debounce timer. It is a
     /// single pass over the lines plus one parse, which is microseconds for any document
     /// under the size cap — cheaper than the machinery a debounce would need, and it
     /// means diagnostics never lag the text.

---- documents::tests::loading_patterns_re_analyses_every_open_document stdout ----

thread 'documents::tests::loading_patterns_re_analyses_every_open_document' (698934) panicked at crates/casm-lsp/src/documents.rs:649:9:
satisfied once it loads, without the client touching the file

---- documents::tests::reconfiguring_re_analyses_every_open_document stdout ----

thread 'documents::tests::reconfiguring_re_analyses_every_open_document' (698937) panicked at crates/casm-lsp/src/documents.rs:566:9:
stale diagnostics survived a settings change

failures:
    documents::tests::loading_patterns_re_analyses_every_open_document
    documents::tests::reconfiguring_re_analyses_every_open_document

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
