*** crates/casm-lsp/src/documents.rs:201:9: replace DocumentStore::get -> Option<&Document> with None

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::get -> Option<&Document> with None
@@ -193,22 +193,17 @@
                 index: DocumentIndex::default(),
                 analysis: Analysis::default(),
                 accessed,
             })
     }
 
     /// Retrieves a document, marking it as recently used.
     pub fn get(&mut self, uri: &str) -> Option<&Document> {
-        self.clock = self.clock.saturating_add(1);
-        let accessed = self.clock;
-
-        let document = self.documents.get_mut(uri)?;
-        document.accessed = accessed;
-        Some(document)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retrieves a document together with the library its features need.
     ///
     /// Completion and hover both need the document *and* the pattern library, which live
     /// on different fields; handing back a pair is what lets a caller holding one lock
     /// borrow both.
     pub fn get_with_patterns(&mut self, uri: &str) -> Option<(&Document, &[Pattern])> {

---- documents::tests::eviction_drops_the_least_recently_used_document stdout ----

thread 'documents::tests::eviction_drops_the_least_recently_used_document' (699925) panicked at crates/casm-lsp/src/documents.rs:477:9:
assertion failed: store.get("file:///old.yaml").is_some()

failures:
    documents::tests::eviction_drops_the_least_recently_used_document

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
