*** crates/casm-lsp/src/documents.rs:215:9: replace DocumentStore::get_with_patterns -> Option<(&Document, &[Pattern])> with None

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::get_with_patterns -> Option<(&Document, &[Pattern])> with None
@@ -207,22 +207,17 @@
     }
 
     /// Retrieves a document together with the library its features need.
     ///
     /// Completion and hover both need the document *and* the pattern library, which live
     /// on different fields; handing back a pair is what lets a caller holding one lock
     /// borrow both.
     pub fn get_with_patterns(&mut self, uri: &str) -> Option<(&Document, &[Pattern])> {
-        self.clock = self.clock.saturating_add(1);
-        let accessed = self.clock;
-
-        let document = self.documents.get_mut(uri)?;
-        document.accessed = accessed;
-        Some((document, &self.patterns))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retrieves a document without affecting eviction order.
     #[must_use]
     pub fn peek(&self, uri: &str) -> Option<&Document> {
         self.documents.get(uri)
     }

---- documents::tests::a_document_and_the_library_are_retrieved_together stdout ----

thread 'documents::tests::a_document_and_the_library_are_retrieved_together' (702016) panicked at crates/casm-lsp/src/documents.rs:669:14:
the document is open

failures:
    documents::tests::a_document_and_the_library_are_retrieved_together

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
