*** crates/casm-lsp/src/documents.rs:226:9: replace DocumentStore::peek -> Option<&Document> with None

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::peek -> Option<&Document> with None
@@ -218,17 +218,17 @@
         let document = self.documents.get_mut(uri)?;
         document.accessed = accessed;
         Some((document, &self.patterns))
     }
 
     /// Retrieves a document without affecting eviction order.
     #[must_use]
     pub fn peek(&self, uri: &str) -> Option<&Document> {
-        self.documents.get(uri)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Forgets a document the client has closed.
     pub fn close(&mut self, uri: &str) -> Option<Document> {
         self.documents.remove(uri)
     }
 
     /// How many documents are held.

---- documents::tests::eviction_drops_the_least_recently_used_document stdout ----

thread 'documents::tests::eviction_drops_the_least_recently_used_document' (703281) panicked at crates/casm-lsp/src/documents.rs:486:9:
recently used, so retained

---- documents::tests::loading_patterns_re_analyses_every_open_document stdout ----

thread 'documents::tests::loading_patterns_re_analyses_every_open_document' (703283) panicked at crates/casm-lsp/src/documents.rs:644:18:
stored

---- documents::tests::peek_does_not_change_the_eviction_order stdout ----

thread 'documents::tests::peek_does_not_change_the_eviction_order' (703284) panicked at crates/casm-lsp/src/documents.rs:522:9:
peeking must not touch

failures:
    documents::tests::eviction_drops_the_least_recently_used_document
    documents::tests::loading_patterns_re_analyses_every_open_document
    documents::tests::peek_does_not_change_the_eviction_order
    documents::tests::reconfiguring_re_analyses_every_open_document
    documents::tests::the_document_just_written_is_never_the_eviction_victim

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
