*** crates/casm-lsp/src/documents.rs:231:9: replace DocumentStore::close -> Option<Document> with None

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::close -> Option<Document> with None
@@ -223,17 +223,17 @@
     /// Retrieves a document without affecting eviction order.
     #[must_use]
     pub fn peek(&self, uri: &str) -> Option<&Document> {
         self.documents.get(uri)
     }
 
     /// Forgets a document the client has closed.
     pub fn close(&mut self, uri: &str) -> Option<Document> {
-        self.documents.remove(uri)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many documents are held.
     #[must_use]
     pub fn len(&self) -> usize {
         self.documents.len()
     }

---- documents::tests::closing_a_document_forgets_it stdout ----

thread 'documents::tests::closing_a_document_forgets_it' (704708) panicked at crates/casm-lsp/src/documents.rs:430:9:
assertion failed: store.close("file:///a.yaml").is_some()

failures:
    documents::tests::closing_a_document_forgets_it

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
