*** crates/casm-lsp/src/documents.rs:237:9: replace DocumentStore::len -> usize with 0

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::len -> usize with 0
@@ -229,17 +229,17 @@
     /// Forgets a document the client has closed.
     pub fn close(&mut self, uri: &str) -> Option<Document> {
         self.documents.remove(uri)
     }
 
     /// How many documents are held.
     #[must_use]
     pub fn len(&self) -> usize {
-        self.documents.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if nothing is held.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.documents.is_empty()
     }

---- documents::tests::a_change_replaces_the_previous_analysis stdout ----

thread 'documents::tests::a_change_replaces_the_previous_analysis' (705649) panicked at crates/casm-lsp/src/documents.rs:406:9:
assertion `left == right` failed: an update is not a second document
  left: 0
 right: 1

---- documents::tests::the_document_just_written_is_never_the_eviction_victim stdout ----

thread 'documents::tests::the_document_just_written_is_never_the_eviction_victim' (705694) panicked at crates/casm-lsp/src/documents.rs:505:9:
assertion `left == right` failed: even though it exceeds the byte budget on its own
  left: 0
 right: 1

---- documents::tests::the_document_count_limit_is_enforced stdout ----

thread 'documents::tests::the_document_count_limit_is_enforced' (705693) panicked at crates/casm-lsp/src/documents.rs:449:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    documents::tests::a_change_replaces_the_previous_analysis
    documents::tests::the_document_count_limit_is_enforced
    documents::tests::the_document_just_written_is_never_the_eviction_victim

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
