*** crates/casm-lsp/src/documents.rs:237:9: replace DocumentStore::len -> usize with 1

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::len -> usize with 1
@@ -229,17 +229,17 @@
     /// Forgets a document the client has closed.
     pub fn close(&mut self, uri: &str) -> Option<Document> {
         self.documents.remove(uri)
     }
 
     /// How many documents are held.
     #[must_use]
     pub fn len(&self) -> usize {
-        self.documents.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if nothing is held.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.documents.is_empty()
     }

---- documents::tests::the_document_count_limit_is_enforced stdout ----

thread 'documents::tests::the_document_count_limit_is_enforced' (706652) panicked at crates/casm-lsp/src/documents.rs:449:9:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    documents::tests::the_document_count_limit_is_enforced

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
