*** crates/casm-lsp/src/documents.rs:243:9: replace DocumentStore::is_empty -> bool with true

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::is_empty -> bool with true
@@ -235,17 +235,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.documents.len()
     }
 
     /// Returns `true` if nothing is held.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.documents.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The total source bytes held.
     #[must_use]
     pub fn total_bytes(&self) -> usize {
         self.documents.values().map(Document::size).sum()
     }

*** result: Success
