*** crates/casm-lsp/src/documents.rs:243:9: replace DocumentStore::is_empty -> bool with false

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::is_empty -> bool with false
@@ -235,17 +235,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.documents.len()
     }
 
     /// Returns `true` if nothing is held.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.documents.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The total source bytes held.
     #[must_use]
     pub fn total_bytes(&self) -> usize {
         self.documents.values().map(Document::size).sum()
     }

---- documents::tests::closing_a_document_forgets_it stdout ----

thread 'documents::tests::closing_a_document_forgets_it' (708950) panicked at crates/casm-lsp/src/documents.rs:431:9:
assertion failed: store.is_empty()

failures:
    documents::tests::closing_a_document_forgets_it

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
