*** crates/casm-lsp/src/documents.rs:255:9: replace DocumentStore::uris -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::uris -> Vec<String> with vec![String::new()]
@@ -247,17 +247,17 @@
     #[must_use]
     pub fn total_bytes(&self) -> usize {
         self.documents.values().map(Document::size).sum()
     }
 
     /// The URIs currently held, in arbitrary order.
     #[must_use]
     pub fn uris(&self) -> Vec<String> {
-        self.documents.keys().cloned().collect()
+        vec![String::new()] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Evicts least-recently-used documents until both limits are satisfied.
     ///
     /// `protected` is never evicted: dropping the document the client just sent would be
     /// visibly broken, however large it is.
     fn enforce_limits(&mut self, protected: &str) {
         while self.documents.len() > self.limits.max_documents

---- reloading_republishes_documents_the_client_never_touched stdout ----

thread 'reloading_republishes_documents_the_client_never_touched' (712612) panicked at crates/casm-lsp/tests/protocol.rs:611:5:
the open document was not republished:
{"jsonrpc":"2.0","result":"casm-lsp: loaded 1 pattern(s) from /tmp/casm-lsp-protocol-reload-712580/patterns","id":2}{"jsonrpc":"2.0","result":null,"id":9000}

failures:
    reloading_republishes_documents_the_client_never_touched

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
