*** crates/casm-lsp/src/documents.rs:263:36: replace > with >= in DocumentStore::enforce_limits

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace > with >= in DocumentStore::enforce_limits
@@ -255,17 +255,17 @@
         self.documents.keys().cloned().collect()
     }
 
     /// Evicts least-recently-used documents until both limits are satisfied.
     ///
     /// `protected` is never evicted: dropping the document the client just sent would be
     /// visibly broken, however large it is.
     fn enforce_limits(&mut self, protected: &str) {
-        while self.documents.len() > self.limits.max_documents
+        while self.documents.len() >= /* ~ changed by cargo-mutants ~ */ self.limits.max_documents
             || self.total_bytes() > self.limits.max_total_bytes
         {
             let Some(victim) = self.least_recently_used(protected) else {
                 break;
             };
             self.documents.remove(&victim);
         }
     }

---- documents::tests::peek_does_not_change_the_eviction_order stdout ----

thread 'documents::tests::peek_does_not_change_the_eviction_order' (724179) panicked at crates/casm-lsp/src/documents.rs:522:9:
peeking must not touch

---- documents::tests::eviction_drops_the_least_recently_used_document stdout ----

thread 'documents::tests::eviction_drops_the_least_recently_used_document' (724176) panicked at crates/casm-lsp/src/documents.rs:482:9:
assertion failed: store.get("file:///old.yaml").is_some()

---- documents::tests::the_document_count_limit_is_enforced stdout ----

thread 'documents::tests::the_document_count_limit_is_enforced' (724183) panicked at crates/casm-lsp/src/documents.rs:449:9:
assertion `left == right` failed
  left: 2
 right: 3

failures:
    documents::tests::eviction_drops_the_least_recently_used_document
    documents::tests::peek_does_not_change_the_eviction_order
    documents::tests::the_document_count_limit_is_enforced

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
