*** crates/casm-lsp/src/documents.rs:263:9: replace DocumentStore::enforce_limits with ()

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::enforce_limits with ()
@@ -255,24 +255,17 @@
         self.documents.keys().cloned().collect()
     }
 
     /// Evicts least-recently-used documents until both limits are satisfied.
     ///
     /// `protected` is never evicted: dropping the document the client just sent would be
     /// visibly broken, however large it is.
     fn enforce_limits(&mut self, protected: &str) {
-        while self.documents.len() > self.limits.max_documents
-            || self.total_bytes() > self.limits.max_total_bytes
-        {
-            let Some(victim) = self.least_recently_used(protected) else {
-                break;
-            };
-            self.documents.remove(&victim);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds the least recently used document, other than `protected`.
     fn least_recently_used(&self, protected: &str) -> Option<String> {
         self.documents
             .iter()
             .filter(|(uri, _)| uri.as_str() != protected)
             .min_by_key(|(uri, document)| (document.accessed, (*uri).clone()))

---- documents::tests::eviction_drops_the_least_recently_used_document stdout ----

thread 'documents::tests::eviction_drops_the_least_recently_used_document' (717945) panicked at crates/casm-lsp/src/documents.rs:484:9:
idle, so evicted

---- documents::tests::peek_does_not_change_the_eviction_order stdout ----

thread 'documents::tests::peek_does_not_change_the_eviction_order' (717948) panicked at crates/casm-lsp/src/documents.rs:521:9:
peek did not protect it

---- documents::tests::the_byte_limit_is_enforced stdout ----

thread 'documents::tests::the_byte_limit_is_enforced' (717951) panicked at crates/casm-lsp/src/documents.rs:456:9:
held 470 bytes

failures:
    documents::tests::eviction_drops_the_least_recently_used_document
    documents::tests::peek_does_not_change_the_eviction_order
    documents::tests::the_byte_limit_is_enforced
    documents::tests::the_document_count_limit_is_enforced

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
