*** crates/casm-lsp/src/documents.rs:264:13: replace || with && in DocumentStore::enforce_limits

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace || with && in DocumentStore::enforce_limits
@@ -256,17 +256,17 @@
     }
 
     /// Evicts least-recently-used documents until both limits are satisfied.
     ///
     /// `protected` is never evicted: dropping the document the client just sent would be
     /// visibly broken, however large it is.
     fn enforce_limits(&mut self, protected: &str) {
         while self.documents.len() > self.limits.max_documents
-            || self.total_bytes() > self.limits.max_total_bytes
+            && /* ~ changed by cargo-mutants ~ */ self.total_bytes() > self.limits.max_total_bytes
         {
             let Some(victim) = self.least_recently_used(protected) else {
                 break;
             };
             self.documents.remove(&victim);
         }
     }

---- documents::tests::eviction_drops_the_least_recently_used_document stdout ----

thread 'documents::tests::eviction_drops_the_least_recently_used_document' (715872) panicked at crates/casm-lsp/src/documents.rs:491:9:
idle, so evicted

---- documents::tests::peek_does_not_change_the_eviction_order stdout ----

thread 'documents::tests::peek_does_not_change_the_eviction_order' (715875) panicked at crates/casm-lsp/src/documents.rs:528:9:
peek did not protect it

---- documents::tests::the_document_count_limit_is_enforced stdout ----

thread 'documents::tests::the_document_count_limit_is_enforced' (715879) panicked at crates/casm-lsp/src/documents.rs:449:9:
assertion `left == right` failed
  left: 10
 right: 3

failures:
    documents::tests::eviction_drops_the_least_recently_used_document
    documents::tests::peek_does_not_change_the_eviction_order
    documents::tests::the_byte_limit_is_enforced
    documents::tests::the_document_count_limit_is_enforced

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
