*** crates/casm-lsp/src/documents.rs:264:35: replace > with == in DocumentStore::enforce_limits

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace > with == in DocumentStore::enforce_limits
@@ -256,17 +256,17 @@
     }
 
     /// Evicts least-recently-used documents until both limits are satisfied.
     ///
     /// `protected` is never evicted: dropping the document the client just sent would be
     /// visibly broken, however large it is.
     fn enforce_limits(&mut self, protected: &str) {
         while self.documents.len() > self.limits.max_documents
-            || self.total_bytes() > self.limits.max_total_bytes
+            || self.total_bytes() == /* ~ changed by cargo-mutants ~ */ self.limits.max_total_bytes
         {
             let Some(victim) = self.least_recently_used(protected) else {
                 break;
             };
             self.documents.remove(&victim);
         }
     }

---- documents::tests::the_byte_limit_is_enforced stdout ----

thread 'documents::tests::the_byte_limit_is_enforced' (723407) panicked at crates/casm-lsp/src/documents.rs:463:9:
held 470 bytes

failures:
    documents::tests::the_byte_limit_is_enforced

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
