*** crates/casm-lsp/src/documents.rs:264:35: replace > with >= in DocumentStore::enforce_limits

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace > with >= in DocumentStore::enforce_limits
@@ -256,17 +256,17 @@
     }
 
     /// Evicts least-recently-used documents until both limits are satisfied.
     ///
     /// `protected` is never evicted: dropping the document the client just sent would be
     /// visibly broken, however large it is.
     fn enforce_limits(&mut self, protected: &str) {
         while self.documents.len() > self.limits.max_documents
-            || self.total_bytes() > self.limits.max_total_bytes
+            || self.total_bytes() >= /* ~ changed by cargo-mutants ~ */ self.limits.max_total_bytes
         {
             let Some(victim) = self.least_recently_used(protected) else {
                 break;
             };
             self.documents.remove(&victim);
         }
     }

*** result: Success
