*** crates/casm-lsp/src/documents.rs:275:9: replace DocumentStore::least_recently_used -> Option<String> with None

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::least_recently_used -> Option<String> with None
@@ -267,21 +267,17 @@
                 break;
             };
             self.documents.remove(&victim);
         }
     }
 
     /// Finds the least recently used document, other than `protected`.
     fn least_recently_used(&self, protected: &str) -> Option<String> {
-        self.documents
-            .iter()
-            .filter(|(uri, _)| uri.as_str() != protected)
-            .min_by_key(|(uri, document)| (document.accessed, (*uri).clone()))
-            .map(|(uri, _)| uri.clone())
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for DocumentStore {
     fn default() -> Self {
         Self::new(Limits::default(), ValidatorConfig::default())
     }
 }

---- documents::tests::eviction_drops_the_least_recently_used_document stdout ----

thread 'documents::tests::eviction_drops_the_least_recently_used_document' (727497) panicked at crates/casm-lsp/src/documents.rs:487:9:
idle, so evicted

---- documents::tests::peek_does_not_change_the_eviction_order stdout ----

thread 'documents::tests::peek_does_not_change_the_eviction_order' (727501) panicked at crates/casm-lsp/src/documents.rs:524:9:
peek did not protect it

---- documents::tests::the_document_count_limit_is_enforced stdout ----

thread 'documents::tests::the_document_count_limit_is_enforced' (727511) panicked at crates/casm-lsp/src/documents.rs:445:9:
assertion `left == right` failed
  left: 10
 right: 3

failures:
    documents::tests::eviction_drops_the_least_recently_used_document
    documents::tests::peek_does_not_change_the_eviction_order
    documents::tests::the_byte_limit_is_enforced
    documents::tests::the_document_count_limit_is_enforced

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
