*** crates/casm-lsp/src/documents.rs:275:9: replace DocumentStore::least_recently_used -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace DocumentStore::least_recently_used -> Option<String> with Some("xyzzy".into())
@@ -267,21 +267,17 @@
                 break;
             };
             self.documents.remove(&victim);
         }
     }
 
     /// Finds the least recently used document, other than `protected`.
     fn least_recently_used(&self, protected: &str) -> Option<String> {
-        self.documents
-            .iter()
-            .filter(|(uri, _)| uri.as_str() != protected)
-            .min_by_key(|(uri, document)| (document.accessed, (*uri).clone()))
-            .map(|(uri, _)| uri.clone())
+        Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for DocumentStore {
     fn default() -> Self {
         Self::new(Limits::default(), ValidatorConfig::default())
     }
 }

*** result: Timeout
