*** crates/casm-lsp/src/documents.rs:277:45: replace != with == in DocumentStore::least_recently_used

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace != with == in DocumentStore::least_recently_used
@@ -269,17 +269,17 @@
             self.documents.remove(&victim);
         }
     }
 
     /// Finds the least recently used document, other than `protected`.
     fn least_recently_used(&self, protected: &str) -> Option<String> {
         self.documents
             .iter()
-            .filter(|(uri, _)| uri.as_str() != protected)
+            .filter(|(uri, _)| uri.as_str() == /* ~ changed by cargo-mutants ~ */ protected)
             .min_by_key(|(uri, document)| (document.accessed, (*uri).clone()))
             .map(|(uri, _)| uri.clone())
     }
 }
 
 impl Default for DocumentStore {
     fn default() -> Self {
         Self::new(Limits::default(), ValidatorConfig::default())

---- documents::tests::eviction_drops_the_least_recently_used_document stdout ----

thread 'documents::tests::eviction_drops_the_least_recently_used_document' (729820) panicked at crates/casm-lsp/src/documents.rs:491:9:
idle, so evicted

---- documents::tests::peek_does_not_change_the_eviction_order stdout ----

thread 'documents::tests::peek_does_not_change_the_eviction_order' (729823) panicked at crates/casm-lsp/src/documents.rs:528:9:
peek did not protect it

---- documents::tests::the_document_count_limit_is_enforced stdout ----

thread 'documents::tests::the_document_count_limit_is_enforced' (729827) panicked at crates/casm-lsp/src/documents.rs:449:9:
assertion `left == right` failed
  left: 10
 right: 3

failures:
    documents::tests::eviction_drops_the_least_recently_used_document
    documents::tests::peek_does_not_change_the_eviction_order
    documents::tests::the_document_count_limit_is_enforced

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
