*** crates/casm-lsp/src/documents.rs:301:5: replace uri_to_path -> std::path::PathBuf with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace uri_to_path -> std::path::PathBuf with Default::default()
@@ -293,24 +293,17 @@
 /// nonsensical path simply finds no pattern library.
 ///
 /// Two details are not cosmetic. A Windows URI is `file:///C:/dir`, and stripping the
 /// scheme leaves `/C:/dir`, which no Windows API will open — the leading slash has to go
 /// when a drive letter follows it. And a folder whose name contains a space arrives
 /// percent-encoded, so `%20` must come back before the path is used.
 #[must_use]
 pub fn uri_to_path(uri: &str) -> std::path::PathBuf {
-    let trimmed = uri.strip_prefix("file://").unwrap_or(uri);
-
-    let trimmed = match trimmed.strip_prefix('/') {
-        Some(rest) if has_drive_letter(rest) => rest,
-        _ => trimmed,
-    };
-
-    Path::new(&percent_decode(trimmed)).to_path_buf()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns `true` if `path` opens with a Windows drive specification such as `C:`.
 fn has_drive_letter(path: &str) -> bool {
     let mut characters = path.chars();
     let Some(letter) = characters.next() else {
         return false;
     };

---- documents::tests::a_posix_uri_becomes_its_path stdout ----

thread 'documents::tests::a_posix_uri_becomes_its_path' (733018) panicked at crates/casm-lsp/src/documents.rs:675:9:
assertion `left == right` failed
  left: ""
 right: "/home/eng/architecture.yaml"

---- documents::tests::a_leading_slash_survives_when_no_drive_letter_follows stdout ----

thread 'documents::tests::a_leading_slash_survives_when_no_drive_letter_follows' (733015) panicked at crates/casm-lsp/src/documents.rs:696:9:
assertion `left == right` failed
  left: ""
 right: "/srv/a.yaml"

---- documents::tests::a_malformed_escape_is_left_alone_rather_than_refused stdout ----

thread 'documents::tests::a_malformed_escape_is_left_alone_rather_than_refused' (733016) panicked at crates/casm-lsp/src/documents.rs:711:9:
assertion `left == right` failed
  left: ""
 right: "/tmp/100%/a.yaml"

failures:
    documents::tests::a_leading_slash_survives_when_no_drive_letter_follows
    documents::tests::a_malformed_escape_is_left_alone_rather_than_refused
    documents::tests::a_posix_uri_becomes_its_path
    documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter
    documents::tests::percent_escapes_are_decoded
    documents::tests::uris_convert_to_paths_for_error_attribution

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
