*** crates/casm-lsp/src/documents.rs:304:23: replace match guard has_drive_letter(rest) with true in uri_to_path

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace match guard has_drive_letter(rest) with true in uri_to_path
@@ -296,17 +296,17 @@
 /// scheme leaves `/C:/dir`, which no Windows API will open — the leading slash has to go
 /// when a drive letter follows it. And a folder whose name contains a space arrives
 /// percent-encoded, so `%20` must come back before the path is used.
 #[must_use]
 pub fn uri_to_path(uri: &str) -> std::path::PathBuf {
     let trimmed = uri.strip_prefix("file://").unwrap_or(uri);
 
     let trimmed = match trimmed.strip_prefix('/') {
-        Some(rest) if has_drive_letter(rest) => rest,
+        Some(rest) if true /* ~ changed by cargo-mutants ~ */ => rest,
         _ => trimmed,
     };
 
     Path::new(&percent_decode(trimmed)).to_path_buf()
 }
 
 /// Returns `true` if `path` opens with a Windows drive specification such as `C:`.
 fn has_drive_letter(path: &str) -> bool {

---- documents::tests::a_leading_slash_survives_when_no_drive_letter_follows stdout ----

thread 'documents::tests::a_leading_slash_survives_when_no_drive_letter_follows' (733579) panicked at crates/casm-lsp/src/documents.rs:703:9:
assertion `left == right` failed
  left: "srv/a.yaml"
 right: "/srv/a.yaml"

---- documents::tests::a_malformed_escape_is_left_alone_rather_than_refused stdout ----

thread 'documents::tests::a_malformed_escape_is_left_alone_rather_than_refused' (733580) panicked at crates/casm-lsp/src/documents.rs:718:9:
assertion `left == right` failed
  left: "tmp/100%/a.yaml"
 right: "/tmp/100%/a.yaml"

---- documents::tests::a_posix_uri_becomes_its_path stdout ----

thread 'documents::tests::a_posix_uri_becomes_its_path' (733582) panicked at crates/casm-lsp/src/documents.rs:682:9:
assertion `left == right` failed
  left: "home/eng/architecture.yaml"
 right: "/home/eng/architecture.yaml"

failures:
    documents::tests::a_leading_slash_survives_when_no_drive_letter_follows
    documents::tests::a_malformed_escape_is_left_alone_rather_than_refused
    documents::tests::a_posix_uri_becomes_its_path
    documents::tests::percent_escapes_are_decoded
    documents::tests::uris_convert_to_paths_for_error_attribution

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
