*** crates/casm-lsp/src/documents.rs:304:23: replace match guard has_drive_letter(rest) with false in uri_to_path

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace match guard has_drive_letter(rest) with false in uri_to_path
@@ -296,17 +296,17 @@
 /// scheme leaves `/C:/dir`, which no Windows API will open — the leading slash has to go
 /// when a drive letter follows it. And a folder whose name contains a space arrives
 /// percent-encoded, so `%20` must come back before the path is used.
 #[must_use]
 pub fn uri_to_path(uri: &str) -> std::path::PathBuf {
     let trimmed = uri.strip_prefix("file://").unwrap_or(uri);
 
     let trimmed = match trimmed.strip_prefix('/') {
-        Some(rest) if has_drive_letter(rest) => rest,
+        Some(rest) if false /* ~ changed by cargo-mutants ~ */ => rest,
         _ => trimmed,
     };
 
     Path::new(&percent_decode(trimmed)).to_path_buf()
 }
 
 /// Returns `true` if `path` opens with a Windows drive specification such as `C:`.
 fn has_drive_letter(path: &str) -> bool {

---- documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter stdout ----

thread 'documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter' (736147) panicked at crates/casm-lsp/src/documents.rs:693:9:
assertion `left == right` failed
  left: "/C:/w/architecture.yaml"
 right: "C:/w/architecture.yaml"

failures:
    documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
