*** crates/casm-lsp/src/documents.rs:313:5: replace has_drive_letter -> bool with true

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace has_drive_letter -> bool with true
@@ -305,21 +305,17 @@
         _ => trimmed,
     };
 
     Path::new(&percent_decode(trimmed)).to_path_buf()
 }
 
 /// Returns `true` if `path` opens with a Windows drive specification such as `C:`.
 fn has_drive_letter(path: &str) -> bool {
-    let mut characters = path.chars();
-    let Some(letter) = characters.next() else {
-        return false;
-    };
-    letter.is_ascii_alphabetic() && characters.next().is_some_and(|next| next == ':')
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes `%XX` escapes, leaving anything malformed exactly as it was found.
 ///
 /// Deliberately not a general URI decoder: `+` is not a space in a path, and a truncated
 /// or non-hexadecimal escape is likelier to be a literal `%` in a filename than an error
 /// worth refusing the workspace over.
 fn percent_decode(text: &str) -> String {

---- documents::tests::a_leading_slash_survives_when_no_drive_letter_follows stdout ----

thread 'documents::tests::a_leading_slash_survives_when_no_drive_letter_follows' (736366) panicked at crates/casm-lsp/src/documents.rs:699:9:
assertion `left == right` failed
  left: "srv/a.yaml"
 right: "/srv/a.yaml"

---- documents::tests::a_malformed_escape_is_left_alone_rather_than_refused stdout ----

thread 'documents::tests::a_malformed_escape_is_left_alone_rather_than_refused' (736367) panicked at crates/casm-lsp/src/documents.rs:714:9:
assertion `left == right` failed
  left: "tmp/100%/a.yaml"
 right: "/tmp/100%/a.yaml"

---- documents::tests::a_posix_uri_becomes_its_path stdout ----

thread 'documents::tests::a_posix_uri_becomes_its_path' (736369) panicked at crates/casm-lsp/src/documents.rs:678:9:
assertion `left == right` failed
  left: "home/eng/architecture.yaml"
 right: "/home/eng/architecture.yaml"

failures:
    documents::tests::a_leading_slash_survives_when_no_drive_letter_follows
    documents::tests::a_malformed_escape_is_left_alone_rather_than_refused
    documents::tests::a_posix_uri_becomes_its_path
    documents::tests::percent_escapes_are_decoded
    documents::tests::uris_convert_to_paths_for_error_attribution

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
