*** crates/casm-lsp/src/documents.rs:313:5: replace has_drive_letter -> bool with false

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace has_drive_letter -> bool with false
@@ -305,21 +305,17 @@
         _ => trimmed,
     };
 
     Path::new(&percent_decode(trimmed)).to_path_buf()
 }
 
 /// Returns `true` if `path` opens with a Windows drive specification such as `C:`.
 fn has_drive_letter(path: &str) -> bool {
-    let mut characters = path.chars();
-    let Some(letter) = characters.next() else {
-        return false;
-    };
-    letter.is_ascii_alphabetic() && characters.next().is_some_and(|next| next == ':')
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes `%XX` escapes, leaving anything malformed exactly as it was found.
 ///
 /// Deliberately not a general URI decoder: `+` is not a space in a path, and a truncated
 /// or non-hexadecimal escape is likelier to be a literal `%` in a filename than an error
 /// worth refusing the workspace over.
 fn percent_decode(text: &str) -> String {

---- documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter stdout ----

thread 'documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter' (738871) panicked at crates/casm-lsp/src/documents.rs:689:9:
assertion `left == right` failed
  left: "/C:/w/architecture.yaml"
 right: "C:/w/architecture.yaml"

failures:
    documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
