*** crates/casm-lsp/src/documents.rs:326:5: replace percent_decode -> String with String::new()

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace percent_decode -> String with String::new()
@@ -318,45 +318,17 @@
 }
 
 /// Decodes `%XX` escapes, leaving anything malformed exactly as it was found.
 ///
 /// Deliberately not a general URI decoder: `+` is not a space in a path, and a truncated
 /// or non-hexadecimal escape is likelier to be a literal `%` in a filename than an error
 /// worth refusing the workspace over.
 fn percent_decode(text: &str) -> String {
-    if !text.contains('%') {
-        return text.to_owned();
-    }
-
-    let bytes = text.as_bytes();
-    let mut out: Vec<u8> = Vec::with_capacity(bytes.len());
-    let mut index = 0_usize;
-
-    // Bounded by the input length: every arm advances `index`.
-    while let Some(&byte) = bytes.get(index) {
-        let decoded = if byte == b'%' {
-            bytes
-                .get(index.saturating_add(1)..index.saturating_add(3))
-                .and_then(|pair| std::str::from_utf8(pair).ok())
-                .and_then(|pair| u8::from_str_radix(pair, 16).ok())
-        } else {
-            None
-        };
-
-        if let Some(value) = decoded {
-            out.push(value);
-            index = index.saturating_add(3);
-        } else {
-            out.push(byte);
-            index = index.saturating_add(1);
-        }
-    }
-
-    String::from_utf8(out).unwrap_or_else(|_| text.to_owned())
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- documents::tests::a_leading_slash_survives_when_no_drive_letter_follows stdout ----

thread 'documents::tests::a_leading_slash_survives_when_no_drive_letter_follows' (742032) panicked at crates/casm-lsp/src/documents.rs:675:9:
assertion `left == right` failed
  left: ""
 right: "/srv/a.yaml"

---- documents::tests::a_malformed_escape_is_left_alone_rather_than_refused stdout ----

thread 'documents::tests::a_malformed_escape_is_left_alone_rather_than_refused' (742033) panicked at crates/casm-lsp/src/documents.rs:690:9:
assertion `left == right` failed
  left: ""
 right: "/tmp/100%/a.yaml"

---- documents::tests::a_posix_uri_becomes_its_path stdout ----

thread 'documents::tests::a_posix_uri_becomes_its_path' (742035) panicked at crates/casm-lsp/src/documents.rs:654:9:
assertion `left == right` failed
  left: ""
 right: "/home/eng/architecture.yaml"

failures:
    documents::tests::a_leading_slash_survives_when_no_drive_letter_follows
    documents::tests::a_malformed_escape_is_left_alone_rather_than_refused
    documents::tests::a_posix_uri_becomes_its_path
    documents::tests::a_windows_uri_loses_the_slash_before_its_drive_letter
    documents::tests::percent_escapes_are_decoded
    documents::tests::uris_convert_to_paths_for_error_attribution

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
