*** crates/casm-lsp/src/documents.rs:326:8: delete ! in percent_decode

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ delete ! in percent_decode
@@ -318,17 +318,17 @@
 }
 
 /// Decodes `%XX` escapes, leaving anything malformed exactly as it was found.
 ///
 /// Deliberately not a general URI decoder: `+` is not a space in a path, and a truncated
 /// or non-hexadecimal escape is likelier to be a literal `%` in a filename than an error
 /// worth refusing the workspace over.
 fn percent_decode(text: &str) -> String {
-    if !text.contains('%') {
+    if  /* ~ changed by cargo-mutants ~ */text.contains('%') {
         return text.to_owned();
     }
 
     let bytes = text.as_bytes();
     let mut out: Vec<u8> = Vec::with_capacity(bytes.len());
     let mut index = 0_usize;
 
     // Bounded by the input length: every arm advances `index`.

---- documents::tests::percent_escapes_are_decoded stdout ----

thread 'documents::tests::percent_escapes_are_decoded' (744983) panicked at crates/casm-lsp/src/documents.rs:709:9:
assertion `left == right` failed
  left: "/home/My%20Work/a.yaml"
 right: "/home/My Work/a.yaml"

failures:
    documents::tests::percent_escapes_are_decoded

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
