*** crates/casm-lsp/src/documents.rs:336:31: replace == with != in percent_decode

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace == with != in percent_decode
@@ -328,17 +328,17 @@
     }
 
     let bytes = text.as_bytes();
     let mut out: Vec<u8> = Vec::with_capacity(bytes.len());
     let mut index = 0_usize;
 
     // Bounded by the input length: every arm advances `index`.
     while let Some(&byte) = bytes.get(index) {
-        let decoded = if byte == b'%' {
+        let decoded = if byte != /* ~ changed by cargo-mutants ~ */ b'%' {
             bytes
                 .get(index.saturating_add(1)..index.saturating_add(3))
                 .and_then(|pair| std::str::from_utf8(pair).ok())
                 .and_then(|pair| u8::from_str_radix(pair, 16).ok())
         } else {
             None
         };

---- documents::tests::a_malformed_escape_is_left_alone_rather_than_refused stdout ----

thread 'documents::tests::a_malformed_escape_is_left_alone_rather_than_refused' (746011) panicked at crates/casm-lsp/src/documents.rs:718:9:
assertion `left == right` failed
  left: "/tmp\u{10}0%/a.yaml"
 right: "/tmp/100%/a.yaml"

---- documents::tests::percent_escapes_are_decoded stdout ----

thread 'documents::tests::percent_escapes_are_decoded' (746023) panicked at crates/casm-lsp/src/documents.rs:709:9:
assertion `left == right` failed
  left: "/home/My%20Work/a.yaml"
 right: "/home/My Work/a.yaml"

failures:
    documents::tests::a_malformed_escape_is_left_alone_rather_than_refused
    documents::tests::percent_escapes_are_decoded

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
