*** crates/casm-lsp/src/documents.rs:78:9: replace Document::diagnostics -> &[Diagnostic] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-lsp/src/documents.rs
+++ replace Document::diagnostics -> &[Diagnostic] with Vec::leak(Vec::new())
@@ -70,17 +70,17 @@
     /// Logical access time, for least-recently-used eviction.
     accessed: u64,
 }
 
 impl Document {
     /// The document's diagnostics.
     #[must_use]
     pub fn diagnostics(&self) -> &[Diagnostic] {
-        &self.analysis.diagnostics
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many source bytes this document occupies.
     #[must_use]
     pub fn size(&self) -> usize {
         self.text.len()
     }
 }

---- documents::tests::a_broken_document_is_stored_with_a_syntax_diagnostic_and_no_architecture stdout ----

thread 'documents::tests::a_broken_document_is_stored_with_a_syntax_diagnostic_and_no_architecture' (692807) panicked at crates/casm-lsp/src/documents.rs:419:9:
assertion failed: document.diagnostics().iter().any(|d| d.code == "syntax")

---- documents::tests::diagnostics_are_available_immediately_after_a_change stdout ----

thread 'documents::tests::diagnostics_are_available_immediately_after_a_change' (692819) panicked at crates/casm-lsp/src/documents.rs:387:9:
analysis runs eagerly, so diagnostics never lag the text

---- documents::tests::reconfiguring_re_analyses_every_open_document stdout ----

thread 'documents::tests::reconfiguring_re_analyses_every_open_document' (692825) panicked at crates/casm-lsp/src/documents.rs:563:9:
the strict default reports something

failures:
    documents::tests::a_broken_document_is_stored_with_a_syntax_diagnostic_and_no_architecture
    documents::tests::diagnostics_are_available_immediately_after_a_change
    documents::tests::loading_patterns_re_analyses_every_open_document
    documents::tests::reconfiguring_re_analyses_every_open_document

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
