*** crates/casm-lsp/src/hover.rs:100:5: replace describe_symbol -> String with String::new()

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace describe_symbol -> String with String::new()
@@ -92,29 +92,17 @@
 
 /// Renders the tooltip for a resolved symbol.
 fn describe_symbol(
     index: &DocumentIndex,
     architecture: Option<&Architecture>,
     patterns: &[Pattern],
     symbol: &Symbol,
 ) -> String {
-    match symbol.kind {
-        // A `bind:` value names a node, so it gets the node's tooltip.
-        SymbolKind::NodeDefinition | SymbolKind::NodeReference(_) | SymbolKind::BindingTarget => {
-            describe_node(index, architecture, &symbol.text)
-        }
-        SymbolKind::PatternReference => describe_pattern(patterns, &symbol.text),
-        SymbolKind::NodeTypeValue => describe_term(NODE_TYPES, &symbol.text, "node type"),
-        SymbolKind::RelationshipTypeValue => {
-            describe_term(RELATIONSHIP_TYPES, &symbol.text, "relationship type")
-        }
-        SymbolKind::ControlTypeValue => describe_term(CONTROL_TYPES, &symbol.text, "control type"),
-        SymbolKind::ProtocolValue => describe_protocol(&symbol.text),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a claimed pattern, from the library if it holds one.
 ///
 /// Says plainly when the library does not, rather than showing an empty tooltip: "the
 /// library has no such pattern" is the answer the author needs, and it is the same thing
 /// `patterns-are-satisfied` reports as a warning.
 fn describe_pattern(patterns: &[Pattern], reference: &str) -> String {

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (750974) panicked at crates/casm-lsp/src/hover.rs:572:9:

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (750976) panicked at crates/casm-lsp/src/hover.rs:546:9:

---- hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls stdout ----

thread 'hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls' (750980) panicked at crates/casm-lsp/src/hover.rs:360:9:

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback

test result: FAILED. 201 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
