*** crates/casm-lsp/src/hover.rs:147:8: delete ! in describe_pattern

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ delete ! in describe_pattern
@@ -139,17 +139,17 @@
         let _ = write!(
             out,
             "\n- `{}` — a {}",
             requirement.role(),
             requirement.node_type()
         );
     }
 
-    if !pattern.relationships().is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */pattern.relationships().is_empty() {
         out.push_str("\n\n**Required relationships**");
         for required in pattern.relationships() {
             let _ = write!(
                 out,
                 "\n- `{}` → `{}` ({})",
                 required.source(),
                 required.target(),
                 required.relationship_type()

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (757556) panicked at crates/casm-lsp/src/hover.rs:561:9:
**secure-web-tier** — _v1.0.0_

One governed gateway in front of one service.

**Roles**
- `edge` — a gateway
- `application` — a service

failures:
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
