*** crates/casm-lsp/src/hover.rs:165:5: replace describe_term -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace describe_term -> String with "xyzzy".into()
@@ -157,20 +157,17 @@
         }
     }
 
     out
 }
 
 /// Renders a vocabulary term, or says plainly that it is not one.
 fn describe_term(terms: &[Term], label: &str, what: &str) -> String {
-    find(terms, label).map_or_else(
-        || format!("`{label}` is not a recognised {what}."),
-        Term::to_markdown,
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a protocol, accounting for the `Custom` escape hatch.
 fn describe_protocol(label: &str) -> String {
     find(PROTOCOLS, label).map_or_else(
         || {
             format!(
                 "**{label}** — _custom protocol_\n\nNot a protocol CASIMIR models natively. \

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (761362) panicked at crates/casm-lsp/src/hover.rs:441:9:
xyzzy

---- hover::tests::hovering_a_node_type_explains_the_type stdout ----

thread 'hover::tests::hovering_a_node_type_explains_the_type' (761382) panicked at crates/casm-lsp/src/hover.rs:425:9:
xyzzy

---- hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics stdout ----

thread 'hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics' (761386) panicked at crates/casm-lsp/src/hover.rs:433:9:
xyzzy

failures:
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
