*** crates/casm-lsp/src/hover.rs:173:5: replace describe_protocol -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace describe_protocol -> String with "xyzzy".into()
@@ -165,25 +165,17 @@
     find(terms, label).map_or_else(
         || format!("`{label}` is not a recognised {what}."),
         Term::to_markdown,
     )
 }
 
 /// Renders a protocol, accounting for the `Custom` escape hatch.
 fn describe_protocol(label: &str) -> String {
-    find(PROTOCOLS, label).map_or_else(
-        || {
-            format!(
-                "**{label}** — _custom protocol_\n\nNot a protocol CASIMIR models natively. \
-                 It is accepted, and treated as synchronous for validation purposes."
-            )
-        },
-        Term::to_markdown,
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders everything known about a node.
 fn describe_node(index: &DocumentIndex, architecture: Option<&Architecture>, name: &str) -> String {
     match architecture.and_then(|arch| arch.node_by_name(name).map(|node| (arch, node))) {
         Some((arch, node)) => describe_resolved_node(arch, node),
         None => describe_indexed_node(index, name),
     }

---- hover::tests::hovering_a_protocol_explains_it stdout ----

thread 'hover::tests::hovering_a_protocol_explains_it' (762333) panicked at crates/casm-lsp/src/hover.rs:444:9:
xyzzy

---- hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback stdout ----

thread 'hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback' (762336) panicked at crates/casm-lsp/src/hover.rs:452:9:
xyzzy

failures:
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
