*** crates/casm-lsp/src/hover.rs:186:5: replace describe_node -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace describe_node -> String with "xyzzy".into()
@@ -178,20 +178,17 @@
             )
         },
         Term::to_markdown,
     )
 }
 
 /// Renders everything known about a node.
 fn describe_node(index: &DocumentIndex, architecture: Option<&Architecture>, name: &str) -> String {
-    match architecture.and_then(|arch| arch.node_by_name(name).map(|node| (arch, node))) {
-        Some((arch, node)) => describe_resolved_node(arch, node),
-        None => describe_indexed_node(index, name),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The full picture, from a document that parses.
 fn describe_resolved_node(architecture: &Architecture, node: &Node) -> String {
     let mut out = format!("**{}** — _{}_", node.name(), node.node_type());
 
     if let Some(description) = node.description() {
         let _ = write!(out, "\n\n{description}");

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (766408) panicked at crates/casm-lsp/src/hover.rs:581:9:
xyzzy

---- hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls stdout ----

thread 'hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls' (766414) panicked at crates/casm-lsp/src/hover.rs:369:9:
xyzzy

---- hover::tests::hovering_a_node_name_shows_its_type_and_description stdout ----

thread 'hover::tests::hovering_a_node_name_shows_its_type_and_description' (766416) panicked at crates/casm-lsp/src/hover.rs:360:9:
xyzzy

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names
    hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse

test result: FAILED. 208 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
