*** crates/casm-lsp/src/hover.rs:194:5: replace describe_resolved_node -> String with String::new()

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace describe_resolved_node -> String with String::new()
@@ -186,55 +186,17 @@
     match architecture.and_then(|arch| arch.node_by_name(name).map(|node| (arch, node))) {
         Some((arch, node)) => describe_resolved_node(arch, node),
         None => describe_indexed_node(index, name),
     }
 }
 
 /// The full picture, from a document that parses.
 fn describe_resolved_node(architecture: &Architecture, node: &Node) -> String {
-    let mut out = format!("**{}** — _{}_", node.name(), node.node_type());
-
-    if let Some(description) = node.description() {
-        let _ = write!(out, "\n\n{description}");
-    }
-
-    if !node.interfaces().is_empty() {
-        out.push_str("\n\n**Interfaces**");
-        for interface in node.interfaces() {
-            let _ = write!(
-                out,
-                "\n- `{}` — {} v{}",
-                interface.name(),
-                interface.protocol(),
-                interface.version()
-            );
-        }
-    }
-
-    if !node.controls().is_empty() {
-        out.push_str("\n\n**Controls**");
-        for control in node.controls() {
-            let evidence = if control.evidence_required() {
-                " *(evidence required)*"
-            } else {
-                ""
-            };
-            let _ = write!(
-                out,
-                "\n- `{}` ({}) — {}{evidence}",
-                control.standard(),
-                control.control_type(),
-                control.description()
-            );
-        }
-    }
-
-    append_edges(&mut out, architecture, node);
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Appends the node's incoming and outgoing relationships.
 fn append_edges(out: &mut String, architecture: &Architecture, node: &Node) {
     let name_of = |id| {
         architecture
             .node(id)
             .map_or_else(|| "?".to_owned(), |other| other.name().as_str().to_owned())

---- hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls stdout ----

thread 'hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls' (767201) panicked at crates/casm-lsp/src/hover.rs:334:9:

---- hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it stdout ----

thread 'hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it' (767202) panicked at crates/casm-lsp/src/hover.rs:344:9:

---- hover::tests::hovering_a_node_name_shows_its_type_and_description stdout ----

thread 'hover::tests::hovering_a_node_name_shows_its_type_and_description' (767203) panicked at crates/casm-lsp/src/hover.rs:325:9:

failures:
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
