*** crates/casm-lsp/src/hover.rs:200:8: delete ! in describe_resolved_node

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ delete ! in describe_resolved_node
@@ -192,17 +192,17 @@
 /// The full picture, from a document that parses.
 fn describe_resolved_node(architecture: &Architecture, node: &Node) -> String {
     let mut out = format!("**{}** — _{}_", node.name(), node.node_type());
 
     if let Some(description) = node.description() {
         let _ = write!(out, "\n\n{description}");
     }
 
-    if !node.interfaces().is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */node.interfaces().is_empty() {
         out.push_str("\n\n**Interfaces**");
         for interface in node.interfaces() {
             let _ = write!(
                 out,
                 "\n- `{}` — {} v{}",
                 interface.name(),
                 interface.protocol(),
                 interface.version()

---- hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls stdout ----

thread 'hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls' (769289) panicked at crates/casm-lsp/src/hover.rs:372:9:
**api** — _service_

Public entry point.

**Controls**
- `OIDC` (security) — tokens required *(evidence required)*

**Calls**
- → `orders-db` (sync, sql, 50ms)

failures:
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
