*** crates/casm-lsp/src/hover.rs:213:8: delete ! in describe_resolved_node

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ delete ! in describe_resolved_node
@@ -205,17 +205,17 @@
                 "\n- `{}` — {} v{}",
                 interface.name(),
                 interface.protocol(),
                 interface.version()
             );
         }
     }
 
-    if !node.controls().is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */node.controls().is_empty() {
         out.push_str("\n\n**Controls**");
         for control in node.controls() {
             let evidence = if control.evidence_required() {
                 " *(evidence required)*"
             } else {
                 ""
             };
             let _ = write!(

---- hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls stdout ----

thread 'hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls' (773026) panicked at crates/casm-lsp/src/hover.rs:373:9:
**api** — _service_

Public entry point.

**Interfaces**
- `rest` — http2 v2.1.0

**Calls**
- → `orders-db` (sync, sql, 50ms)

failures:
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
