*** crates/casm-lsp/src/hover.rs:237:5: replace append_edges with ()

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace append_edges with ()
@@ -229,47 +229,17 @@
     }
 
     append_edges(&mut out, architecture, node);
     out
 }
 
 /// Appends the node's incoming and outgoing relationships.
 fn append_edges(out: &mut String, architecture: &Architecture, node: &Node) {
-    let name_of = |id| {
-        architecture
-            .node(id)
-            .map_or_else(|| "?".to_owned(), |other| other.name().as_str().to_owned())
-    };
-
-    let outgoing: Vec<&Relationship> = architecture.outgoing(node.id()).collect();
-    if !outgoing.is_empty() {
-        out.push_str("\n\n**Calls**");
-        for edge in outgoing {
-            let _ = write!(
-                out,
-                "\n- → `{}` ({})",
-                name_of(edge.target()),
-                edge_summary(edge)
-            );
-        }
-    }
-
-    let incoming: Vec<&Relationship> = architecture.incoming(node.id()).collect();
-    if !incoming.is_empty() {
-        out.push_str("\n\n**Called by**");
-        for edge in incoming {
-            let _ = write!(
-                out,
-                "\n- ← `{}` ({})",
-                name_of(edge.source()),
-                edge_summary(edge)
-            );
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Summarises a relationship's type, protocol, and budget.
 fn edge_summary(edge: &Relationship) -> String {
     let mut parts = vec![edge.relationship_type().to_string()];
     if let Some(protocol) = edge.protocol() {
         parts.push(protocol.to_string());
     }

---- hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it stdout ----

thread 'hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it' (771387) panicked at crates/casm-lsp/src/hover.rs:352:9:
**api** — _service_

Public entry point.

**Interfaces**
- `rest` — http2 v2.1.0

**Controls**
- `OIDC` (security) — tokens required *(evidence required)*

---- hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names stdout ----

thread 'hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names' (771392) panicked at crates/casm-lsp/src/hover.rs:365:9:
the full node picture, not just the name

failures:
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
