*** crates/casm-lsp/src/hover.rs:244:8: delete ! in append_edges

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ delete ! in append_edges
@@ -236,17 +236,17 @@
 fn append_edges(out: &mut String, architecture: &Architecture, node: &Node) {
     let name_of = |id| {
         architecture
             .node(id)
             .map_or_else(|| "?".to_owned(), |other| other.name().as_str().to_owned())
     };
 
     let outgoing: Vec<&Relationship> = architecture.outgoing(node.id()).collect();
-    if !outgoing.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */outgoing.is_empty() {
         out.push_str("\n\n**Calls**");
         for edge in outgoing {
             let _ = write!(
                 out,
                 "\n- → `{}` ({})",
                 name_of(edge.target()),
                 edge_summary(edge)
             );

---- hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it stdout ----

thread 'hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it' (773896) panicked at crates/casm-lsp/src/hover.rs:382:9:
**api** — _service_

Public entry point.

**Interfaces**
- `rest` — http2 v2.1.0

**Controls**
- `OIDC` (security) — tokens required *(evidence required)*

---- hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names stdout ----

thread 'hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names' (773901) panicked at crates/casm-lsp/src/hover.rs:395:9:
the full node picture, not just the name

failures:
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
