*** crates/casm-lsp/src/hover.rs:257:8: delete ! in append_edges

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ delete ! in append_edges
@@ -249,17 +249,17 @@
                 "\n- → `{}` ({})",
                 name_of(edge.target()),
                 edge_summary(edge)
             );
         }
     }
 
     let incoming: Vec<&Relationship> = architecture.incoming(node.id()).collect();
-    if !incoming.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */incoming.is_empty() {
         out.push_str("\n\n**Called by**");
         for edge in incoming {
             let _ = write!(
                 out,
                 "\n- ← `{}` ({})",
                 name_of(edge.source()),
                 edge_summary(edge)
             );

---- hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it stdout ----

thread 'hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it' (772277) panicked at crates/casm-lsp/src/hover.rs:386:9:
**orders-db** — _database_

failures:
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
