*** crates/casm-lsp/src/hover.rs:284:5: replace describe_indexed_node -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace describe_indexed_node -> String with "xyzzy".into()
@@ -276,29 +276,17 @@
     if let Some(budget) = edge.latency_budget_ms() {
         parts.push(format!("{budget}ms"));
     }
     parts.join(", ")
 }
 
 /// The degraded picture, from a document that does not currently parse.
 fn describe_indexed_node(index: &DocumentIndex, name: &str) -> String {
-    let Some(entry) = index.node_named(name) else {
-        return format!(
-            "`{name}` does not match any node declared in this document.\n\n\
-             Check the spelling, or add a node with this name under `nodes:`."
-        );
-    };
-
-    let mut out = match entry.node_type.as_deref() {
-        Some(node_type) => format!("**{name}** — _{node_type}_"),
-        None => format!("**{name}** — _type not yet declared_"),
-    };
-    out.push_str("\n\n_Showing partial information: the document does not currently parse._");
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (778642) panicked at crates/casm-lsp/src/hover.rs:572:9:
xyzzy

---- hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix stdout ----

thread 'hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix' (778657) panicked at crates/casm-lsp/src/hover.rs:408:9:
xyzzy

---- hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse stdout ----

thread 'hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse' (778658) panicked at crates/casm-lsp/src/hover.rs:396:9:
xyzzy

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
