*** crates/casm-lsp/src/hover.rs:49:5: replace hover -> Option<Hover> with None

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace hover -> Option<Hover> with None
@@ -41,36 +41,17 @@
 /// requirements it stands for rather than only its own text.
 #[must_use]
 pub fn hover(
     index: &DocumentIndex,
     architecture: Option<&Architecture>,
     patterns: &[Pattern],
     position: Position,
 ) -> Option<Hover> {
-    if let Some(symbol) = index.symbol_at(position) {
-        return Some(Hover {
-            markdown: describe_symbol(index, architecture, patterns, symbol),
-            span: symbol.span,
-        });
-    }
-
-    // Not on a value — perhaps on the key that introduces it.
-    let line = index.line(position.line)?;
-    let span = line.key_span?;
-    if !span.contains(position) {
-        return None;
-    }
-
-    let key = line.key.as_deref()?;
-    let term = find(key_table(line.section, line.block), key)?;
-    Some(Hover {
-        markdown: term.to_markdown(),
-        span,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// The key vocabulary in force at a given section and block.
 fn key_table(section: Section, block: Block) -> &'static [Term] {
     match (section, block) {
         (Section::Root, _) => ROOT_KEYS,
         (Section::Nodes, Block::None) => NODE_KEYS,
         (Section::Nodes, Block::Interfaces) => INTERFACE_KEYS,

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (748759) panicked at crates/casm-lsp/src/hover.rs:562:14:
the bound node is under the cursor

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (748760) panicked at crates/casm-lsp/src/hover.rs:572:14:
the key is under the cursor

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (748761) panicked at crates/casm-lsp/src/hover.rs:536:14:
the reference is under the cursor

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it

test result: FAILED. 197 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
