*** crates/casm-lsp/src/hover.rs:59:8: delete ! in hover

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ delete ! in hover
@@ -51,17 +51,17 @@
             markdown: describe_symbol(index, architecture, patterns, symbol),
             span: symbol.span,
         });
     }
 
     // Not on a value — perhaps on the key that introduces it.
     let line = index.line(position.line)?;
     let span = line.key_span?;
-    if !span.contains(position) {
+    if  /* ~ changed by cargo-mutants ~ */span.contains(position) {
         return None;
     }
 
     let key = line.key.as_deref()?;
     let term = find(key_table(line.section, line.block), key)?;
     Some(Hover {
         markdown: term.to_markdown(),
         span,

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (747466) panicked at crates/casm-lsp/src/hover.rs:591:14:
the key is under the cursor

---- hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block stdout ----

thread 'hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block' (747470) panicked at crates/casm-lsp/src/hover.rs:483:14:
the key is under the cursor

---- hover::tests::hovering_a_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_key_explains_the_field' (747469) panicked at crates/casm-lsp/src/hover.rs:469:14:
the key is under the cursor

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
