*** crates/casm-lsp/src/hover.rs:73:5: replace key_table -> &'static[Term] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-lsp/src/hover.rs
+++ replace key_table -> &'static[Term] with Vec::leak(Vec::new())
@@ -65,34 +65,17 @@
     Some(Hover {
         markdown: term.to_markdown(),
         span,
     })
 }
 
 /// The key vocabulary in force at a given section and block.
 fn key_table(section: Section, block: Block) -> &'static [Term] {
-    match (section, block) {
-        (Section::Root, _) => ROOT_KEYS,
-        (Section::Nodes, Block::None) => NODE_KEYS,
-        (Section::Nodes, Block::Interfaces) => INTERFACE_KEYS,
-        (Section::Nodes | Section::Relationships, Block::Controls) => CONTROL_KEYS,
-        (Section::Relationships, Block::None | Block::Interfaces) => RELATIONSHIP_KEYS,
-        (Section::Patterns, Block::None) => CLAIM_KEYS,
-        // Inside `bind:` every key is a role name defined by the pattern, not by CASIMIR,
-        // so there is no fixed vocabulary to explain.
-        //
-        // The remaining pairs cannot arise — `crate::index` only opens `bind:` inside
-        // `patterns:` and `interfaces:`/`controls:` outside it — and are spelled out
-        // rather than caught by a wildcard so that adding a block or a section is a
-        // compile error here (ADR-0005).
-        (Section::Patterns, Block::Bindings | Block::Interfaces | Block::Controls)
-        | (Section::Nodes | Section::Relationships, Block::Bindings)
-        | (Section::Metadata | Section::Unknown, _) => &[],
-    }
+    Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders the tooltip for a resolved symbol.
 fn describe_symbol(
     index: &DocumentIndex,
     architecture: Option<&Architecture>,
     patterns: &[Pattern],
     symbol: &Symbol,

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (750673) panicked at crates/casm-lsp/src/hover.rs:574:14:
the key is under the cursor

---- hover::tests::hovering_a_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_key_explains_the_field' (750676) panicked at crates/casm-lsp/src/hover.rs:452:14:
the key is under the cursor

---- hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block stdout ----

thread 'hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block' (750677) panicked at crates/casm-lsp/src/hover.rs:466:14:
the key is under the cursor

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
