*** crates/casm-lsp/src/index.rs:103:9: replace Endpoint::label -> &'static str with ""

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace Endpoint::label -> &'static str with ""
@@ -95,20 +95,17 @@
     /// The `target:` field.
     Target,
 }
 
 impl Endpoint {
     /// The field name this endpoint is written as.
     #[must_use]
     pub const fn label(self) -> &'static str {
-        match self {
-            Self::Source => "source",
-            Self::Target => "target",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// What a span of text means to CASIMIR.
 #[derive(Clone, Copy, Debug, PartialEq, Eq, Hash)]
 pub enum SymbolKind {
     /// The `name:` of a node — the declaration a reference resolves to.
     NodeDefinition,

*** result: Success
