*** crates/casm-lsp/src/index.rs:176:9: replace LineInfo::field_indent -> usize with 0

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace LineInfo::field_indent -> usize with 0
@@ -168,21 +168,17 @@
 
 impl LineInfo {
     /// The indent at which this item's fields sit.
     ///
     /// For `  - name: api` the fields are at column 4, aligned under `name`, not under
     /// the dash. Quick-fixes that insert a field need this to produce valid YAML.
     #[must_use]
     pub const fn field_indent(&self) -> usize {
-        if self.is_list_item {
-            self.indent.saturating_add(2)
-        } else {
-            self.indent
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A node declaration found in the document.
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct NodeEntry {
     /// The declared name.
     pub name: String,

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (787931) panicked at crates/casm-lsp/src/actions.rs:425:9:
assertion `left == right` failed: no second block:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: OIDC
        description: tokens required
controls:
  - type: security

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (787932) panicked at crates/casm-lsp/src/actions.rs:454:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    type: service
    controls:
    - type: security
      standard: OIDC
      description: tokens required
controls:
  - type: security

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (787928) panicked at crates/casm-lsp/src/actions.rs:383:9:
name: x
nodes:
  - name: orders-db
    type: database
controls:
  - type: security
    standard: TODO-ENCRYPTION-AT-REST
    description: TODO describe how this data is encrypted at rest and where the keys live
  - type: operational
    standard: TODO-BACKUP
    description: TODO describe the backup schedule, retention, and when a restore was last tested

failures:
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    index::tests::field_indent_accounts_for_the_sequence_dash
    index::tests::node_declarations_are_collected_with_their_types

test result: FAILED. 207 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
