*** crates/casm-lsp/src/index.rs:234:9: replace RelationshipEntry::anchor_span -> Span with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace RelationshipEntry::anchor_span -> Span with Default::default()
@@ -226,19 +226,17 @@
 
 impl RelationshipEntry {
     /// The best span to anchor a diagnostic about this relationship on.
     ///
     /// Prefers the source, then the target, then the opening line — whichever the author
     /// has actually written.
     #[must_use]
     pub fn anchor_span(&self) -> Span {
-        self.source_span
-            .or(self.target_span)
-            .unwrap_or_else(|| Span::line_start(self.item_line))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A conformance claim found in the document.
 ///
 /// Like [`RelationshipEntry`], an entry begins at the `- ` of the sequence item rather
 /// than at the field that identifies it: a claim being typed has an opening dash before it
 /// has a `pattern:`, and a diagnostic still has to land somewhere.

---- diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line stdout ----

thread 'diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line' (790301) panicked at crates/casm-lsp/src/diagnostics.rs:399:9:
assertion `left == right` failed: the `- source: partner` line
  left: 0
 right: 7

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (790373) panicked at crates/casm-lsp/src/index.rs:1232:9:
assertion `left == right` failed: the `source:` line
  left: 0
 right: 19

failures:
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
