*** crates/casm-lsp/src/index.rs:268:9: replace ClaimEntry::anchor_span -> Span with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace ClaimEntry::anchor_span -> Span with Default::default()
@@ -260,18 +260,17 @@
 
 impl ClaimEntry {
     /// The best span to anchor a diagnostic about this claim on.
     ///
     /// Prefers the reference itself, falling back to the opening line for a claim whose
     /// `pattern:` has not been written.
     #[must_use]
     pub fn anchor_span(&self) -> Span {
-        self.reference_span
-            .unwrap_or_else(|| Span::line_start(self.item_line))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Where the node bound to `role` is named, if the claim binds it.
     #[must_use]
     pub fn binding_span(&self, role: &str) -> Option<Span> {
         self.bindings
             .iter()
             .find(|(name, _)| name == role)

---- diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one stdout ----

thread 'diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one' (792755) panicked at crates/casm-lsp/src/diagnostics.rs:676:9:
assertion `left != right` failed: line 1 is the fallback, not the answer
  left: 0
 right: 0

---- index::tests::a_claim_that_is_still_being_typed_still_anchors stdout ----

thread 'index::tests::a_claim_that_is_still_being_typed_still_anchors' (792826) panicked at crates/casm-lsp/src/index.rs:1325:9:
assertion `left == right` failed: the opening dash
  left: 0
 right: 2

---- index::tests::a_conformance_claim_is_indexed_with_its_reference stdout ----

thread 'index::tests::a_conformance_claim_is_indexed_with_its_reference' (792828) panicked at crates/casm-lsp/src/index.rs:1283:9:
assertion `left == right` failed
  left: 0
 right: 8

failures:
    diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one
    index::tests::a_claim_that_is_still_being_typed_still_anchors
    index::tests::a_conformance_claim_is_indexed_with_its_reference

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
