*** crates/casm-lsp/src/index.rs:275:9: replace ClaimEntry::binding_span -> Option<Span> with Some(Default::default())

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace ClaimEntry::binding_span -> Option<Span> with Some(Default::default())
@@ -267,20 +267,17 @@
     pub fn anchor_span(&self) -> Span {
         self.reference_span
             .unwrap_or_else(|| Span::line_start(self.item_line))
     }
 
     /// Where the node bound to `role` is named, if the claim binds it.
     #[must_use]
     pub fn binding_span(&self, role: &str) -> Option<Span> {
-        self.bindings
-            .iter()
-            .find(|(name, _)| name == role)
-            .map(|(_, span)| *span)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A position-aware view of an architecture document.
 ///
 /// Construction never fails; a malformed document simply yields fewer symbols.
 #[derive(Clone, Debug, Default)]
 pub struct DocumentIndex {

---- index::tests::bindings_are_indexed_by_role stdout ----

thread 'index::tests::bindings_are_indexed_by_role' (795569) panicked at crates/casm-lsp/src/index.rs:1298:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(10)

failures:
    index::tests::bindings_are_indexed_by_role

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
