*** crates/casm-lsp/src/index.rs:277:36: replace == with != in ClaimEntry::binding_span

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in ClaimEntry::binding_span
@@ -269,17 +269,17 @@
             .unwrap_or_else(|| Span::line_start(self.item_line))
     }
 
     /// Where the node bound to `role` is named, if the claim binds it.
     #[must_use]
     pub fn binding_span(&self, role: &str) -> Option<Span> {
         self.bindings
             .iter()
-            .find(|(name, _)| name == role)
+            .find(|(name, _)| name != /* ~ changed by cargo-mutants ~ */ role)
             .map(|(_, span)| *span)
     }
 }
 
 /// A position-aware view of an architecture document.
 ///
 /// Construction never fails; a malformed document simply yields fewer symbols.
 #[derive(Clone, Debug, Default)]

---- index::tests::bindings_are_indexed_by_role stdout ----

thread 'index::tests::bindings_are_indexed_by_role' (795185) panicked at crates/casm-lsp/src/index.rs:1301:9:
assertion `left == right` failed
  left: Some(11)
 right: Some(10)

failures:
    index::tests::bindings_are_indexed_by_role

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
