*** crates/casm-lsp/src/index.rs:299:9: replace DocumentIndex::build -> Self with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::build -> Self with Default::default()
@@ -291,23 +291,17 @@
     relationships: Vec<RelationshipEntry>,
     claims: Vec<ClaimEntry>,
 }
 
 impl DocumentIndex {
     /// Scans `source` and builds the index.
     #[must_use]
     pub fn build(source: &str) -> Self {
-        let mut builder = Builder::default();
-        for (number, raw) in source.lines().enumerate() {
-            // A document long enough to overflow `u32` line numbers exceeds the parser's
-            // size ceiling by orders of magnitude; saturate rather than wrap.
-            builder.push(u32::try_from(number).unwrap_or(u32::MAX), raw);
-        }
-        builder.finish()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every line, in order.
     #[must_use]
     pub fn lines(&self) -> &[LineInfo] {
         &self.lines
     }

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (799547) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (799548) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (799542) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 108 passed; 107 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
