*** crates/casm-lsp/src/index.rs:311:9: replace DocumentIndex::lines -> &[LineInfo] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::lines -> &[LineInfo] with Vec::leak(Vec::new())
@@ -303,17 +303,17 @@
             builder.push(u32::try_from(number).unwrap_or(u32::MAX), raw);
         }
         builder.finish()
     }
 
     /// Every line, in order.
     #[must_use]
     pub fn lines(&self) -> &[LineInfo] {
-        &self.lines
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The parsed information for one line.
     #[must_use]
     pub fn line(&self, number: u32) -> Option<&LineInfo> {
         self.lines
             .get(usize::try_from(number).unwrap_or(usize::MAX))
     }

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (799030) panicked at crates/casm-lsp/src/actions.rs:425:9:
assertion `left == right` failed: no second block:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: OIDC
        description: tokens required
    controls:
      - type: security

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (799031) panicked at crates/casm-lsp/src/actions.rs:454:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    type: service
    controls:
    - type: security
      standard: OIDC
      description: tokens required
    controls:
      - type: security

failures:
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
