*** crates/casm-lsp/src/index.rs:317:9: replace DocumentIndex::line -> Option<&LineInfo> with None

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::line -> Option<&LineInfo> with None
@@ -309,18 +309,17 @@
     #[must_use]
     pub fn lines(&self) -> &[LineInfo] {
         &self.lines
     }
 
     /// The parsed information for one line.
     #[must_use]
     pub fn line(&self, number: u32) -> Option<&LineInfo> {
-        self.lines
-            .get(usize::try_from(number).unwrap_or(usize::MAX))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The raw text of one line, without its terminator.
     #[must_use]
     pub fn raw_line(&self, number: u32) -> Option<&str> {
         self.raw_lines
             .get(usize::try_from(number).unwrap_or(usize::MAX))
             .map(String::as_str)

---- completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library stdout ----

thread 'completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library' (798351) panicked at crates/casm-lsp/src/completion.rs:786:9:
assertion `left == right` failed
  left: None
 right: BindingRoleKey

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (798352) panicked at crates/casm-lsp/src/completion.rs:763:9:
assertion `left == right` failed
  left: None
 right: BindingRoleKey

---- completion::tests::a_binding_value_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::a_binding_value_offers_the_nodes_this_document_declares' (798353) panicked at crates/casm-lsp/src/completion.rs:775:9:
assertion `left == right` failed
  left: None
 right: NodeNameValue

failures:
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_block_opening_key_line_still_offers_node_keys
    completion::tests::a_claim_offers_the_claim_keys
    completion::tests::a_control_field_position_offers_control_keys
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::a_field_completion_inserts_the_colon_and_a_space
    completion::tests::a_node_field_position_offers_node_keys
    completion::tests::a_node_type_value_offers_node_types
    completion::tests::a_pattern_reference_is_completed_from_the_library
    completion::tests::a_protocol_value_offers_protocols_in_both_places_it_appears

test result: FAILED. 160 passed; 55 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
