*** crates/casm-lsp/src/index.rs:324:9: replace DocumentIndex::raw_line -> Option<&str> with Some("xyzzy")

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::raw_line -> Option<&str> with Some("xyzzy")
@@ -316,19 +316,17 @@
     pub fn line(&self, number: u32) -> Option<&LineInfo> {
         self.lines
             .get(usize::try_from(number).unwrap_or(usize::MAX))
     }
 
     /// The raw text of one line, without its terminator.
     #[must_use]
     pub fn raw_line(&self, number: u32) -> Option<&str> {
-        self.raw_lines
-            .get(usize::try_from(number).unwrap_or(usize::MAX))
-            .map(String::as_str)
+        Some("xyzzy") /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many lines the document has.
     #[must_use]
     pub fn line_count(&self) -> u32 {
         u32::try_from(self.lines.len()).unwrap_or(u32::MAX)
     }

---- actions::tests::adding_security_controls_produces_a_document_that_still_parses stdout ----

thread 'actions::tests::adding_security_controls_produces_a_document_that_still_parses' (804932) panicked at crates/casm-lsp/src/actions.rs:361:9:
the fix produced invalid YAML:
name: x
nodes:
  - name: api
    t
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (804946) panicked at crates/casm-lsp/src/actions.rs:434:9:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: OIDC
     
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (804897) panicked at crates/casm-lsp/src/actions.rs:517:9:
name: x
nodes:
  - name: api
    t
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to doype: service

failures:
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::a_node_field_position_offers_node_keys
    completion::tests::a_node_type_value_offers_node_types
    completion::tests::a_pattern_reference_is_completed_from_the_library
    completion::tests::a_protocol_value_offers_protocols_in_both_places_it_appears

test result: FAILED. 193 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
