*** crates/casm-lsp/src/index.rs:332:9: replace DocumentIndex::line_count -> u32 with 0

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::line_count -> u32 with 0
@@ -324,17 +324,17 @@
         self.raw_lines
             .get(usize::try_from(number).unwrap_or(usize::MAX))
             .map(String::as_str)
     }
 
     /// How many lines the document has.
     #[must_use]
     pub fn line_count(&self) -> u32 {
-        u32::try_from(self.lines.len()).unwrap_or(u32::MAX)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every resolved symbol, in document order.
     #[must_use]
     pub fn symbols(&self) -> &[Symbol] {
         &self.symbols
     }

---- diagnostics::tests::every_diagnostic_lands_within_the_document stdout ----

thread 'diagnostics::tests::every_diagnostic_lands_within_the_document' (804612) panicked at crates/casm-lsp/src/diagnostics.rs:546:13:
services-require-security-controls anchored at line 2 of 0

---- index::tests::line_and_raw_line_accessors_agree_and_are_bounds_safe stdout ----

thread 'index::tests::line_and_raw_line_accessors_agree_and_are_bounds_safe' (804691) panicked at crates/casm-lsp/src/index.rs:1255:9:
assertion `left == right` failed
  left: 0
 right: 24

failures:
    diagnostics::tests::every_diagnostic_lands_within_the_document
    index::tests::line_and_raw_line_accessors_agree_and_are_bounds_safe

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
