*** crates/casm-lsp/src/index.rs:338:9: replace DocumentIndex::symbols -> &[Symbol] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::symbols -> &[Symbol] with Vec::leak(Vec::new())
@@ -330,17 +330,17 @@
     #[must_use]
     pub fn line_count(&self) -> u32 {
         u32::try_from(self.lines.len()).unwrap_or(u32::MAX)
     }
 
     /// Every resolved symbol, in document order.
     #[must_use]
     pub fn symbols(&self) -> &[Symbol] {
-        &self.symbols
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every node declaration, in document order.
     #[must_use]
     pub fn nodes(&self) -> &[NodeEntry] {
         &self.nodes
     }

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (807050) panicked at crates/casm-lsp/src/diagnostics.rs:363:9:
assertion `left == right` failed: the `target: ghost` line
  left: 0
 right: 6

---- index::tests::a_control_type_is_not_mistaken_for_a_node_type stdout ----

thread 'index::tests::a_control_type_is_not_mistaken_for_a_node_type' (807112) panicked at crates/casm-lsp/src/index.rs:1003:14:
the control type is indexed

---- index::tests::a_relationship_type_is_distinguished_from_a_node_type stdout ----

thread 'index::tests::a_relationship_type_is_distinguished_from_a_node_type' (807120) panicked at crates/casm-lsp/src/index.rs:1014:14:
called `Option::unwrap()` on a `None` value

failures:
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint
    index::tests::a_control_type_is_not_mistaken_for_a_node_type
    index::tests::a_relationship_type_is_distinguished_from_a_node_type
    index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block
    index::tests::protocols_are_indexed_in_both_interfaces_and_relationships
    index::tests::relationship_endpoints_are_indexed_as_references
    index::tests::spans_point_at_the_value_not_the_whole_line

test result: FAILED. 208 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
