*** crates/casm-lsp/src/index.rs:344:9: replace DocumentIndex::nodes -> &[NodeEntry] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::nodes -> &[NodeEntry] with Vec::leak(Vec::new())
@@ -336,17 +336,17 @@
     #[must_use]
     pub fn symbols(&self) -> &[Symbol] {
         &self.symbols
     }
 
     /// Every node declaration, in document order.
     #[must_use]
     pub fn nodes(&self) -> &[NodeEntry] {
-        &self.nodes
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every relationship declaration, in document order.
     #[must_use]
     pub fn relationships(&self) -> &[RelationshipEntry] {
         &self.relationships
     }

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (809195) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (809196) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (809192) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_value_offers_the_nodes_this_document_decl

test result: FAILED. 198 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
