*** crates/casm-lsp/src/index.rs:350:9: replace DocumentIndex::relationships -> &[RelationshipEntry] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::relationships -> &[RelationshipEntry] with Vec::leak(Vec::new())
@@ -342,17 +342,17 @@
     #[must_use]
     pub fn nodes(&self) -> &[NodeEntry] {
         &self.nodes
     }
 
     /// Every relationship declaration, in document order.
     #[must_use]
     pub fn relationships(&self) -> &[RelationshipEntry] {
-        &self.relationships
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every conformance claim, in document order.
     #[must_use]
     pub fn claims(&self) -> &[ClaimEntry] {
         &self.claims
     }

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (809835) panicked at crates/casm-lsp/src/index.rs:1233:22:
index out of bounds: the len is 0 but the index is 0

---- index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in stdout ----

thread 'index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in' (809837) panicked at crates/casm-lsp/src/index.rs:1185:50:
indexed

---- index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry stdout ----

thread 'index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry' (809839) panicked at crates/casm-lsp/src/index.rs:1218:9:
assertion `left == right` failed: the control item is not a relationship
  left: 0
 right: 1

failures:
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::relationship_declarations_are_collected_with_all_three_fields
    index::tests::several_relationships_are_kept_separate

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
