*** crates/casm-lsp/src/index.rs:350:9: replace DocumentIndex::relationships -> &[RelationshipEntry] with Vec::leak(vec![Default::default()])

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::relationships -> &[RelationshipEntry] with Vec::leak(vec![Default::default()])
@@ -342,17 +342,17 @@
     #[must_use]
     pub fn nodes(&self) -> &[NodeEntry] {
         &self.nodes
     }
 
     /// Every relationship declaration, in document order.
     #[must_use]
     pub fn relationships(&self) -> &[RelationshipEntry] {
-        &self.relationships
+        Vec::leak(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every conformance claim, in document order.
     #[must_use]
     pub fn claims(&self) -> &[ClaimEntry] {
         &self.claims
     }

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (810883) panicked at crates/casm-lsp/src/index.rs:1234:9:
assertion `left == right` failed: the `source:` line
  left: 0
 right: 19

---- index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in stdout ----

thread 'index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in' (810885) panicked at crates/casm-lsp/src/index.rs:1187:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry stdout ----

thread 'index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry' (810921) panicked at crates/casm-lsp/src/index.rs:1223:9:
assertion `left == right` failed: not 'security'
  left: None
 right: Some("sync")

failures:
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::relationship_declarations_are_collected_with_all_three_fields
    index::tests::several_relationships_are_kept_separate

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
