*** crates/casm-lsp/src/index.rs:356:9: replace DocumentIndex::claims -> &[ClaimEntry] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::claims -> &[ClaimEntry] with Vec::leak(Vec::new())
@@ -348,17 +348,17 @@
     #[must_use]
     pub fn relationships(&self) -> &[RelationshipEntry] {
         &self.relationships
     }
 
     /// Every conformance claim, in document order.
     #[must_use]
     pub fn claims(&self) -> &[ClaimEntry] {
-        &self.claims
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds the claim naming `reference`, an exact `name@version`.
     #[must_use]
     pub fn claim_of(&self, reference: &str) -> Option<&ClaimEntry> {
         self.claims
             .iter()
             .find(|claim| claim.reference.as_deref() == Some(reference))

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (812011) panicked at crates/casm-lsp/src/completion.rs:764:9:
assertion `left == right` failed
  left: []
 right: ["edge", "application"]

---- index::tests::a_claim_that_is_still_being_typed_still_anchors stdout ----

thread 'index::tests::a_claim_that_is_still_being_typed_still_anchors' (812109) panicked at crates/casm-lsp/src/index.rs:1324:9:
assertion `left == right` failed
  left: 0
 right: 1

---- index::tests::a_conformance_claim_is_indexed_with_its_reference stdout ----

thread 'index::tests::a_conformance_claim_is_indexed_with_its_reference' (812111) panicked at crates/casm-lsp/src/index.rs:1280:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    index::tests::a_claim_that_is_still_being_typed_still_anchors
    index::tests::a_conformance_claim_is_indexed_with_its_reference
    index::tests::bindings_are_indexed_by_role
    index::tests::the_patterns_section_does_not_leak_into_the_next_one

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
