*** crates/casm-lsp/src/index.rs:362:9: replace DocumentIndex::claim_of -> Option<&ClaimEntry> with None

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::claim_of -> Option<&ClaimEntry> with None
@@ -354,19 +354,17 @@
     #[must_use]
     pub fn claims(&self) -> &[ClaimEntry] {
         &self.claims
     }
 
     /// Finds the claim naming `reference`, an exact `name@version`.
     #[must_use]
     pub fn claim_of(&self, reference: &str) -> Option<&ClaimEntry> {
-        self.claims
-            .iter()
-            .find(|claim| claim.reference.as_deref() == Some(reference))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds the relationship declared between `source` and `target`.
     ///
     /// The same pair may be connected by several edges of different types; this returns
     /// the first, which is what a diagnostic about the pair should anchor on.
     #[must_use]
     pub fn relationship_between(&self, source: &str, target: &str) -> Option<&RelationshipEntry> {

---- diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim stdout ----

thread 'diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim' (815681) panicked at crates/casm-lsp/src/diagnostics.rs:691:18:
the claim is indexed

---- diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one stdout ----

thread 'diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one' (815684) panicked at crates/casm-lsp/src/diagnostics.rs:674:14:
the claim is indexed

---- index::tests::a_claim_is_found_by_its_reference stdout ----

thread 'index::tests::a_claim_is_found_by_its_reference' (815792) panicked at crates/casm-lsp/src/index.rs:1289:9:
assertion failed: index.claim_of("secure-web-tier@1.0.0").is_some()

failures:
    diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim
    diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one
    index::tests::a_claim_is_found_by_its_reference

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
