*** crates/casm-lsp/src/index.rs:362:9: replace DocumentIndex::claim_of -> Option<&ClaimEntry> with Some(Box::leak(Box::new(Default::default())))

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::claim_of -> Option<&ClaimEntry> with Some(Box::leak(Box::new(Default::default())))
@@ -354,19 +354,17 @@
     #[must_use]
     pub fn claims(&self) -> &[ClaimEntry] {
         &self.claims
     }
 
     /// Finds the claim naming `reference`, an exact `name@version`.
     #[must_use]
     pub fn claim_of(&self, reference: &str) -> Option<&ClaimEntry> {
-        self.claims
-            .iter()
-            .find(|claim| claim.reference.as_deref() == Some(reference))
+        Some(Box::leak(Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds the relationship declared between `source` and `target`.
     ///
     /// The same pair may be connected by several edges of different types; this returns
     /// the first, which is what a diagnostic about the pair should anchor on.
     #[must_use]
     pub fn relationship_between(&self, source: &str, target: &str) -> Option<&RelationshipEntry> {

---- diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one stdout ----

thread 'diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one' (814183) panicked at crates/casm-lsp/src/diagnostics.rs:676:9:
assertion `left != right` failed: line 1 is the fallback, not the answer
  left: 0
 right: 0

---- index::tests::a_claim_is_found_by_its_reference stdout ----

thread 'index::tests::a_claim_is_found_by_its_reference' (814259) panicked at crates/casm-lsp/src/index.rs:1290:9:
assertion failed: index.claim_of("secure-web-tier@2.0.0").is_none()

failures:
    diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one
    index::tests::a_claim_is_found_by_its_reference

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
