*** crates/casm-lsp/src/index.rs:373:9: replace DocumentIndex::relationship_between -> Option<&RelationshipEntry> with None

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::relationship_between -> Option<&RelationshipEntry> with None
@@ -365,19 +365,17 @@
     }
 
     /// Finds the relationship declared between `source` and `target`.
     ///
     /// The same pair may be connected by several edges of different types; this returns
     /// the first, which is what a diagnostic about the pair should anchor on.
     #[must_use]
     pub fn relationship_between(&self, source: &str, target: &str) -> Option<&RelationshipEntry> {
-        self.relationships.iter().find(|edge| {
-            edge.source.as_deref() == Some(source) && edge.target.as_deref() == Some(target)
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The names of every declared node.
     ///
     /// Drives both go-to-definition and the completion list for `source:` and `target:`.
     #[must_use]
     pub fn node_names(&self) -> Vec<&str> {
         self.nodes.iter().map(|node| node.name.as_str()).collect()

---- diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line stdout ----

thread 'diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line' (820065) panicked at crates/casm-lsp/src/diagnostics.rs:399:9:
assertion `left == right` failed: the `- source: partner` line
  left: 0
 right: 7

---- index::tests::a_relationship_is_found_by_its_endpoints stdout ----

thread 'index::tests::a_relationship_is_found_by_its_endpoints' (820222) panicked at crates/casm-lsp/src/index.rs:1203:9:
assertion failed: found.is_some()

failures:
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    index::tests::a_relationship_is_found_by_its_endpoints

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
