*** crates/casm-lsp/src/index.rs:374:52: replace && with || in DocumentIndex::relationship_between

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace && with || in DocumentIndex::relationship_between
@@ -366,17 +366,17 @@
 
     /// Finds the relationship declared between `source` and `target`.
     ///
     /// The same pair may be connected by several edges of different types; this returns
     /// the first, which is what a diagnostic about the pair should anchor on.
     #[must_use]
     pub fn relationship_between(&self, source: &str, target: &str) -> Option<&RelationshipEntry> {
         self.relationships.iter().find(|edge| {
-            edge.source.as_deref() == Some(source) && edge.target.as_deref() == Some(target)
+            edge.source.as_deref() == Some(source) || /* ~ changed by cargo-mutants ~ */ edge.target.as_deref() == Some(target)
         })
     }
 
     /// The names of every declared node.
     ///
     /// Drives both go-to-definition and the completion list for `source:` and `target:`.
     #[must_use]
     pub fn node_names(&self) -> Vec<&str> {

*** result: Success
