*** crates/casm-lsp/src/index.rs:383:9: replace DocumentIndex::node_names -> Vec<&str> with vec!["xyzzy"]

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::node_names -> Vec<&str> with vec!["xyzzy"]
@@ -375,17 +375,17 @@
         })
     }
 
     /// The names of every declared node.
     ///
     /// Drives both go-to-definition and the completion list for `source:` and `target:`.
     #[must_use]
     pub fn node_names(&self) -> Vec<&str> {
-        self.nodes.iter().map(|node| node.name.as_str()).collect()
+        vec!["xyzzy"] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds the symbol under `position`, if there is one.
     #[must_use]
     pub fn symbol_at(&self, position: Position) -> Option<&Symbol> {
         self.symbols
             .iter()
             .find(|symbol| symbol.span.contains(position))

---- documents::tests::a_document_is_stored_and_analysed_on_open stdout ----

thread 'documents::tests::a_document_is_stored_and_analysed_on_open' (826646) panicked at crates/casm-lsp/src/documents.rs:380:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["api"]

---- documents::tests::a_change_replaces_the_previous_analysis stdout ----

thread 'documents::tests::a_change_replaces_the_previous_analysis' (826644) panicked at crates/casm-lsp/src/documents.rs:405:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["gateway"]

---- index::tests::a_syntactically_broken_document_still_indexes_what_it_can stdout ----

thread 'index::tests::a_syntactically_broken_document_still_indexes_what_it_can' (826707) panicked at crates/casm-lsp/src/index.rs:861:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["api"]

failures:
    documents::tests::a_change_replaces_the_previous_analysis
    documents::tests::a_document_is_stored_and_analysed_on_open
    index::tests::a_syntactically_broken_document_still_indexes_what_it_can
    index::tests::a_trailing_comment_does_not_corrupt_the_indexed_value
    index::tests::node_declarations_are_collected_with_their_types
    index::tests::the_patterns_section_does_not_leak_into_the_next_one

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
