*** crates/casm-lsp/src/index.rs:389:9: replace DocumentIndex::symbol_at -> Option<&Symbol> with None

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::symbol_at -> Option<&Symbol> with None
@@ -381,19 +381,17 @@
     #[must_use]
     pub fn node_names(&self) -> Vec<&str> {
         self.nodes.iter().map(|node| node.name.as_str()).collect()
     }
 
     /// Finds the symbol under `position`, if there is one.
     #[must_use]
     pub fn symbol_at(&self, position: Position) -> Option<&Symbol> {
-        self.symbols
-            .iter()
-            .find(|symbol| symbol.span.contains(position))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds the declaration of the node called `name`.
     #[must_use]
     pub fn node_named(&self, name: &str) -> Option<&NodeEntry> {
         self.nodes.iter().find(|node| node.name == name)
     }

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (827368) panicked at crates/casm-lsp/src/hover.rs:581:14:
the bound node is under the cursor

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (827370) panicked at crates/casm-lsp/src/hover.rs:555:14:
the reference is under the cursor

---- hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls stdout ----

thread 'hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls' (827390) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback

test result: FAILED. 193 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
