*** crates/casm-lsp/src/index.rs:397:49: replace == with != in DocumentIndex::node_named

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in DocumentIndex::node_named
@@ -389,17 +389,17 @@
         self.symbols
             .iter()
             .find(|symbol| symbol.span.contains(position))
     }
 
     /// Finds the declaration of the node called `name`.
     #[must_use]
     pub fn node_named(&self, name: &str) -> Option<&NodeEntry> {
-        self.nodes.iter().find(|node| node.name == name)
+        self.nodes.iter().find(|node| node.name != /* ~ changed by cargo-mutants ~ */ name)
     }
 
     /// Finds every reference to the node called `name`.
     ///
     /// A `bind:` entry counts: binding a node to a pattern role is a use of that node, and
     /// renaming it without following the binding leaves a claim pointing at nothing.
     #[must_use]
     pub fn references_to(&self, name: &str) -> Vec<&Symbol> {

---- actions::tests::adding_security_controls_produces_a_document_that_still_parses stdout ----

thread 'actions::tests::adding_security_controls_produces_a_document_that_still_parses' (833200) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (833197) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (833198) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    diagnostics::tests::a_node_finding_is_anchored_on_the_node_name

test result: FAILED. 195 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
