*** crates/casm-lsp/src/index.rs:406:9: replace DocumentIndex::references_to -> Vec<&Symbol> with vec![]

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace DocumentIndex::references_to -> Vec<&Symbol> with vec![]
@@ -398,25 +398,17 @@
     }
 
     /// Finds every reference to the node called `name`.
     ///
     /// A `bind:` entry counts: binding a node to a pattern role is a use of that node, and
     /// renaming it without following the binding leaves a claim pointing at nothing.
     #[must_use]
     pub fn references_to(&self, name: &str) -> Vec<&Symbol> {
-        self.symbols
-            .iter()
-            .filter(|symbol| {
-                matches!(
-                    symbol.kind,
-                    SymbolKind::NodeReference(_) | SymbolKind::BindingTarget
-                ) && symbol.text == name
-            })
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Incremental state for a single pass over the document's lines.
 #[derive(Default)]
 struct Builder {
     lines: Vec<LineInfo>,
     raw_lines: Vec<String>,

---- index::tests::a_bound_node_is_a_reference_to_it stdout ----

thread 'index::tests::a_bound_node_is_a_reference_to_it' (834105) panicked at crates/casm-lsp/src/index.rs:1307:9:
assertion `left == right` failed
  left: 0
 right: 1

---- index::tests::references_to_a_node_are_found stdout ----

thread 'index::tests::references_to_a_node_are_found' (834133) panicked at crates/casm-lsp/src/index.rs:1069:9:
assertion `left == right` failed
  left: 0
 right: 1

---- navigation::tests::references_can_exclude_the_declaration stdout ----

thread 'navigation::tests::references_can_exclude_the_declaration' (834161) panicked at crates/casm-lsp/src/navigation.rs:221:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    index::tests::a_bound_node_is_a_reference_to_it
    index::tests::references_to_a_node_are_found
    navigation::tests::references_can_exclude_the_declaration
    navigation::tests::references_finds_every_mention

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
