*** crates/casm-lsp/src/index.rs:412:19: replace && with || in DocumentIndex::references_to

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace && with || in DocumentIndex::references_to
@@ -404,17 +404,17 @@
     #[must_use]
     pub fn references_to(&self, name: &str) -> Vec<&Symbol> {
         self.symbols
             .iter()
             .filter(|symbol| {
                 matches!(
                     symbol.kind,
                     SymbolKind::NodeReference(_) | SymbolKind::BindingTarget
-                ) && symbol.text == name
+                ) || /* ~ changed by cargo-mutants ~ */ symbol.text == name
             })
             .collect()
     }
 }
 
 /// Incremental state for a single pass over the document's lines.
 #[derive(Default)]
 struct Builder {

---- index::tests::a_bound_node_is_a_reference_to_it stdout ----

thread 'index::tests::a_bound_node_is_a_reference_to_it' (831967) panicked at crates/casm-lsp/src/index.rs:1315:9:
assertion `left == right` failed
  left: 3
 right: 1

---- index::tests::references_to_a_node_are_found stdout ----

thread 'index::tests::references_to_a_node_are_found' (831995) panicked at crates/casm-lsp/src/index.rs:1077:9:
assertion `left == right` failed
  left: 3
 right: 1

---- navigation::tests::references_can_exclude_the_declaration stdout ----

thread 'navigation::tests::references_can_exclude_the_declaration' (832023) panicked at crates/casm-lsp/src/navigation.rs:221:9:
assertion `left == right` failed
  left: 5
 right: 2

failures:
    index::tests::a_bound_node_is_a_reference_to_it
    index::tests::references_to_a_node_are_found
    navigation::tests::references_can_exclude_the_declaration
    navigation::tests::references_finds_every_mention

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
