*** crates/casm-lsp/src/index.rs:412:34: replace == with != in DocumentIndex::references_to

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in DocumentIndex::references_to
@@ -404,17 +404,17 @@
     #[must_use]
     pub fn references_to(&self, name: &str) -> Vec<&Symbol> {
         self.symbols
             .iter()
             .filter(|symbol| {
                 matches!(
                     symbol.kind,
                     SymbolKind::NodeReference(_) | SymbolKind::BindingTarget
-                ) && symbol.text == name
+                ) && symbol.text != /* ~ changed by cargo-mutants ~ */ name
             })
             .collect()
     }
 }
 
 /// Incremental state for a single pass over the document's lines.
 #[derive(Default)]
 struct Builder {

---- index::tests::references_to_a_node_are_found stdout ----

thread 'index::tests::references_to_a_node_are_found' (831473) panicked at crates/casm-lsp/src/index.rs:1078:9:
assertion `left == right` failed
  left: NodeReference(Target)
 right: NodeReference(Source)

failures:
    index::tests::references_to_a_node_are_found

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
