*** crates/casm-lsp/src/index.rs:435:9: replace Builder::push with ()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace Builder::push with ()
@@ -427,77 +427,17 @@
     section: Section,
     block: Block,
     block_indent: Option<usize>,
 }
 
 impl Builder {
     /// Consumes one line.
     fn push(&mut self, number: u32, raw: &str) {
-        self.raw_lines.push(raw.to_owned());
-
-        let content = strip_comment(raw);
-        let indent = content.len().saturating_sub(content.trim_start().len());
-        let trimmed = content.trim_start();
-
-        if trimmed.is_empty() {
-            // A blank line inherits the surrounding context, so that completion invoked on
-            // an empty line inside `nodes:` still knows it is inside `nodes:`.
-            self.lines.push(LineInfo {
-                number,
-                indent,
-                section: self.section,
-                block: self.block,
-                is_list_item: false,
-                key: None,
-                key_span: None,
-                value: None,
-                value_span: None,
-            });
-            return;
-        }
-
-        let (is_list_item, body_offset) = if let Some(rest) = trimmed.strip_prefix("- ") {
-            let _ = rest;
-            (true, indent.saturating_add(2))
-        } else if trimmed == "-" {
-            (true, indent.saturating_add(1))
-        } else {
-            (false, indent)
-        };
-
-        let body = content.get(body_offset..).unwrap_or("");
-        let parsed = split_key_value(body);
-
-        let block = self.update_scope(indent, is_list_item, parsed.key);
-
-        let key_span = parsed
-            .key_range
-            .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
-        let value_span = parsed
-            .value_range
-            .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
-
-        let info = LineInfo {
-            number,
-            indent,
-            section: self.section,
-            block,
-            is_list_item,
-            key: parsed.key.map(ToOwned::to_owned),
-            key_span,
-            value: parsed.value.map(ToOwned::to_owned),
-            value_span,
-        };
-
-        self.record_symbol(&info);
-        self.record_node(&info);
-        self.record_relationship(&info);
-        self.record_claim(&info);
-        self.lines.push(info);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Updates section and block state, returning the block the current line sits in.
     ///
     /// A block's opening key line is deliberately **outside** the block it opens: on
     /// `    controls:` the author is still writing a field of the node, so completion
     /// there must offer node fields, not control fields. The block begins on the next
     /// line.

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (837617) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (837612) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (837618) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 108 passed; 107 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
