*** crates/casm-lsp/src/index.rs:474:83: replace + with * in Builder::push

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace + with * in Builder::push
@@ -466,17 +466,17 @@
 
         let body = content.get(body_offset..).unwrap_or("");
         let parsed = split_key_value(body);
 
         let block = self.update_scope(indent, is_list_item, parsed.key);
 
         let key_span = parsed
             .key_range
-            .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
+            .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset * /* ~ changed by cargo-mutants ~ */ e));
         let value_span = parsed
             .value_range
             .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
 
         let info = LineInfo {
             number,
             indent,
             section: self.section,

*** result: Success
