*** crates/casm-lsp/src/index.rs:477:66: replace + with - in Builder::push

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace + with - in Builder::push
@@ -469,17 +469,17 @@
 
         let block = self.update_scope(indent, is_list_item, parsed.key);
 
         let key_span = parsed
             .key_range
             .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
         let value_span = parsed
             .value_range
-            .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
+            .map(|(s, e)| span_of_bytes(number, raw, body_offset - /* ~ changed by cargo-mutants ~ */ s, body_offset + e));
 
         let info = LineInfo {
             number,
             indent,
             section: self.section,
             block,
             is_list_item,
             key: parsed.key.map(ToOwned::to_owned),

---- actions::tests::a_diagnostic_that_is_not_about_a_node_offers_no_fix stdout ----

thread 'actions::tests::a_diagnostic_that_is_not_about_a_node_offers_no_fix' (842210) panicked at crates/casm-lsp/src/index.rs:477:54:
attempt to subtract with overflow

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (842209) panicked at crates/casm-lsp/src/index.rs:477:54:
attempt to subtract with overflow

---- actions::tests::a_diagnostic_with_no_fix_offers_none stdout ----

thread 'actions::tests::a_diagnostic_with_no_fix_offers_none' (842211) panicked at crates/casm-lsp/src/index.rs:477:54:
attempt to subtract with overflow

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_diagnostic_that_is_not_about_a_node_offers_no_fix
    actions::tests::a_diagnostic_with_no_fix_offers_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline

test result: FAILED. 69 passed; 146 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
