*** crates/casm-lsp/src/index.rs:477:66: replace + with * in Builder::push

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace + with * in Builder::push
@@ -469,17 +469,17 @@
 
         let block = self.update_scope(indent, is_list_item, parsed.key);
 
         let key_span = parsed
             .key_range
             .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
         let value_span = parsed
             .value_range
-            .map(|(s, e)| span_of_bytes(number, raw, body_offset + s, body_offset + e));
+            .map(|(s, e)| span_of_bytes(number, raw, body_offset * /* ~ changed by cargo-mutants ~ */ s, body_offset + e));
 
         let info = LineInfo {
             number,
             indent,
             section: self.section,
             block,
             is_list_item,
             key: parsed.key.map(ToOwned::to_owned),

---- diagnostics::tests::a_node_finding_is_anchored_on_the_node_name stdout ----

thread 'diagnostics::tests::a_node_finding_is_anchored_on_the_node_name' (841870) panicked at crates/casm-lsp/src/diagnostics.rs:384:9:
assertion `left == right` failed: just the name
  left: 0
 right: 9

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (841877) panicked at crates/casm-lsp/src/diagnostics.rs:367:9:
and it underlines something

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (841910) panicked at crates/casm-lsp/src/hover.rs:581:14:
the bound node is under the cursor

failures:
    diagnostics::tests::a_node_finding_is_anchored_on_the_node_name
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names

test result: FAILED. 189 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
