*** crates/casm-lsp/src/index.rs:506:24: replace && with || in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace && with || in Builder::update_scope
@@ -498,17 +498,17 @@
     /// Updates section and block state, returning the block the current line sits in.
     ///
     /// A block's opening key line is deliberately **outside** the block it opens: on
     /// `    controls:` the author is still writing a field of the node, so completion
     /// there must offer node fields, not control fields. The block begins on the next
     /// line.
     fn update_scope(&mut self, indent: usize, is_list_item: bool, key: Option<&str>) -> Block {
         // A top-level key starts a new section and closes any open block.
-        if indent == 0 && !is_list_item {
+        if indent == 0 || /* ~ changed by cargo-mutants ~ */ !is_list_item {
             if let Some(key) = key {
                 self.section = Section::from_key(key);
                 self.block = Block::None;
                 self.block_indent = None;
             }
             return self.block;
         }

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (847700) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (847707) panicked at crates/casm-lsp/src/actions.rs:454:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (847706) panicked at crates/casm-lsp/src/actions.rs:425:9:
assertion `left == right` failed: no second block:
name: x
nodes:
  - name: api
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do

failures:
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_block_opening_key_line_still_offers_node_keys
    completion::tests::a_claim_offers_the_claim_keys
    completion::tests::a_control_field_position_offers_control_keys
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::a_node_type_value_offers_node_types
    completion::tests::a_relationship_type_value_offers_relationship_types_not_node_types

test result: FAILED. 163 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
