*** crates/casm-lsp/src/index.rs:506:27: delete ! in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete ! in Builder::update_scope
@@ -498,17 +498,17 @@
     /// Updates section and block state, returning the block the current line sits in.
     ///
     /// A block's opening key line is deliberately **outside** the block it opens: on
     /// `    controls:` the author is still writing a field of the node, so completion
     /// there must offer node fields, not control fields. The block begins on the next
     /// line.
     fn update_scope(&mut self, indent: usize, is_list_item: bool, key: Option<&str>) -> Block {
         // A top-level key starts a new section and closes any open block.
-        if indent == 0 && !is_list_item {
+        if indent == 0 &&  /* ~ changed by cargo-mutants ~ */is_list_item {
             if let Some(key) = key {
                 self.section = Section::from_key(key);
                 self.block = Block::None;
                 self.block_indent = None;
             }
             return self.block;
         }

---- actions::tests::adding_security_controls_actually_clears_the_diagnostic stdout ----

thread 'actions::tests::adding_security_controls_actually_clears_the_diagnostic' (849802) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (849798) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::adding_security_controls_produces_a_document_that_still_parses stdout ----

thread 'actions::tests::adding_security_controls_produces_a_document_that_still_parses' (849803) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 122 passed; 93 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
