*** crates/casm-lsp/src/index.rs:526:24: replace < with == in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace < with == in Builder::update_scope
@@ -518,17 +518,17 @@
         // A sequence entry at the *same* indent as its key is valid YAML and common:
         //
         //     controls:
         //     - type: security      <- still inside `controls:`
         //
         // so a list item at the opening indent stays in the block. Only a non-item at or
         // below that indent leaves it.
         if let Some(open_at) = self.block_indent
-            && (indent < open_at || (indent == open_at && !is_list_item))
+            && (indent == /* ~ changed by cargo-mutants ~ */ open_at || (indent == open_at && !is_list_item))
         {
             self.block = Block::None;
             self.block_indent = None;
         }
 
         let block_of_this_line = self.block;
 
         // Entering a block, effective from the following line.

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (851877) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- completion::tests::an_endpoint_completion_annotates_each_node_with_its_type stdout ----

thread 'completion::tests::an_endpoint_completion_annotates_each_node_with_its_type' (851998) panicked at crates/casm-lsp/src/completion.rs:500:14:
declared

---- completion::tests::an_endpoint_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::an_endpoint_offers_the_nodes_this_document_declares' (851999) panicked at crates/casm-lsp/src/completion.rs:483:9:
assertion `left == right` failed
  left: ["api"]
 right: ["api", "orders-db"]

failures:
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    completion::tests::an_endpoint_completion_annotates_each_node_with_its_type
    completion::tests::an_endpoint_offers_the_nodes_this_document_declares
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse
    index::tests::a_block_closes_when_the_next_list_item_begins
    index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block
    index::tests::node_declarations_are_collected_with_their_types

test result: FAILED. 207 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
