*** crates/casm-lsp/src/index.rs:526:24: replace < with <= in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace < with <= in Builder::update_scope
@@ -518,17 +518,17 @@
         // A sequence entry at the *same* indent as its key is valid YAML and common:
         //
         //     controls:
         //     - type: security      <- still inside `controls:`
         //
         // so a list item at the opening indent stays in the block. Only a non-item at or
         // below that indent leaves it.
         if let Some(open_at) = self.block_indent
-            && (indent < open_at || (indent == open_at && !is_list_item))
+            && (indent <= /* ~ changed by cargo-mutants ~ */ open_at || (indent == open_at && !is_list_item))
         {
             self.block = Block::None;
             self.block_indent = None;
         }
 
         let block_of_this_line = self.block;
 
         // Entering a block, effective from the following line.

---- index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block stdout ----

thread 'index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block' (856009) panicked at crates/casm-lsp/src/index.rs:933:9:
assertion `left == right` failed: first entry, flush with the key
  left: None
 right: Controls

failures:
    index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
