*** crates/casm-lsp/src/index.rs:526:34: replace || with && in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace || with && in Builder::update_scope
@@ -518,17 +518,17 @@
         // A sequence entry at the *same* indent as its key is valid YAML and common:
         //
         //     controls:
         //     - type: security      <- still inside `controls:`
         //
         // so a list item at the opening indent stays in the block. Only a non-item at or
         // below that indent leaves it.
         if let Some(open_at) = self.block_indent
-            && (indent < open_at || (indent == open_at && !is_list_item))
+            && (indent < open_at && /* ~ changed by cargo-mutants ~ */ (indent == open_at && !is_list_item))
         {
             self.block = Block::None;
             self.block_indent = None;
         }
 
         let block_of_this_line = self.block;
 
         // Entering a block, effective from the following line.

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (851844) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- completion::tests::a_block_opening_key_line_still_offers_node_keys stdout ----

thread 'completion::tests::a_block_opening_key_line_still_offers_node_keys' (851898) panicked at crates/casm-lsp/src/completion.rs:585:9:
assertion `left == right` failed
  left: InterfaceKey
 right: NodeKey

---- completion::tests::a_control_type_value_offers_control_types stdout ----

thread 'completion::tests::a_control_type_value_offers_control_types' (851911) panicked at crates/casm-lsp/src/completion.rs:455:9:
assertion `left == right` failed
  left: None
 right: ControlTypeValue

failures:
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    completion::tests::a_block_opening_key_line_still_offers_node_keys
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::an_endpoint_completion_annotates_each_node_with_its_type
    completion::tests::an_endpoint_offers_the_nodes_this_document_declares
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    index::tests::a_block_closes_when_a_sibling_key_appears_at_the_same_indent
    index::tests::a_block_closes_when_the_next_list_item_begins
    index::tests::a_control_type_is_not_mistaken_for_a_node_type
    index::tests::nested_blocks_are_tracked

test result: FAILED. 202 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
