*** crates/casm-lsp/src/index.rs:526:45: replace == with != in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in Builder::update_scope
@@ -518,17 +518,17 @@
         // A sequence entry at the *same* indent as its key is valid YAML and common:
         //
         //     controls:
         //     - type: security      <- still inside `controls:`
         //
         // so a list item at the opening indent stays in the block. Only a non-item at or
         // below that indent leaves it.
         if let Some(open_at) = self.block_indent
-            && (indent < open_at || (indent == open_at && !is_list_item))
+            && (indent < open_at || (indent != /* ~ changed by cargo-mutants ~ */ open_at && !is_list_item))
         {
             self.block = Block::None;
             self.block_indent = None;
         }
 
         let block_of_this_line = self.block;
 
         // Entering a block, effective from the following line.

---- completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library stdout ----

thread 'completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library' (856977) panicked at crates/casm-lsp/src/completion.rs:786:9:
assertion `left == right` failed
  left: ClaimKey
 right: BindingRoleKey

---- completion::tests::a_binding_value_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::a_binding_value_offers_the_nodes_this_document_declares' (856979) panicked at crates/casm-lsp/src/completion.rs:775:9:
assertion `left == right` failed
  left: None
 right: NodeNameValue

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (856978) panicked at crates/casm-lsp/src/completion.rs:763:9:
assertion `left == right` failed
  left: ClaimKey
 right: BindingRoleKey

failures:
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    index::tests::a_bound_node_is_a_reference_to_it
    index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block
    index::tests::bindings_are_indexed_by_role
    index::tests::nested_blocks_are_tracked

test result: FAILED. 206 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
