*** crates/casm-lsp/src/index.rs:526:59: delete ! in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete ! in Builder::update_scope
@@ -518,17 +518,17 @@
         // A sequence entry at the *same* indent as its key is valid YAML and common:
         //
         //     controls:
         //     - type: security      <- still inside `controls:`
         //
         // so a list item at the opening indent stays in the block. Only a non-item at or
         // below that indent leaves it.
         if let Some(open_at) = self.block_indent
-            && (indent < open_at || (indent == open_at && !is_list_item))
+            && (indent < open_at || (indent == open_at &&  /* ~ changed by cargo-mutants ~ */is_list_item))
         {
             self.block = Block::None;
             self.block_indent = None;
         }
 
         let block_of_this_line = self.block;
 
         // Entering a block, effective from the following line.

---- completion::tests::a_block_opening_key_line_still_offers_node_keys stdout ----

thread 'completion::tests::a_block_opening_key_line_still_offers_node_keys' (857525) panicked at crates/casm-lsp/src/completion.rs:585:9:
assertion `left == right` failed
  left: InterfaceKey
 right: NodeKey

---- completion::tests::a_control_type_value_offers_control_types stdout ----

thread 'completion::tests::a_control_type_value_offers_control_types' (857528) panicked at crates/casm-lsp/src/completion.rs:455:9:
assertion `left == right` failed
  left: None
 right: ControlTypeValue

---- hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block stdout ----

thread 'hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block' (857600) panicked at crates/casm-lsp/src/hover.rs:483:14:
the key is under the cursor

failures:
    completion::tests::a_block_opening_key_line_still_offers_node_keys
    completion::tests::a_control_type_value_offers_control_types
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    index::tests::a_block_closes_when_a_sibling_key_appears_at_the_same_indent
    index::tests::a_control_type_is_not_mistaken_for_a_node_type
    index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block
    index::tests::nested_blocks_are_tracked

test result: FAILED. 207 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
