*** crates/casm-lsp/src/index.rs:535:23: replace == with != in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in Builder::update_scope
@@ -527,17 +527,17 @@
         {
             self.block = Block::None;
             self.block_indent = None;
         }
 
         let block_of_this_line = self.block;
 
         // Entering a block, effective from the following line.
-        if self.block == Block::None {
+        if self.block != /* ~ changed by cargo-mutants ~ */ Block::None {
             match (self.section, key) {
                 (Section::Nodes | Section::Relationships, Some("interfaces")) => {
                     self.block = Block::Interfaces;
                     self.block_indent = Some(indent);
                 }
                 (Section::Nodes | Section::Relationships, Some("controls")) => {
                     self.block = Block::Controls;
                     self.block_indent = Some(indent);

---- completion::tests::a_control_field_position_offers_control_keys stdout ----

thread 'completion::tests::a_control_field_position_offers_control_keys' (861070) panicked at crates/casm-lsp/src/completion.rs:576:9:
assertion `left == right` failed
  left: NodeKey
 right: ControlKey

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (861066) panicked at crates/casm-lsp/src/completion.rs:763:9:
assertion `left == right` failed
  left: ClaimKey
 right: BindingRoleKey

---- completion::tests::a_binding_value_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::a_binding_value_offers_the_nodes_this_document_declares' (861067) panicked at crates/casm-lsp/src/completion.rs:775:9:
assertion `left == right` failed
  left: None
 right: NodeNameValue

failures:
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_control_field_position_offers_control_keys
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::an_endpoint_offers_the_nodes_this_document_declares
    completion::tests::an_interface_field_position_offers_interface_keys_not_node_keys
    completion::tests::an_interface_name_is_not_offered_as_a_node_reference
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    index::tests::a_block_closes_when_a_sibl

test result: FAILED. 194 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
