*** crates/casm-lsp/src/index.rs:537:17: delete match arm (Section::Nodes | Section::Relationships, Some("interfaces")) in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Nodes | Section::Relationships, Some("interfaces")) in Builder::update_scope
@@ -529,20 +529,17 @@
             self.block_indent = None;
         }
 
         let block_of_this_line = self.block;
 
         // Entering a block, effective from the following line.
         if self.block == Block::None {
             match (self.section, key) {
-                (Section::Nodes | Section::Relationships, Some("interfaces")) => {
-                    self.block = Block::Interfaces;
-                    self.block_indent = Some(indent);
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 (Section::Nodes | Section::Relationships, Some("controls")) => {
                     self.block = Block::Controls;
                     self.block_indent = Some(indent);
                 }
                 (Section::Patterns, Some("bind")) => {
                     self.block = Block::Bindings;
                     self.block_indent = Some(indent);
                 }

---- completion::tests::an_endpoint_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::an_endpoint_offers_the_nodes_this_document_declares' (861319) panicked at crates/casm-lsp/src/completion.rs:483:9:
assertion `left == right` failed
  left: ["api", "rest", "orders-db"]
 right: ["api", "orders-db"]

---- completion::tests::an_interface_field_position_offers_interface_keys_not_node_keys stdout ----

thread 'completion::tests::an_interface_field_position_offers_interface_keys_not_node_keys' (861320) panicked at crates/casm-lsp/src/completion.rs:561:9:
assertion `left == right` failed
  left: NodeKey
 right: InterfaceKey

---- completion::tests::an_interface_name_is_not_offered_as_a_node_reference stdout ----

thread 'completion::tests::an_interface_name_is_not_offered_as_a_node_reference' (861321) panicked at crates/casm-lsp/src/completion.rs:508:9:
assertion failed: !labels(&result).contains(&"rest".to_owned())

failures:
    completion::tests::an_endpoint_offers_the_nodes_this_document_declares
    completion::tests::an_interface_field_position_offers_interface_keys_not_node_keys
    completion::tests::an_interface_name_is_not_offered_as_a_node_reference
    index::tests::a_block_opening_key_sits_outside_the_block_it_opens
    index::tests::an_interface_name_is_not_mistaken_for_a_node_declaration
    index::tests::nested_blocks_are_tracked
    index::tests::node_declarations_are_collected_with_their_types

test result: FAILED. 208 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
