*** crates/casm-lsp/src/index.rs:541:17: delete match arm (Section::Nodes | Section::Relationships, Some("controls")) in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Nodes | Section::Relationships, Some("controls")) in Builder::update_scope
@@ -533,20 +533,17 @@
 
         // Entering a block, effective from the following line.
         if self.block == Block::None {
             match (self.section, key) {
                 (Section::Nodes | Section::Relationships, Some("interfaces")) => {
                     self.block = Block::Interfaces;
                     self.block_indent = Some(indent);
                 }
-                (Section::Nodes | Section::Relationships, Some("controls")) => {
-                    self.block = Block::Controls;
-                    self.block_indent = Some(indent);
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 (Section::Patterns, Some("bind")) => {
                     self.block = Block::Bindings;
                     self.block_indent = Some(indent);
                 }
                 _ => {}
             }
         }

---- completion::tests::a_control_field_position_offers_control_keys stdout ----

thread 'completion::tests::a_control_field_position_offers_control_keys' (861535) panicked at crates/casm-lsp/src/completion.rs:576:9:
assertion `left == right` failed
  left: NodeKey
 right: ControlKey

---- completion::tests::a_control_type_value_offers_control_types stdout ----

thread 'completion::tests::a_control_type_value_offers_control_types' (861536) panicked at crates/casm-lsp/src/completion.rs:455:9:
assertion `left == right` failed
  left: NodeTypeValue
 right: ControlTypeValue

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (861606) panicked at crates/casm-lsp/src/hover.rs:444:9:
`security` is not a recognised node type.

failures:
    completion::tests::a_control_field_position_offers_control_keys
    completion::tests::a_control_type_value_offers_control_types
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse
    index::tests::a_block_closes_when_a_sibling_key_appears_at_the_same_indent
    index::tests::a_control_type_is_not_mistaken_for_a_node_type
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block
    index::tests::nested_blocks_are_tracked
    index::tests::node_declarations_are_collected_with_their_types

test result: FAILED. 204 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
