*** crates/casm-lsp/src/index.rs:545:17: delete match arm (Section::Patterns, Some("bind")) in Builder::update_scope

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Patterns, Some("bind")) in Builder::update_scope
@@ -537,20 +537,17 @@
                 (Section::Nodes | Section::Relationships, Some("interfaces")) => {
                     self.block = Block::Interfaces;
                     self.block_indent = Some(indent);
                 }
                 (Section::Nodes | Section::Relationships, Some("controls")) => {
                     self.block = Block::Controls;
                     self.block_indent = Some(indent);
                 }
-                (Section::Patterns, Some("bind")) => {
-                    self.block = Block::Bindings;
-                    self.block_indent = Some(indent);
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
         }
 
         block_of_this_line
     }
 
     /// Records a symbol for the line, if it carries one.

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (861761) panicked at crates/casm-lsp/src/completion.rs:763:9:
assertion `left == right` failed
  left: ClaimKey
 right: BindingRoleKey

---- completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library stdout ----

thread 'completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library' (861760) panicked at crates/casm-lsp/src/completion.rs:786:9:
assertion `left == right` failed
  left: ClaimKey
 right: BindingRoleKey

---- completion::tests::a_binding_value_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::a_binding_value_offers_the_nodes_this_document_declares' (861762) panicked at crates/casm-lsp/src/completion.rs:775:9:
assertion `left == right` failed
  left: None
 right: NodeNameValue

failures:
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    hover::tests::hovering_a_bound_node_explains_the_node
    index::tests::a_bound_node_is_a_reference_to_it
    index::tests::bindings_are_indexed_by_role

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
