*** crates/casm-lsp/src/index.rs:558:9: replace Builder::record_symbol with ()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace Builder::record_symbol with ()
@@ -550,46 +550,17 @@
             }
         }
 
         block_of_this_line
     }
 
     /// Records a symbol for the line, if it carries one.
     fn record_symbol(&mut self, info: &LineInfo) {
-        let (Some(key), Some(value), Some(span)) =
-            (info.key.as_deref(), info.value.clone(), info.value_span)
-        else {
-            return;
-        };
-
-        let kind = match (info.section, info.block, key) {
-            (Section::Nodes, Block::None, "name") => SymbolKind::NodeDefinition,
-            (Section::Nodes, Block::None, "type") => SymbolKind::NodeTypeValue,
-            (Section::Relationships, Block::None, "type") => SymbolKind::RelationshipTypeValue,
-            (Section::Relationships, Block::None, "source") => {
-                SymbolKind::NodeReference(Endpoint::Source)
-            }
-            (Section::Relationships, Block::None, "target") => {
-                SymbolKind::NodeReference(Endpoint::Target)
-            }
-            (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
-            // Every key inside `bind:` is a role name, so the *value* is the node
-            // reference regardless of what the key is called.
-            (Section::Patterns, Block::Bindings, _) => SymbolKind::BindingTarget,
-            (_, Block::Controls, "type") => SymbolKind::ControlTypeValue,
-            (_, _, "protocol") => SymbolKind::ProtocolValue,
-            _ => return,
-        };
-
-        self.symbols.push(Symbol {
-            kind,
-            text: value,
-            span,
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Records or extends a node declaration.
     fn record_node(&mut self, info: &LineInfo) {
         if info.section != Section::Nodes {
             return;
         }

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (867555) panicked at crates/casm-lsp/src/diagnostics.rs:363:9:
assertion `left == right` failed: the `target: ghost` line
  left: 0
 right: 6

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (867602) panicked at crates/casm-lsp/src/hover.rs:555:14:
the reference is under the cursor

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (867600) panicked at crates/casm-lsp/src/hover.rs:581:14:
the bound node is under the cursor

failures:
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics

test result: FAILED. 184 passed; 31 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
