*** crates/casm-lsp/src/index.rs:565:13: delete match arm (Section::Nodes, Block::None, "name") in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Nodes, Block::None, "name") in Builder::record_symbol
@@ -557,17 +557,17 @@
     fn record_symbol(&mut self, info: &LineInfo) {
         let (Some(key), Some(value), Some(span)) =
             (info.key.as_deref(), info.value.clone(), info.value_span)
         else {
             return;
         };
 
         let kind = match (info.section, info.block, key) {
-            (Section::Nodes, Block::None, "name") => SymbolKind::NodeDefinition,
+             /* ~ changed by cargo-mutants ~ */
             (Section::Nodes, Block::None, "type") => SymbolKind::NodeTypeValue,
             (Section::Relationships, Block::None, "type") => SymbolKind::RelationshipTypeValue,
             (Section::Relationships, Block::None, "source") => {
                 SymbolKind::NodeReference(Endpoint::Source)
             }
             (Section::Relationships, Block::None, "target") => {
                 SymbolKind::NodeReference(Endpoint::Target)
             }

---- hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls stdout ----

thread 'hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls' (865564) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it stdout ----

thread 'hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it' (865565) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- hover::tests::hovering_a_node_name_shows_its_type_and_description stdout ----

thread 'hover::tests::hovering_a_node_name_shows_its_type_and_description' (865566) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

failures:
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse
    hover::tests::hovering_reports_the_span_so_the_editor_can_highlight_it
    index::tests::a_position_resolves_to_the_symbol_under_it
    index::tests::spans_point_at_the_value_not_the_whole_line
    navigation::tests::a_declaration_resolves_to_itself
    navigation::tests::references_can_exclude_the_declaration
    navigation::tests::references_finds_every_mention
    navigation::tests::references_works_from_a_use_site_not_only_the_declaration

test result: FAILED. 204 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
