*** crates/casm-lsp/src/index.rs:567:13: delete match arm (Section::Relationships, Block::None, "type") in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Relationships, Block::None, "type") in Builder::record_symbol
@@ -559,17 +559,17 @@
             (info.key.as_deref(), info.value.clone(), info.value_span)
         else {
             return;
         };
 
         let kind = match (info.section, info.block, key) {
             (Section::Nodes, Block::None, "name") => SymbolKind::NodeDefinition,
             (Section::Nodes, Block::None, "type") => SymbolKind::NodeTypeValue,
-            (Section::Relationships, Block::None, "type") => SymbolKind::RelationshipTypeValue,
+             /* ~ changed by cargo-mutants ~ */
             (Section::Relationships, Block::None, "source") => {
                 SymbolKind::NodeReference(Endpoint::Source)
             }
             (Section::Relationships, Block::None, "target") => {
                 SymbolKind::NodeReference(Endpoint::Target)
             }
             (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
             // Every key inside `bind:` is a role name, so the *value* is the node

---- hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics stdout ----

thread 'hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics' (865807) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- index::tests::a_relationship_type_is_distinguished_from_a_node_type stdout ----

thread 'index::tests::a_relationship_type_is_distinguished_from_a_node_type' (865831) panicked at crates/casm-lsp/src/index.rs:1017:75:
called `Option::unwrap()` on a `None` value

failures:
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    index::tests::a_relationship_type_is_distinguished_from_a_node_type

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
