*** crates/casm-lsp/src/index.rs:568:13: delete match arm (Section::Relationships, Block::None, "source") in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Relationships, Block::None, "source") in Builder::record_symbol
@@ -560,19 +560,17 @@
         else {
             return;
         };
 
         let kind = match (info.section, info.block, key) {
             (Section::Nodes, Block::None, "name") => SymbolKind::NodeDefinition,
             (Section::Nodes, Block::None, "type") => SymbolKind::NodeTypeValue,
             (Section::Relationships, Block::None, "type") => SymbolKind::RelationshipTypeValue,
-            (Section::Relationships, Block::None, "source") => {
-                SymbolKind::NodeReference(Endpoint::Source)
-            }
+             /* ~ changed by cargo-mutants ~ */
             (Section::Relationships, Block::None, "target") => {
                 SymbolKind::NodeReference(Endpoint::Target)
             }
             (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
             // Every key inside `bind:` is a role name, so the *value* is the node
             // reference regardless of what the key is called.
             (Section::Patterns, Block::Bindings, _) => SymbolKind::BindingTarget,
             (_, Block::Controls, "type") => SymbolKind::ControlTypeValue,

---- hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix stdout ----

thread 'hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix' (870095) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names stdout ----

thread 'hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names' (870092) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- index::tests::references_to_a_node_are_found stdout ----

thread 'index::tests::references_to_a_node_are_found' (870132) panicked at crates/casm-lsp/src/index.rs:1075:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names
    hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix
    index::tests::references_to_a_node_are_found
    index::tests::relationship_endpoints_are_indexed_as_references
    navigation::tests::an_endpoint_resolves_to_the_node_declaration
    navigation::tests::both_endpoints_resolve_independently
    navigation::tests::navigation_works_on_a_document_that_does_not_parse
    navigation::tests::references_can_exclude_the_declaration
    navigation::tests::references_finds_every_mention
    navigation::tests::references_works_from_a_use_site_not_only_the_declaration

test result: FAILED. 205 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
