*** crates/casm-lsp/src/index.rs:571:13: delete match arm (Section::Relationships, Block::None, "target") in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Relationships, Block::None, "target") in Builder::record_symbol
@@ -563,19 +563,17 @@
 
         let kind = match (info.section, info.block, key) {
             (Section::Nodes, Block::None, "name") => SymbolKind::NodeDefinition,
             (Section::Nodes, Block::None, "type") => SymbolKind::NodeTypeValue,
             (Section::Relationships, Block::None, "type") => SymbolKind::RelationshipTypeValue,
             (Section::Relationships, Block::None, "source") => {
                 SymbolKind::NodeReference(Endpoint::Source)
             }
-            (Section::Relationships, Block::None, "target") => {
-                SymbolKind::NodeReference(Endpoint::Target)
-            }
+             /* ~ changed by cargo-mutants ~ */
             (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
             // Every key inside `bind:` is a role name, so the *value* is the node
             // reference regardless of what the key is called.
             (Section::Patterns, Block::Bindings, _) => SymbolKind::BindingTarget,
             (_, Block::Controls, "type") => SymbolKind::ControlTypeValue,
             (_, _, "protocol") => SymbolKind::ProtocolValue,
             _ => return,
         };

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (870270) panicked at crates/casm-lsp/src/diagnostics.rs:363:9:
assertion `left == right` failed: the `target: ghost` line
  left: 0
 right: 6

---- index::tests::relationship_endpoints_are_indexed_as_references stdout ----

thread 'index::tests::relationship_endpoints_are_indexed_as_references' (870365) panicked at crates/casm-lsp/src/index.rs:1032:9:
assertion `left == right` failed
  left: None
 right: Some("orders-db")

---- navigation::tests::both_endpoints_resolve_independently stdout ----

thread 'navigation::tests::both_endpoints_resolve_independently' (870389) panicked at crates/casm-lsp/src/navigation.rs:164:62:
target resolves

failures:
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint
    index::tests::relationship_endpoints_are_indexed_as_references
    navigation::tests::both_endpoints_resolve_independently

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
