*** crates/casm-lsp/src/index.rs:574:13: delete match arm (Section::Patterns, Block::None, "pattern") in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Patterns, Block::None, "pattern") in Builder::record_symbol
@@ -566,17 +566,17 @@
             (Section::Nodes, Block::None, "type") => SymbolKind::NodeTypeValue,
             (Section::Relationships, Block::None, "type") => SymbolKind::RelationshipTypeValue,
             (Section::Relationships, Block::None, "source") => {
                 SymbolKind::NodeReference(Endpoint::Source)
             }
             (Section::Relationships, Block::None, "target") => {
                 SymbolKind::NodeReference(Endpoint::Target)
             }
-            (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
+             /* ~ changed by cargo-mutants ~ */
             // Every key inside `bind:` is a role name, so the *value* is the node
             // reference regardless of what the key is called.
             (Section::Patterns, Block::Bindings, _) => SymbolKind::BindingTarget,
             (_, Block::Controls, "type") => SymbolKind::ControlTypeValue,
             (_, _, "protocol") => SymbolKind::ProtocolValue,
             _ => return,
         };

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (870530) panicked at crates/casm-lsp/src/hover.rs:555:14:
the reference is under the cursor

---- hover::tests::hovering_a_pattern_the_library_lacks_says_so stdout ----

thread 'hover::tests::hovering_a_pattern_the_library_lacks_says_so' (870538) panicked at crates/casm-lsp/src/hover.rs:570:14:
the reference is under the cursor

failures:
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_pattern_the_library_lacks_says_so

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
