*** crates/casm-lsp/src/index.rs:577:13: delete match arm (Section::Patterns, Block::Bindings, _) in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (Section::Patterns, Block::Bindings, _) in Builder::record_symbol
@@ -569,17 +569,17 @@
                 SymbolKind::NodeReference(Endpoint::Source)
             }
             (Section::Relationships, Block::None, "target") => {
                 SymbolKind::NodeReference(Endpoint::Target)
             }
             (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
             // Every key inside `bind:` is a role name, so the *value* is the node
             // reference regardless of what the key is called.
-            (Section::Patterns, Block::Bindings, _) => SymbolKind::BindingTarget,
+             /* ~ changed by cargo-mutants ~ */
             (_, Block::Controls, "type") => SymbolKind::ControlTypeValue,
             (_, _, "protocol") => SymbolKind::ProtocolValue,
             _ => return,
         };
 
         self.symbols.push(Symbol {
             kind,
             text: value,

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (875494) panicked at crates/casm-lsp/src/hover.rs:581:14:
the bound node is under the cursor

---- index::tests::a_bound_node_is_a_reference_to_it stdout ----

thread 'index::tests::a_bound_node_is_a_reference_to_it' (875518) panicked at crates/casm-lsp/src/index.rs:1315:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    index::tests::a_bound_node_is_a_reference_to_it

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
