*** crates/casm-lsp/src/index.rs:578:13: delete match arm (_, Block::Controls, "type") in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (_, Block::Controls, "type") in Builder::record_symbol
@@ -570,17 +570,17 @@
             }
             (Section::Relationships, Block::None, "target") => {
                 SymbolKind::NodeReference(Endpoint::Target)
             }
             (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
             // Every key inside `bind:` is a role name, so the *value* is the node
             // reference regardless of what the key is called.
             (Section::Patterns, Block::Bindings, _) => SymbolKind::BindingTarget,
-            (_, Block::Controls, "type") => SymbolKind::ControlTypeValue,
+             /* ~ changed by cargo-mutants ~ */
             (_, _, "protocol") => SymbolKind::ProtocolValue,
             _ => return,
         };
 
         self.symbols.push(Symbol {
             kind,
             text: value,
             span,

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (873104) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- index::tests::a_control_type_is_not_mistaken_for_a_node_type stdout ----

thread 'index::tests::a_control_type_is_not_mistaken_for_a_node_type' (873130) panicked at crates/casm-lsp/src/index.rs:1003:14:
the control type is indexed

---- index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block stdout ----

thread 'index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block' (873141) panicked at crates/casm-lsp/src/index.rs:951:9:
assertion `left == right` failed
  left: []
 right: ["security", "compliance"]

failures:
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    index::tests::a_control_type_is_not_mistaken_for_a_node_type
    index::tests::a_sequence_indented_flush_with_its_key_stays_inside_the_block

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
