*** crates/casm-lsp/src/index.rs:579:13: delete match arm (_, _, "protocol") in Builder::record_symbol

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm (_, _, "protocol") in Builder::record_symbol
@@ -571,17 +571,17 @@
             (Section::Relationships, Block::None, "target") => {
                 SymbolKind::NodeReference(Endpoint::Target)
             }
             (Section::Patterns, Block::None, "pattern") => SymbolKind::PatternReference,
             // Every key inside `bind:` is a role name, so the *value* is the node
             // reference regardless of what the key is called.
             (Section::Patterns, Block::Bindings, _) => SymbolKind::BindingTarget,
             (_, Block::Controls, "type") => SymbolKind::ControlTypeValue,
-            (_, _, "protocol") => SymbolKind::ProtocolValue,
+             /* ~ changed by cargo-mutants ~ */
             _ => return,
         };
 
         self.symbols.push(Symbol {
             kind,
             text: value,
             span,
         });

---- hover::tests::hovering_a_protocol_explains_it stdout ----

thread 'hover::tests::hovering_a_protocol_explains_it' (873432) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback stdout ----

thread 'hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback' (873435) panicked at crates/casm-lsp/src/hover.rs:355:10:
something is under the cursor

---- index::tests::protocols_are_indexed_in_both_interfaces_and_relationships stdout ----

thread 'index::tests::protocols_are_indexed_in_both_interfaces_and_relationships' (873472) panicked at crates/casm-lsp/src/index.rs:1046:9:
assertion `left == right` failed
  left: []
 right: ["http2", "sql"]

failures:
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback
    index::tests::protocols_are_indexed_in_both_interfaces_and_relationships

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
