*** crates/casm-lsp/src/index.rs:599:36: replace == with != in Builder::record_node

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in Builder::record_node
@@ -591,17 +591,17 @@
     fn record_node(&mut self, info: &LineInfo) {
         if info.section != Section::Nodes {
             return;
         }
 
         // A node's `name:` on a `- ` line opens a new declaration.
         if info.block == Block::None
             && info.is_list_item
-            && info.key.as_deref() == Some("name")
+            && info.key.as_deref() != /* ~ changed by cargo-mutants ~ */ Some("name")
             && let (Some(name), Some(span)) = (info.value.clone(), info.value_span)
         {
             self.nodes.push(NodeEntry {
                 name,
                 name_span: span,
                 node_type: None,
                 item_line: info.number,
                 last_line: info.number,

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (879757) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (879761) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (879760) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_value_offers_the_nodes_this_document_decl

test result: FAILED. 181 passed; 34 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
