*** crates/casm-lsp/src/index.rs:617:24: replace >= with < in Builder::record_node

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace >= with < in Builder::record_node
@@ -609,17 +609,17 @@
             });
             return;
         }
 
         // Any subsequent line indented within the item extends it.
         let Some(current) = self.nodes.last_mut() else {
             return;
         };
-        if info.indent >= current.field_indent {
+        if info.indent < /* ~ changed by cargo-mutants ~ */ current.field_indent {
             current.last_line = info.number;
             if info.block == Block::None && info.key.as_deref() == Some("type") {
                 current.node_type.clone_from(&info.value);
             }
         }
     }
 
     /// Records or extends a relationship declaration.

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (879500) panicked at crates/casm-lsp/src/actions.rs:425:9:
assertion `left == right` failed: no second block:
name: x
nodes:
  - name: api
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (879501) panicked at crates/casm-lsp/src/actions.rs:454:9:
the fix must match the surrounding style:
name: x
nodes:
  - name: api
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do

---- completion::tests::an_endpoint_completion_annotates_each_node_with_its_type stdout ----

thread 'completion::tests::an_endpoint_completion_annotates_each_node_with_its_type' (879526) panicked at crates/casm-lsp/src/completion.rs:501:9:
assertion `left == right` failed
  left: "node"
 right: "database"

failures:
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    completion::tests::an_endpoint_completion_annotates_each_node_with_its_type
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse
    index::tests::node_declarations_are_collected_with_their_types
    navigation::tests::an_outline_entry_spans_the_whole_node_item
    navigation::tests::the_outline_lists_every_node_with_its_type

test result: FAILED. 208 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
