*** crates/casm-lsp/src/index.rs:619:42: replace && with || in Builder::record_node

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace && with || in Builder::record_node
@@ -611,17 +611,17 @@
         }
 
         // Any subsequent line indented within the item extends it.
         let Some(current) = self.nodes.last_mut() else {
             return;
         };
         if info.indent >= current.field_indent {
             current.last_line = info.number;
-            if info.block == Block::None && info.key.as_deref() == Some("type") {
+            if info.block == Block::None || /* ~ changed by cargo-mutants ~ */ info.key.as_deref() == Some("type") {
                 current.node_type.clone_from(&info.value);
             }
         }
     }
 
     /// Records or extends a relationship declaration.
     fn record_relationship(&mut self, info: &LineInfo) {
         if info.section != Section::Relationships || info.block != Block::None {

---- hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse stdout ----

thread 'hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse' (883116) panicked at crates/casm-lsp/src/hover.rs:409:9:
the scraped type is still shown: **api** — _security_

_Showing partial information: the document does not currently parse._

---- index::tests::node_declarations_are_collected_with_their_types stdout ----

thread 'index::tests::node_declarations_are_collected_with_their_types' (883191) panicked at crates/casm-lsp/src/index.rs:975:9:
assertion `left == right` failed
  left: Some("security")
 right: Some("service")

failures:
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse
    index::tests::node_declarations_are_collected_with_their_types

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
