*** crates/casm-lsp/src/index.rs:619:65: replace == with != in Builder::record_node

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in Builder::record_node
@@ -611,17 +611,17 @@
         }
 
         // Any subsequent line indented within the item extends it.
         let Some(current) = self.nodes.last_mut() else {
             return;
         };
         if info.indent >= current.field_indent {
             current.last_line = info.number;
-            if info.block == Block::None && info.key.as_deref() == Some("type") {
+            if info.block == Block::None && info.key.as_deref() != /* ~ changed by cargo-mutants ~ */ Some("type") {
                 current.node_type.clone_from(&info.value);
             }
         }
     }
 
     /// Records or extends a relationship declaration.
     fn record_relationship(&mut self, info: &LineInfo) {
         if info.section != Section::Relationships || info.block != Block::None {

---- completion::tests::an_endpoint_completion_annotates_each_node_with_its_type stdout ----

thread 'completion::tests::an_endpoint_completion_annotates_each_node_with_its_type' (883134) panicked at crates/casm-lsp/src/completion.rs:501:9:
assertion `left == right` failed
  left: "node"
 right: "database"

---- hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse stdout ----

thread 'hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse' (883307) panicked at crates/casm-lsp/src/hover.rs:409:9:
the scraped type is still shown: **api** — _type not yet declared_

_Showing partial information: the document does not currently parse._

---- index::tests::node_declarations_are_collected_with_their_types stdout ----

thread 'index::tests::node_declarations_are_collected_with_their_types' (883342) panicked at crates/casm-lsp/src/index.rs:975:9:
assertion `left == right` failed
  left: None
 right: Some("service")

failures:
    completion::tests::an_endpoint_completion_annotates_each_node_with_its_type
    hover::tests::hovering_degrades_gracefully_when_the_document_does_not_parse
    index::tests::node_declarations_are_collected_with_their_types
    navigation::tests::the_outline_lists_every_node_with_its_type

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
