*** crates/casm-lsp/src/index.rs:627:51: replace || with && in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace || with && in Builder::record_relationship
@@ -619,17 +619,17 @@
             if info.block == Block::None && info.key.as_deref() == Some("type") {
                 current.node_type.clone_from(&info.value);
             }
         }
     }
 
     /// Records or extends a relationship declaration.
     fn record_relationship(&mut self, info: &LineInfo) {
-        if info.section != Section::Relationships || info.block != Block::None {
+        if info.section != Section::Relationships && /* ~ changed by cargo-mutants ~ */ info.block != Block::None {
             return;
         }
 
         if info.is_list_item {
             self.relationships.push(RelationshipEntry {
                 item_line: info.number,
                 last_line: info.number,
                 field_indent: info.field_indent(),

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (886827) panicked at crates/casm-lsp/src/index.rs:1234:9:
assertion `left == right` failed: the `source:` line
  left: 4
 right: 19

---- index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry stdout ----

thread 'index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry' (886831) panicked at crates/casm-lsp/src/index.rs:1218:9:
assertion `left == right` failed: the control item is not a relationship
  left: 2
 right: 1

---- index::tests::relationship_declarations_are_collected_with_all_three_fields stdout ----

thread 'index::tests::relationship_declarations_are_collected_with_all_three_fields' (886846) panicked at crates/casm-lsp/src/index.rs:1172:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::relationship_declarations_are_collected_with_all_three_fields

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
