*** crates/casm-lsp/src/index.rs:627:65: replace != with == in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace != with == in Builder::record_relationship
@@ -619,17 +619,17 @@
             if info.block == Block::None && info.key.as_deref() == Some("type") {
                 current.node_type.clone_from(&info.value);
             }
         }
     }
 
     /// Records or extends a relationship declaration.
     fn record_relationship(&mut self, info: &LineInfo) {
-        if info.section != Section::Relationships || info.block != Block::None {
+        if info.section != Section::Relationships || info.block == /* ~ changed by cargo-mutants ~ */ Block::None {
             return;
         }
 
         if info.is_list_item {
             self.relationships.push(RelationshipEntry {
                 item_line: info.number,
                 last_line: info.number,
                 field_indent: info.field_indent(),

---- diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line stdout ----

thread 'diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line' (887209) panicked at crates/casm-lsp/src/diagnostics.rs:399:9:
assertion `left == right` failed: the `- source: partner` line
  left: 0
 right: 7

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (887281) panicked at crates/casm-lsp/src/index.rs:1233:22:
index out of bounds: the len is 0 but the index is 0

---- index::tests::a_relationship_is_found_by_its_endpoints stdout ----

thread 'index::tests::a_relationship_is_found_by_its_endpoints' (887282) panicked at crates/casm-lsp/src/index.rs:1205:9:
assertion failed: found.is_some()

failures:
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::a_relationship_is_found_by_its_endpoints
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::relationship_declarations_are_collected_with_all_three_fields
    index::tests::several_relationships_are_kept_separate

test result: FAILED. 208 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
