*** crates/casm-lsp/src/index.rs:627:9: replace Builder::record_relationship with ()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace Builder::record_relationship with ()
@@ -619,52 +619,17 @@
             if info.block == Block::None && info.key.as_deref() == Some("type") {
                 current.node_type.clone_from(&info.value);
             }
         }
     }
 
     /// Records or extends a relationship declaration.
     fn record_relationship(&mut self, info: &LineInfo) {
-        if info.section != Section::Relationships || info.block != Block::None {
-            return;
-        }
-
-        if info.is_list_item {
-            self.relationships.push(RelationshipEntry {
-                item_line: info.number,
-                last_line: info.number,
-                field_indent: info.field_indent(),
-                ..RelationshipEntry::default()
-            });
-        }
-
-        let Some(current) = self.relationships.last_mut() else {
-            return;
-        };
-
-        // Compared on *field* indent, not raw indent: `  - source: api` sits at indent 2
-        // but its key is a field at indent 4, exactly like the `    target: db` below it.
-        if info.field_indent() < current.field_indent {
-            return;
-        }
-
-        current.last_line = info.number;
-        match info.key.as_deref() {
-            Some("source") => {
-                current.source.clone_from(&info.value);
-                current.source_span = info.value_span;
-            }
-            Some("target") => {
-                current.target.clone_from(&info.value);
-                current.target_span = info.value_span;
-            }
-            Some("type") => current.kind.clone_from(&info.value),
-            _ => {}
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Records or extends a conformance claim.
     fn record_claim(&mut self, info: &LineInfo) {
         if info.section != Section::Patterns {
             return;
         }

---- diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line stdout ----

thread 'diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line' (887426) panicked at crates/casm-lsp/src/diagnostics.rs:399:9:
assertion `left == right` failed: the `- source: partner` line
  left: 0
 right: 7

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (887498) panicked at crates/casm-lsp/src/index.rs:1198:22:
index out of bounds: the len is 0 but the index is 0

---- index::tests::a_relationship_is_found_by_its_endpoints stdout ----

thread 'index::tests::a_relationship_is_found_by_its_endpoints' (887499) panicked at crates/casm-lsp/src/index.rs:1170:9:
assertion failed: found.is_some()

failures:
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::a_relationship_is_found_by_its_endpoints
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::relationship_declarations_are_collected_with_all_three_fields
    index::tests::several_relationships_are_kept_separate

test result: FAILED. 208 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
