*** crates/casm-lsp/src/index.rs:633:17: delete field item_line from struct RelationshipEntry expression in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete field item_line from struct RelationshipEntry expression in Builder::record_relationship
@@ -625,17 +625,17 @@
     /// Records or extends a relationship declaration.
     fn record_relationship(&mut self, info: &LineInfo) {
         if info.section != Section::Relationships || info.block != Block::None {
             return;
         }
 
         if info.is_list_item {
             self.relationships.push(RelationshipEntry {
-                item_line: info.number,
+                 /* ~ changed by cargo-mutants ~ */
                 last_line: info.number,
                 field_indent: info.field_indent(),
                 ..RelationshipEntry::default()
             });
         }
 
         let Some(current) = self.relationships.last_mut() else {
             return;

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (890871) panicked at crates/casm-lsp/src/index.rs:1244:9:
assertion `left == right` failed: falls back to the item
  left: 0
 right: 1

---- index::tests::relationship_declarations_are_collected_with_all_three_fields stdout ----

thread 'index::tests::relationship_declarations_are_collected_with_all_three_fields' (890890) panicked at crates/casm-lsp/src/index.rs:1176:9:
assertion `left == right` failed
  left: 0
 right: 19

failures:
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::relationship_declarations_are_collected_with_all_three_fields

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
