*** crates/casm-lsp/src/index.rs:635:17: delete field field_indent from struct RelationshipEntry expression in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete field field_indent from struct RelationshipEntry expression in Builder::record_relationship
@@ -627,17 +627,17 @@
         if info.section != Section::Relationships || info.block != Block::None {
             return;
         }
 
         if info.is_list_item {
             self.relationships.push(RelationshipEntry {
                 item_line: info.number,
                 last_line: info.number,
-                field_indent: info.field_indent(),
+                 /* ~ changed by cargo-mutants ~ */
                 ..RelationshipEntry::default()
             });
         }
 
         let Some(current) = self.relationships.last_mut() else {
             return;
         };

*** result: Success
