*** crates/casm-lsp/src/index.rs:646:32: replace < with > in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace < with > in Builder::record_relationship
@@ -638,17 +638,17 @@
         }
 
         let Some(current) = self.relationships.last_mut() else {
             return;
         };
 
         // Compared on *field* indent, not raw indent: `  - source: api` sits at indent 2
         // but its key is a field at indent 4, exactly like the `    target: db` below it.
-        if info.field_indent() < current.field_indent {
+        if info.field_indent() > /* ~ changed by cargo-mutants ~ */ current.field_indent {
             return;
         }
 
         current.last_line = info.number;
         match info.key.as_deref() {
             Some("source") => {
                 current.source.clone_from(&info.value);
                 current.source_span = info.value_span;

*** result: Success
