*** crates/casm-lsp/src/index.rs:646:32: replace < with <= in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace < with <= in Builder::record_relationship
@@ -638,17 +638,17 @@
         }
 
         let Some(current) = self.relationships.last_mut() else {
             return;
         };
 
         // Compared on *field* indent, not raw indent: `  - source: api` sits at indent 2
         // but its key is a field at indent 4, exactly like the `    target: db` below it.
-        if info.field_indent() < current.field_indent {
+        if info.field_indent() <= /* ~ changed by cargo-mutants ~ */ current.field_indent {
             return;
         }
 
         current.last_line = info.number;
         match info.key.as_deref() {
             Some("source") => {
                 current.source.clone_from(&info.value);
                 current.source_span = info.value_span;

---- diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line stdout ----

thread 'diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line' (894804) panicked at crates/casm-lsp/src/diagnostics.rs:399:9:
assertion `left == right` failed: the `- source: partner` line
  left: 0
 right: 7

---- index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in stdout ----

thread 'index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in' (894878) panicked at crates/casm-lsp/src/index.rs:1187:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry stdout ----

thread 'index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry' (894880) panicked at crates/casm-lsp/src/index.rs:1223:9:
assertion `left == right` failed: not 'security'
  left: None
 right: Some("sync")

failures:
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    index::tests::a_relationship_is_found_by_its_endpoints
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::relationship_declarations_are_collected_with_all_three_fields
    index::tests::several_relationships_are_kept_separate

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
