*** crates/casm-lsp/src/index.rs:652:13: delete match arm Some("source") in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm Some("source") in Builder::record_relationship
@@ -644,20 +644,17 @@
         // Compared on *field* indent, not raw indent: `  - source: api` sits at indent 2
         // but its key is a field at indent 4, exactly like the `    target: db` below it.
         if info.field_indent() < current.field_indent {
             return;
         }
 
         current.last_line = info.number;
         match info.key.as_deref() {
-            Some("source") => {
-                current.source.clone_from(&info.value);
-                current.source_span = info.value_span;
-            }
+             /* ~ changed by cargo-mutants ~ */
             Some("target") => {
                 current.target.clone_from(&info.value);
                 current.target_span = info.value_span;
             }
             Some("type") => current.kind.clone_from(&info.value),
             _ => {}
         }
     }

---- diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line stdout ----

thread 'diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line' (897706) panicked at crates/casm-lsp/src/diagnostics.rs:399:9:
assertion `left == right` failed: the `- source: partner` line
  left: 0
 right: 7

---- index::tests::a_relationship_anchor_prefers_the_source_then_the_target stdout ----

thread 'index::tests::a_relationship_anchor_prefers_the_source_then_the_target' (897852) panicked at crates/casm-lsp/src/index.rs:1231:9:
assertion `left == right` failed: the `source:` line
  left: 20
 right: 19

---- index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in stdout ----

thread 'index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in' (897854) panicked at crates/casm-lsp/src/index.rs:1184:9:
assertion `left == right` failed
  left: None
 right: Some("api")

failures:
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::a_relationship_is_found_by_its_endpoints
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::relationship_declarations_are_collected_with_all_three_fields
    index::tests::several_relationships_are_kept_separate

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
