*** crates/casm-lsp/src/index.rs:656:13: delete match arm Some("target") in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm Some("target") in Builder::record_relationship
@@ -648,20 +648,17 @@
         }
 
         current.last_line = info.number;
         match info.key.as_deref() {
             Some("source") => {
                 current.source.clone_from(&info.value);
                 current.source_span = info.value_span;
             }
-            Some("target") => {
-                current.target.clone_from(&info.value);
-                current.target_span = info.value_span;
-            }
+             /* ~ changed by cargo-mutants ~ */
             Some("type") => current.kind.clone_from(&info.value),
             _ => {}
         }
     }
 
     /// Records or extends a conformance claim.
     fn record_claim(&mut self, info: &LineInfo) {
         if info.section != Section::Patterns {

---- diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line stdout ----

thread 'diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line' (897796) panicked at crates/casm-lsp/src/diagnostics.rs:399:9:
assertion `left == right` failed: the `- source: partner` line
  left: 0
 right: 7

---- index::tests::a_relationship_is_found_by_its_endpoints stdout ----

thread 'index::tests::a_relationship_is_found_by_its_endpoints' (897949) panicked at crates/casm-lsp/src/index.rs:1202:9:
assertion failed: found.is_some()

---- index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in stdout ----

thread 'index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in' (897950) panicked at crates/casm-lsp/src/index.rs:1185:9:
assertion `left == right` failed
  left: None
 right: Some("db")

failures:
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    index::tests::a_relationship_is_found_by_its_endpoints
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::relationship_declarations_are_collected_with_all_three_fields

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
