*** crates/casm-lsp/src/index.rs:65:9: replace Section::from_key -> Self with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace Section::from_key -> Self with Default::default()
@@ -57,24 +57,17 @@
     Metadata,
     /// Inside a top-level key CASIMIR does not recognise.
     Unknown,
 }
 
 impl Section {
     /// Classifies a top-level key.
     fn from_key(key: &str) -> Self {
-        match key {
-            "nodes" => Self::Nodes,
-            "relationships" => Self::Relationships,
-            "patterns" => Self::Patterns,
-            "metadata" => Self::Metadata,
-            "name" | "version" | "description" => Self::Root,
-            _ => Self::Unknown,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A nested block within a node or relationship item.
 #[derive(Clone, Copy, Debug, Default, PartialEq, Eq, Hash)]
 pub enum Block {
     /// Directly on the item, not inside a nested sequence.
     #[default]

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (778771) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (778781) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::adding_security_controls_produces_a_document_that_still_parses stdout ----

thread 'actions::tests::adding_security_controls_produces_a_document_that_still_parses' (778779) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 122 passed; 93 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
