*** crates/casm-lsp/src/index.rs:660:13: delete match arm Some("type") in Builder::record_relationship

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm Some("type") in Builder::record_relationship
@@ -652,17 +652,17 @@
             Some("source") => {
                 current.source.clone_from(&info.value);
                 current.source_span = info.value_span;
             }
             Some("target") => {
                 current.target.clone_from(&info.value);
                 current.target_span = info.value_span;
             }
-            Some("type") => current.kind.clone_from(&info.value),
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
 
     /// Records or extends a conformance claim.
     fn record_claim(&mut self, info: &LineInfo) {
         if info.section != Section::Patterns {
             return;

---- index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry stdout ----

thread 'index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry' (898460) panicked at crates/casm-lsp/src/index.rs:1223:9:
assertion `left == right` failed: not 'security'
  left: None
 right: Some("sync")

---- index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in stdout ----

thread 'index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in' (898458) panicked at crates/casm-lsp/src/index.rs:1189:9:
assertion `left == right` failed
  left: None
 right: Some("sync")

---- index::tests::relationship_declarations_are_collected_with_all_three_fields stdout ----

thread 'index::tests::relationship_declarations_are_collected_with_all_three_fields' (898475) panicked at crates/casm-lsp/src/index.rs:1175:9:
assertion `left == right` failed
  left: None
 right: Some("sync")

failures:
    index::tests::a_relationship_is_indexed_whatever_order_its_fields_are_written_in
    index::tests::a_relationships_controls_block_does_not_create_a_spurious_entry
    index::tests::relationship_declarations_are_collected_with_all_three_fields

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
