*** crates/casm-lsp/src/index.rs:667:25: replace != with == in Builder::record_claim

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace != with == in Builder::record_claim
@@ -659,17 +659,17 @@
             }
             Some("type") => current.kind.clone_from(&info.value),
             _ => {}
         }
     }
 
     /// Records or extends a conformance claim.
     fn record_claim(&mut self, info: &LineInfo) {
-        if info.section != Section::Patterns {
+        if info.section == /* ~ changed by cargo-mutants ~ */ Section::Patterns {
             return;
         }
 
         if info.is_list_item && info.block == Block::None {
             self.claims.push(ClaimEntry {
                 item_line: info.number,
                 last_line: info.number,
                 field_indent: info.field_indent(),

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (901453) panicked at crates/casm-lsp/src/completion.rs:764:9:
assertion `left == right` failed
  left: []
 right: ["edge", "application"]

---- diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim stdout ----

thread 'diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim' (901527) panicked at crates/casm-lsp/src/diagnostics.rs:691:18:
the claim is indexed

---- diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one stdout ----

thread 'diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one' (901549) panicked at crates/casm-lsp/src/diagnostics.rs:674:14:
the claim is indexed

failures:
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim
    diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one
    index::tests::a_claim_is_found_by_its_reference
    index::tests::a_claim_that_is_still_being_typed_still_anchors
    index::tests::a_conformance_claim_is_indexed_with_its_reference
    index::tests::bindings_are_indexed_by_role

test result: FAILED. 208 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
