*** crates/casm-lsp/src/index.rs:66:13: delete match arm "nodes" in Section::from_key

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm "nodes" in Section::from_key
@@ -58,17 +58,17 @@
     /// Inside a top-level key CASIMIR does not recognise.
     Unknown,
 }
 
 impl Section {
     /// Classifies a top-level key.
     fn from_key(key: &str) -> Self {
         match key {
-            "nodes" => Self::Nodes,
+             /* ~ changed by cargo-mutants ~ */
             "relationships" => Self::Relationships,
             "patterns" => Self::Patterns,
             "metadata" => Self::Metadata,
             "name" | "version" | "description" => Self::Root,
             _ => Self::Unknown,
         }
     }
 }

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (781883) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

---- actions::tests::adding_security_controls_produces_a_document_that_still_parses stdout ----

thread 'actions::tests::adding_security_controls_produces_a_document_that_still_parses' (781889) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (781878) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_value_offers_the_nodes_this_document_decl

test result: FAILED. 153 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
