*** crates/casm-lsp/src/index.rs:671:30: replace && with || in Builder::record_claim

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace && with || in Builder::record_claim
@@ -663,17 +663,17 @@
     }
 
     /// Records or extends a conformance claim.
     fn record_claim(&mut self, info: &LineInfo) {
         if info.section != Section::Patterns {
             return;
         }
 
-        if info.is_list_item && info.block == Block::None {
+        if info.is_list_item || /* ~ changed by cargo-mutants ~ */ info.block == Block::None {
             self.claims.push(ClaimEntry {
                 item_line: info.number,
                 last_line: info.number,
                 field_indent: info.field_indent(),
                 ..ClaimEntry::default()
             });
         }

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (901241) panicked at crates/casm-lsp/src/completion.rs:764:9:
assertion `left == right` failed
  left: []
 right: ["edge", "application"]

---- index::tests::a_claim_that_is_still_being_typed_still_anchors stdout ----

thread 'index::tests::a_claim_that_is_still_being_typed_still_anchors' (901484) panicked at crates/casm-lsp/src/index.rs:1324:9:
assertion `left == right` failed
  left: 2
 right: 1

---- index::tests::a_conformance_claim_is_indexed_with_its_reference stdout ----

thread 'index::tests::a_conformance_claim_is_indexed_with_its_reference' (901488) panicked at crates/casm-lsp/src/index.rs:1280:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    index::tests::a_claim_that_is_still_being_typed_still_anchors
    index::tests::a_conformance_claim_is_indexed_with_its_reference
    index::tests::bindings_are_indexed_by_role
    index::tests::the_patterns_section_does_not_leak_into_the_next_one

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
