*** crates/casm-lsp/src/index.rs:673:17: delete field item_line from struct ClaimEntry expression in Builder::record_claim

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete field item_line from struct ClaimEntry expression in Builder::record_claim
@@ -665,17 +665,17 @@
     /// Records or extends a conformance claim.
     fn record_claim(&mut self, info: &LineInfo) {
         if info.section != Section::Patterns {
             return;
         }
 
         if info.is_list_item && info.block == Block::None {
             self.claims.push(ClaimEntry {
-                item_line: info.number,
+                 /* ~ changed by cargo-mutants ~ */
                 last_line: info.number,
                 field_indent: info.field_indent(),
                 ..ClaimEntry::default()
             });
         }
 
         let Some(current) = self.claims.last_mut() else {
             return;

---- index::tests::a_conformance_claim_is_indexed_with_its_reference stdout ----

thread 'index::tests::a_conformance_claim_is_indexed_with_its_reference' (905885) panicked at crates/casm-lsp/src/index.rs:1283:9:
assertion `left == right` failed
  left: 0
 right: 8

---- index::tests::a_claim_that_is_still_being_typed_still_anchors stdout ----

thread 'index::tests::a_claim_that_is_still_being_typed_still_anchors' (905883) panicked at crates/casm-lsp/src/index.rs:1326:9:
assertion `left == right` failed: the opening dash
  left: 0
 right: 2

failures:
    index::tests::a_claim_that_is_still_being_typed_still_anchors
    index::tests::a_conformance_claim_is_indexed_with_its_reference

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
