*** crates/casm-lsp/src/index.rs:67:13: delete match arm "relationships" in Section::from_key

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm "relationships" in Section::from_key
@@ -59,17 +59,17 @@
     Unknown,
 }
 
 impl Section {
     /// Classifies a top-level key.
     fn from_key(key: &str) -> Self {
         match key {
             "nodes" => Self::Nodes,
-            "relationships" => Self::Relationships,
+             /* ~ changed by cargo-mutants ~ */
             "patterns" => Self::Patterns,
             "metadata" => Self::Metadata,
             "name" | "version" | "description" => Self::Root,
             _ => Self::Unknown,
         }
     }
 }

---- completion::tests::an_endpoint_completion_annotates_each_node_with_its_type stdout ----

thread 'completion::tests::an_endpoint_completion_annotates_each_node_with_its_type' (783905) panicked at crates/casm-lsp/src/completion.rs:500:14:
declared

---- completion::tests::a_relationship_type_value_offers_relationship_types_not_node_types stdout ----

thread 'completion::tests::a_relationship_type_value_offers_relationship_types_not_node_types' (783901) panicked at crates/casm-lsp/src/completion.rs:441:9:
assertion `left == right` failed
  left: None
 right: RelationshipTypeValue

---- completion::tests::an_endpoint_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::an_endpoint_offers_the_nodes_this_document_declares' (783906) panicked at crates/casm-lsp/src/completion.rs:482:9:
assertion `left == right` failed
  left: None
 right: NodeNameValue

failures:
    completion::tests::a_relationship_type_value_offers_relationship_types_not_node_types
    completion::tests::an_endpoint_completion_annotates_each_node_with_its_type
    completion::tests::an_endpoint_offers_the_nodes_this_document_declares
    diagnostics::tests::a_relationship_finding_is_anchored_on_the_source_line
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_relationship_endpoint_describes_the_node_it_names
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    hover::tests::hovering_an_unresolvable_reference_says_so_and_suggests_a_fix
    index::tests::a_relationship_anchor_prefers_the_source_then_the_target
    index::tests::a_relationship_is_found_by_its_endpoints
    index::tests::a_relationship_is_indexed_whatever_orde

test result: FAILED. 190 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
