*** crates/casm-lsp/src/index.rs:683:32: replace < with > in Builder::record_claim

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace < with > in Builder::record_claim
@@ -675,17 +675,17 @@
                 field_indent: info.field_indent(),
                 ..ClaimEntry::default()
             });
         }
 
         let Some(current) = self.claims.last_mut() else {
             return;
         };
-        if info.field_indent() < current.field_indent {
+        if info.field_indent() > /* ~ changed by cargo-mutants ~ */ current.field_indent {
             return;
         }
 
         current.last_line = info.number;
         if info.block == Block::None && info.key.as_deref() == Some("pattern") {
             current.reference.clone_from(&info.value);
             current.reference_span = info.value_span;
         }

---- index::tests::bindings_are_indexed_by_role stdout ----

thread 'index::tests::bindings_are_indexed_by_role' (907840) panicked at crates/casm-lsp/src/index.rs:1300:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    index::tests::bindings_are_indexed_by_role

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
