*** crates/casm-lsp/src/index.rs:688:38: replace && with || in Builder::record_claim

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace && with || in Builder::record_claim
@@ -680,17 +680,17 @@
         let Some(current) = self.claims.last_mut() else {
             return;
         };
         if info.field_indent() < current.field_indent {
             return;
         }
 
         current.last_line = info.number;
-        if info.block == Block::None && info.key.as_deref() == Some("pattern") {
+        if info.block == Block::None || /* ~ changed by cargo-mutants ~ */ info.key.as_deref() == Some("pattern") {
             current.reference.clone_from(&info.value);
             current.reference_span = info.value_span;
         }
         if info.block == Block::Bindings
             && let (Some(role), Some(span)) = (info.key.clone(), info.value_span)
         {
             current.bindings.push((role, span));
         }

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (911641) panicked at crates/casm-lsp/src/completion.rs:764:9:
assertion `left == right` failed
  left: []
 right: ["edge", "application"]

---- diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim stdout ----

thread 'diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim' (911683) panicked at crates/casm-lsp/src/diagnostics.rs:691:18:
the claim is indexed

---- diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one stdout ----

thread 'diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one' (911689) panicked at crates/casm-lsp/src/diagnostics.rs:674:14:
the claim is indexed

failures:
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim
    diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one
    index::tests::a_claim_is_found_by_its_reference
    index::tests::a_conformance_claim_is_indexed_with_its_reference

test result: FAILED. 210 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
