*** crates/casm-lsp/src/index.rs:68:13: delete match arm "patterns" in Section::from_key

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm "patterns" in Section::from_key
@@ -60,17 +60,17 @@
 }
 
 impl Section {
     /// Classifies a top-level key.
     fn from_key(key: &str) -> Self {
         match key {
             "nodes" => Self::Nodes,
             "relationships" => Self::Relationships,
-            "patterns" => Self::Patterns,
+             /* ~ changed by cargo-mutants ~ */
             "metadata" => Self::Metadata,
             "name" | "version" | "description" => Self::Root,
             _ => Self::Unknown,
         }
     }
 }
 
 /// A nested block within a node or relationship item.

---- completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names stdout ----

thread 'completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names' (782890) panicked at crates/casm-lsp/src/completion.rs:763:9:
assertion `left == right` failed
  left: None
 right: BindingRoleKey

---- completion::tests::a_binding_value_offers_the_nodes_this_document_declares stdout ----

thread 'completion::tests::a_binding_value_offers_the_nodes_this_document_declares' (782894) panicked at crates/casm-lsp/src/completion.rs:775:9:
assertion `left == right` failed
  left: None
 right: NodeNameValue

---- completion::tests::a_claim_offers_the_claim_keys stdout ----

thread 'completion::tests::a_claim_offers_the_claim_keys' (782896) panicked at crates/casm-lsp/src/completion.rs:722:9:
assertion `left == right` failed
  left: None
 right: ClaimKey

failures:
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_not_in_the_library
    completion::tests::a_binding_key_offers_the_roles_the_claimed_pattern_names
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_claim_offers_the_claim_keys
    completion::tests::a_pattern_reference_is_completed_from_the_library
    completion::tests::an_empty_library_offers_no_references_rather_than_guessing
    diagnostics::tests::a_claim_the_library_does_not_hold_still_anchors_on_the_claim
    diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not_on_line_one
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_pattern_the_library_lacks_says_so

test result: FAILED. 197 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
