*** crates/casm-lsp/src/index.rs:692:23: replace == with != in Builder::record_claim

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in Builder::record_claim
@@ -684,17 +684,17 @@
             return;
         }
 
         current.last_line = info.number;
         if info.block == Block::None && info.key.as_deref() == Some("pattern") {
             current.reference.clone_from(&info.value);
             current.reference_span = info.value_span;
         }
-        if info.block == Block::Bindings
+        if info.block != /* ~ changed by cargo-mutants ~ */ Block::Bindings
             && let (Some(role), Some(span)) = (info.key.clone(), info.value_span)
         {
             current.bindings.push((role, span));
         }
     }
 
     /// Produces the finished index.
     fn finish(self) -> DocumentIndex {

---- index::tests::bindings_are_indexed_by_role stdout ----

thread 'index::tests::bindings_are_indexed_by_role' (916500) panicked at crates/casm-lsp/src/index.rs:1300:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    index::tests::bindings_are_indexed_by_role

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
