*** crates/casm-lsp/src/index.rs:69:13: delete match arm "metadata" in Section::from_key

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm "metadata" in Section::from_key
@@ -61,17 +61,17 @@
 
 impl Section {
     /// Classifies a top-level key.
     fn from_key(key: &str) -> Self {
         match key {
             "nodes" => Self::Nodes,
             "relationships" => Self::Relationships,
             "patterns" => Self::Patterns,
-            "metadata" => Self::Metadata,
+             /* ~ changed by cargo-mutants ~ */
             "name" | "version" | "description" => Self::Root,
             _ => Self::Unknown,
         }
     }
 }
 
 /// A nested block within a node or relationship item.
 #[derive(Clone, Copy, Debug, Default, PartialEq, Eq, Hash)]

*** result: Success
