*** crates/casm-lsp/src/index.rs:701:9: replace Builder::finish -> DocumentIndex with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace Builder::finish -> DocumentIndex with Default::default()
@@ -693,24 +693,17 @@
             && let (Some(role), Some(span)) = (info.key.clone(), info.value_span)
         {
             current.bindings.push((role, span));
         }
     }
 
     /// Produces the finished index.
     fn finish(self) -> DocumentIndex {
-        DocumentIndex {
-            lines: self.lines,
-            raw_lines: self.raw_lines,
-            symbols: self.symbols,
-            nodes: self.nodes,
-            relationships: self.relationships,
-            claims: self.claims,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A line's key and value, as byte ranges into the line body.
 #[derive(Default)]
 struct KeyValue<'a> {
     key: Option<&'a str>,
     key_range: Option<(usize, usize)>,

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (915886) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (915893) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (915890) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 108 passed; 107 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
