*** crates/casm-lsp/src/index.rs:70:13: delete match arm "name" | "version" | "description" in Section::from_key

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete match arm "name" | "version" | "description" in Section::from_key
@@ -62,17 +62,17 @@
 impl Section {
     /// Classifies a top-level key.
     fn from_key(key: &str) -> Self {
         match key {
             "nodes" => Self::Nodes,
             "relationships" => Self::Relationships,
             "patterns" => Self::Patterns,
             "metadata" => Self::Metadata,
-            "name" | "version" | "description" => Self::Root,
+             /* ~ changed by cargo-mutants ~ */
             _ => Self::Unknown,
         }
     }
 }
 
 /// A nested block within a node or relationship item.
 #[derive(Clone, Copy, Debug, Default, PartialEq, Eq, Hash)]
 pub enum Block {

---- completion::tests::a_field_completion_inserts_the_colon_and_a_space stdout ----

thread 'completion::tests::a_field_completion_inserts_the_colon_and_a_space' (785481) panicked at crates/casm-lsp/src/completion.rs:538:14:
offered

---- completion::tests::a_top_level_position_offers_root_keys stdout ----

thread 'completion::tests::a_top_level_position_offers_root_keys' (785488) panicked at crates/casm-lsp/src/completion.rs:515:9:
assertion `left == right` failed
  left: None
 right: RootKey

---- completion::tests::patterns_is_offered_as_a_top_level_key stdout ----

thread 'completion::tests::patterns_is_offered_as_a_top_level_key' (785501) panicked at crates/casm-lsp/src/completion.rs:732:9:
assertion failed: labels(&result).contains(&"patterns".to_owned())

failures:
    completion::tests::a_field_completion_inserts_the_colon_and_a_space
    completion::tests::a_top_level_position_offers_root_keys
    completion::tests::patterns_is_offered_as_a_top_level_key
    index::tests::top_level_keys_set_the_section

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
