*** crates/casm-lsp/src/index.rs:726:5: replace split_key_value -> KeyValue<'_> with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace split_key_value -> KeyValue<'_> with Default::default()
@@ -718,45 +718,17 @@
     value_range: Option<(usize, usize)>,
 }
 
 /// Splits `body` at its first `key:` separator.
 ///
 /// A colon only separates when followed by whitespace or end of line, which is YAML's own
 /// rule. Without it, `description: see http://example.com` would split at the wrong colon.
 fn split_key_value(body: &str) -> KeyValue<'_> {
-    let Some(colon) = find_separator(body) else {
-        return KeyValue::default();
-    };
-
-    let key_raw = body.get(..colon).unwrap_or("");
-    let key = key_raw.trim_end();
-    let key_start = key_raw.len().saturating_sub(key_raw.trim_start().len());
-
-    let after = body.get(colon.saturating_add(1)..).unwrap_or("");
-    let value_trimmed = after.trim();
-
-    let (value, value_range) = if value_trimmed.is_empty() {
-        (None, None)
-    } else {
-        let offset = colon
-            .saturating_add(1)
-            .saturating_add(after.len().saturating_sub(after.trim_start().len()));
-        (
-            Some(value_trimmed),
-            Some((offset, offset.saturating_add(value_trimmed.len()))),
-        )
-    };
-
-    KeyValue {
-        key: (!key.is_empty()).then_some(key),
-        key_range: (!key.is_empty()).then_some((key_start, key_start.saturating_add(key.len()))),
-        value,
-        value_range,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Finds the byte offset of the `key: value` separator, if the line has one.
 fn find_separator(body: &str) -> Option<usize> {
     body.char_indices().find_map(|(offset, character)| {
         if character != ':' {
             return None;
         }

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (918166) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (918171) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

---- actions::tests::adding_security_controls_actually_clears_the_diagnostic stdout ----

thread 'actions::tests::adding_security_controls_actually_clears_the_diagnostic' (918173) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 113 passed; 102 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
