*** crates/casm-lsp/src/index.rs:750:15: delete ! in split_key_value

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete ! in split_key_value
@@ -742,17 +742,17 @@
             .saturating_add(after.len().saturating_sub(after.trim_start().len()));
         (
             Some(value_trimmed),
             Some((offset, offset.saturating_add(value_trimmed.len()))),
         )
     };
 
     KeyValue {
-        key: (!key.is_empty()).then_some(key),
+        key: ( /* ~ changed by cargo-mutants ~ */key.is_empty()).then_some(key),
         key_range: (!key.is_empty()).then_some((key_start, key_start.saturating_add(key.len()))),
         value,
         value_range,
     }
 }
 
 /// Finds the byte offset of the `key: value` separator, if the line has one.
 fn find_separator(body: &str) -> Option<usize> {

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (918364) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (918385) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated stdout ----

thread 'actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated' (918393) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 117 passed; 98 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
