*** crates/casm-lsp/src/index.rs:751:21: delete ! in split_key_value

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ delete ! in split_key_value
@@ -743,17 +743,17 @@
         (
             Some(value_trimmed),
             Some((offset, offset.saturating_add(value_trimmed.len()))),
         )
     };
 
     KeyValue {
         key: (!key.is_empty()).then_some(key),
-        key_range: (!key.is_empty()).then_some((key_start, key_start.saturating_add(key.len()))),
+        key_range: ( /* ~ changed by cargo-mutants ~ */key.is_empty()).then_some((key_start, key_start.saturating_add(key.len()))),
         value,
         value_range,
     }
 }
 
 /// Finds the byte offset of the `key: value` separator, if the line has one.
 fn find_separator(body: &str) -> Option<usize> {
     body.char_indices().find_map(|(offset, character)| {

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (920798) panicked at crates/casm-lsp/src/hover.rs:591:14:
the key is under the cursor

---- hover::tests::hovering_a_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_key_explains_the_field' (920801) panicked at crates/casm-lsp/src/hover.rs:469:14:
the key is under the cursor

---- hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block stdout ----

thread 'hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block' (920802) panicked at crates/casm-lsp/src/hover.rs:483:14:
the key is under the cursor

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
