*** crates/casm-lsp/src/index.rs:759:5: replace find_separator -> Option<usize> with None

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace find_separator -> Option<usize> with None
@@ -751,25 +751,17 @@
         key_range: (!key.is_empty()).then_some((key_start, key_start.saturating_add(key.len()))),
         value,
         value_range,
     }
 }
 
 /// Finds the byte offset of the `key: value` separator, if the line has one.
 fn find_separator(body: &str) -> Option<usize> {
-    body.char_indices().find_map(|(offset, character)| {
-        if character != ':' {
-            return None;
-        }
-        let next = body
-            .get(offset.saturating_add(1)..)
-            .and_then(|rest| rest.chars().next());
-        matches!(next, None | Some(' ' | '\t')).then_some(offset)
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Removes a trailing `#` comment from a line.
 ///
 /// A `#` only begins a comment at the start of the line or after whitespace, so a value
 /// such as `standard: ISO27001#A.12` keeps its hash.
 #[must_use]
 pub fn strip_comment(line: &str) -> &str {

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (920477) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (920482) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (920483) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 113 passed; 102 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
