*** crates/casm-lsp/src/index.rs:760:22: replace != with == in find_separator

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace != with == in find_separator
@@ -752,17 +752,17 @@
         value,
         value_range,
     }
 }
 
 /// Finds the byte offset of the `key: value` separator, if the line has one.
 fn find_separator(body: &str) -> Option<usize> {
     body.char_indices().find_map(|(offset, character)| {
-        if character != ':' {
+        if character == /* ~ changed by cargo-mutants ~ */ ':' {
             return None;
         }
         let next = body
             .get(offset.saturating_add(1)..)
             .and_then(|rest| rest.chars().next());
         matches!(next, None | Some(' ' | '\t')).then_some(offset)
     })
 }

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (925127) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (925121) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::adding_security_controls_actually_clears_the_diagnostic stdout ----

thread 'actions::tests::adding_security_controls_actually_clears_the_diagnostic' (925128) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 110 passed; 105 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
