*** crates/casm-lsp/src/index.rs:779:22: replace == with != in strip_comment

*** mutation diff:
--- crates/casm-lsp/src/index.rs
+++ replace == with != in strip_comment
@@ -771,17 +771,17 @@
 ///
 /// A `#` only begins a comment at the start of the line or after whitespace, so a value
 /// such as `standard: ISO27001#A.12` keeps its hash.
 #[must_use]
 pub fn strip_comment(line: &str) -> &str {
     let mut previous_was_space = true;
 
     for (offset, character) in line.char_indices() {
-        if character == '#' && previous_was_space {
+        if character != /* ~ changed by cargo-mutants ~ */ '#' && previous_was_space {
             return line.get(..offset).unwrap_or(line);
         }
         previous_was_space = character.is_whitespace();
     }
 
     line
 }

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (929473) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (929479) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (929476) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    completion::tests::a_binding_key_offers_nothing_when_the_pattern_is_no

test result: FAILED. 111 passed; 104 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
