*** crates/casm-lsp/src/library.rs:104:5: replace load -> Discovery with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/library.rs
+++ replace load -> Discovery with Default::default()
@@ -96,37 +96,17 @@
         "no pattern library found — looked for 'patterns/' and '.casm/patterns/' in each \
          workspace folder. Conformance claims will be reported as unchecked; set \
          'casm.patterns' to point at one.",
     )
 }
 
 /// Loads a directory known to exist, turning any failure into a note.
 fn load(directory: &Path) -> Discovery {
-    match Library::load(directory) {
-        Ok(library) => {
-            let patterns: Vec<Pattern> = library.patterns().cloned().collect();
-            Discovery {
-                note: format!(
-                    "loaded {} pattern(s) from {}",
-                    patterns.len(),
-                    directory.display()
-                ),
-                patterns,
-                directory: Some(directory.to_path_buf()),
-            }
-        }
-        // The directory is real but something in it is not a pattern. Reporting the
-        // failure and carrying on with none beats refusing to serve the workspace.
-        Err(error) => Discovery::empty(format!(
-            "could not load the pattern library at {}: {}",
-            directory.display(),
-            error
-        )),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolves a configured path against the first workspace root.
 fn resolve(roots: &[PathBuf], setting: &str) -> PathBuf {
     let path = Path::new(setting);
     if path.is_absolute() {
         return path.to_path_buf();
     }

---- library::tests::a_conventional_directory_is_found stdout ----

thread 'library::tests::a_conventional_directory_is_found' (935758) panicked at crates/casm-lsp/src/library.rs:187:9:
assertion `left == right` failed
  left: 0
 right: 1

---- library::tests::a_malformed_pattern_is_reported_not_swallowed stdout ----

thread 'library::tests::a_malformed_pattern_is_reported_not_swallowed' (935759) panicked at crates/casm-lsp/src/library.rs:276:9:

---- library::tests::the_dotted_directory_is_the_fallback stdout ----

thread 'library::tests::the_dotted_directory_is_the_fallback' (935765) panicked at crates/casm-lsp/src/library.rs:202:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    library::tests::a_conventional_directory_is_found
    library::tests::a_malformed_pattern_is_reported_not_swallowed
    library::tests::a_setting_is_resolved_against_the_first_root
    library::tests::an_absolute_setting_ignores_the_roots
    library::tests::the_dotted_directory_is_the_fallback
    library::tests::the_first_hit_wins_rather_than_merging

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
