*** crates/casm-lsp/src/library.rs:129:5: replace resolve -> PathBuf with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/library.rs
+++ replace resolve -> PathBuf with Default::default()
@@ -121,23 +121,17 @@
             directory.display(),
             error
         )),
     }
 }
 
 /// Resolves a configured path against the first workspace root.
 fn resolve(roots: &[PathBuf], setting: &str) -> PathBuf {
-    let path = Path::new(setting);
-    if path.is_absolute() {
-        return path.to_path_buf();
-    }
-    roots
-        .first()
-        .map_or_else(|| path.to_path_buf(), |root| root.join(path))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns `true` if `path` is a file that could change what the library holds.
 ///
 /// Used to decide whether a `workspace/didChangeWatchedFiles` notification is worth a
 /// reload. A client may watch more than the server cares about, and re-reading the library
 /// on every YAML file in the repository would make every keystroke in an architecture file
 /// pay for it.

---- library::tests::a_setting_is_resolved_against_the_first_root stdout ----

thread 'library::tests::a_setting_is_resolved_against_the_first_root' (935175) panicked at crates/casm-lsp/src/library.rs:254:9:
assertion `left == right` failed
  left: 0
 right: 1

---- library::tests::an_absolute_setting_ignores_the_roots stdout ----

thread 'library::tests::an_absolute_setting_ignores_the_roots' (935178) panicked at crates/casm-lsp/src/library.rs:264:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    library::tests::a_setting_is_resolved_against_the_first_root
    library::tests::an_absolute_setting_ignores_the_roots

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
