*** crates/casm-lsp/src/library.rs:146:5: replace is_pattern_file -> bool with true

*** mutation diff:
--- crates/casm-lsp/src/library.rs
+++ replace is_pattern_file -> bool with true
@@ -138,24 +138,17 @@
 /// Returns `true` if `path` is a file that could change what the library holds.
 ///
 /// Used to decide whether a `workspace/didChangeWatchedFiles` notification is worth a
 /// reload. A client may watch more than the server cares about, and re-reading the library
 /// on every YAML file in the repository would make every keystroke in an architecture file
 /// pay for it.
 #[must_use]
 pub fn is_pattern_file(path: &Path, directory: Option<&Path>) -> bool {
-    let Some(directory) = directory else {
-        // With no library loaded, any file under a conventionally named directory could be
-        // the one that creates it.
-        return path
-            .parent()
-            .is_some_and(|parent| CONVENTIONAL.iter().any(|name| parent.ends_with(name)));
-    };
-    path.starts_with(directory)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- library::tests::only_files_in_the_loaded_directory_trigger_a_reload stdout ----

thread 'library::tests::only_files_in_the_loaded_directory_trigger_a_reload' (934582) panicked at crates/casm-lsp/src/library.rs:300:9:
assertion failed: !is_pattern_file(Path::new("/w/examples/storefront.yaml"), Some(directory))

---- library::tests::with_no_library_a_conventional_directory_still_triggers_one stdout ----

thread 'library::tests::with_no_library_a_conventional_directory_still_triggers_one' (934585) panicked at crates/casm-lsp/src/library.rs:314:9:
assertion failed: !is_pattern_file(Path::new("/w/src/main.rs"), None)

failures:
    library::tests::only_files_in_the_loaded_directory_trigger_a_reload
    library::tests::with_no_library_a_conventional_directory_still_triggers_one

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
