*** crates/casm-lsp/src/library.rs:56:9: replace Discovery::empty -> Self with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/library.rs
+++ replace Discovery::empty -> Self with Default::default()
@@ -48,21 +48,17 @@
     pub directory: Option<PathBuf>,
     /// One line for the client's log, describing what happened.
     pub note: String,
 }
 
 impl Discovery {
     /// A discovery that found nothing, for the stated reason.
     fn empty(note: impl Into<String>) -> Self {
-        Self {
-            patterns: Vec::new(),
-            directory: None,
-            note: note.into(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Finds and loads the library for a workspace.
 ///
 /// `roots` are the workspace folders the client reported, most significant first.
 /// `configured` is the `casm.patterns` setting, absolute or relative to the first root.
 ///

---- library::tests::a_malformed_pattern_is_reported_not_swallowed stdout ----

thread 'library::tests::a_malformed_pattern_is_reported_not_swallowed' (931007) panicked at crates/casm-lsp/src/library.rs:292:9:

---- library::tests::a_setting_pointing_nowhere_does_not_fall_back stdout ----

thread 'library::tests::a_setting_pointing_nowhere_does_not_fall_back' (931009) panicked at crates/casm-lsp/src/library.rs:279:9:

---- library::tests::a_workspace_with_no_library_says_where_it_looked stdout ----

thread 'library::tests::a_workspace_with_no_library_says_where_it_looked' (931010) panicked at crates/casm-lsp/src/library.rs:245:9:

failures:
    library::tests::a_malformed_pattern_is_reported_not_swallowed
    library::tests::a_setting_pointing_nowhere_does_not_fall_back
    library::tests::a_workspace_with_no_library_says_where_it_looked

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
