*** crates/casm-lsp/src/library.rs:74:5: replace discover -> Discovery with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/library.rs
+++ replace discover -> Discovery with Default::default()
@@ -66,42 +66,17 @@
 /// `roots` are the workspace folders the client reported, most significant first.
 /// `configured` is the `casm.patterns` setting, absolute or relative to the first root.
 ///
 /// An explicit setting is never silently ignored: a `configured` path that does not exist
 /// yields an empty library and says so, rather than falling back to a conventional
 /// directory the author did not ask for.
 #[must_use]
 pub fn discover(roots: &[PathBuf], configured: Option<&str>) -> Discovery {
-    if let Some(setting) = configured {
-        let candidate = resolve(roots, setting);
-        if !candidate.is_dir() {
-            return Discovery::empty(format!(
-                "casm.patterns is set to '{}', which is not a directory — conformance \
-                 claims will be reported as unchecked",
-                candidate.display()
-            ));
-        }
-        return load(&candidate);
-    }
-
-    for root in roots {
-        for suffix in CONVENTIONAL {
-            let candidate = root.join(suffix);
-            if candidate.is_dir() {
-                return load(&candidate);
-            }
-        }
-    }
-
-    Discovery::empty(
-        "no pattern library found — looked for 'patterns/' and '.casm/patterns/' in each \
-         workspace folder. Conformance claims will be reported as unchecked; set \
-         'casm.patterns' to point at one.",
-    )
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Loads a directory known to exist, turning any failure into a note.
 fn load(directory: &Path) -> Discovery {
     match Library::load(directory) {
         Ok(library) => {
             let patterns: Vec<Pattern> = library.patterns().cloned().collect();
             Discovery {

---- library::tests::a_malformed_pattern_is_reported_not_swallowed stdout ----

thread 'library::tests::a_malformed_pattern_is_reported_not_swallowed' (934918) panicked at crates/casm-lsp/src/library.rs:271:9:

---- library::tests::a_conventional_directory_is_found stdout ----

thread 'library::tests::a_conventional_directory_is_found' (934917) panicked at crates/casm-lsp/src/library.rs:182:9:
assertion `left == right` failed
  left: 0
 right: 1

---- library::tests::a_workspace_with_no_library_says_where_it_looked stdout ----

thread 'library::tests::a_workspace_with_no_library_says_where_it_looked' (934921) panicked at crates/casm-lsp/src/library.rs:224:9:

failures:
    library::tests::a_conventional_directory_is_found
    library::tests::a_malformed_pattern_is_reported_not_swallowed
    library::tests::a_setting_is_resolved_against_the_first_root
    library::tests::a_setting_pointing_nowhere_does_not_fall_back
    library::tests::a_workspace_with_no_library_says_where_it_looked
    library::tests::an_absolute_setting_ignores_the_roots
    library::tests::the_dotted_directory_is_the_fallback
    library::tests::the_first_hit_wins_rather_than_merging

test result: FAILED. 207 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
