*** crates/casm-lsp/src/library.rs:76:12: delete ! in discover

*** mutation diff:
--- crates/casm-lsp/src/library.rs
+++ delete ! in discover
@@ -68,17 +68,17 @@
 ///
 /// An explicit setting is never silently ignored: a `configured` path that does not exist
 /// yields an empty library and says so, rather than falling back to a conventional
 /// directory the author did not ask for.
 #[must_use]
 pub fn discover(roots: &[PathBuf], configured: Option<&str>) -> Discovery {
     if let Some(setting) = configured {
         let candidate = resolve(roots, setting);
-        if !candidate.is_dir() {
+        if  /* ~ changed by cargo-mutants ~ */candidate.is_dir() {
             return Discovery::empty(format!(
                 "casm.patterns is set to '{}', which is not a directory — conformance \
                  claims will be reported as unchecked",
                 candidate.display()
             ));
         }
         return load(&candidate);
     }

---- library::tests::a_setting_pointing_nowhere_does_not_fall_back stdout ----

thread 'library::tests::a_setting_pointing_nowhere_does_not_fall_back' (931224) panicked at crates/casm-lsp/src/library.rs:283:9:
could not load the pattern library at /tmp/casm-lsp-library-nowhere-930934/does-not-exist: cannot read '/tmp/casm-lsp-library-nowhere-930934/does-not-exist': No such file or directory (os error 2)

---- library::tests::a_setting_is_resolved_against_the_first_root stdout ----

thread 'library::tests::a_setting_is_resolved_against_the_first_root' (931223) panicked at crates/casm-lsp/src/library.rs:260:9:
assertion `left == right` failed
  left: 0
 right: 1

---- library::tests::an_absolute_setting_ignores_the_roots stdout ----

thread 'library::tests::an_absolute_setting_ignores_the_roots' (931226) panicked at crates/casm-lsp/src/library.rs:270:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    library::tests::a_setting_is_resolved_against_the_first_root
    library::tests::a_setting_pointing_nowhere_does_not_fall_back
    library::tests::an_absolute_setting_ignores_the_roots

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
