*** crates/casm-lsp/src/main.rs:24:5: replace main with ()

*** mutation diff:
--- crates/casm-lsp/src/main.rs
+++ replace main with ()
@@ -16,14 +16,10 @@
 
 #![forbid(unsafe_code)]
 
 use casm_lsp::Backend;
 use tower_lsp_server::{LspService, Server};
 
 #[tokio::main]
 async fn main() {
-    let stdin = tokio::io::stdin();
-    let stdout = tokio::io::stdout();
-
-    let (service, socket) = LspService::new(Backend::new);
-    Server::new(stdin, stdout, socket).serve(service).await;
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
