*** crates/casm-lsp/src/navigation.rs:101:5: replace outline -> Vec<Outline> with vec![]

*** mutation diff:
--- crates/casm-lsp/src/navigation.rs
+++ replace outline -> Vec<Outline> with vec![]
@@ -93,27 +93,17 @@
     );
     spans.sort_unstable();
     spans
 }
 
 /// Builds the document outline: one entry per declared node.
 #[must_use]
 pub fn outline(index: &DocumentIndex) -> Vec<Outline> {
-    index
-        .nodes()
-        .iter()
-        .map(|node| Outline {
-            name: node.name.clone(),
-            detail: node.node_type.clone().unwrap_or_else(|| "node".to_owned()),
-            selection_span: node.name_span,
-            start_line: node.item_line,
-            end_line: node.last_line,
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- navigation::tests::an_outline_entry_spans_the_whole_node_item stdout ----

thread 'navigation::tests::an_outline_entry_spans_the_whole_node_item' (945816) panicked at crates/casm-lsp/src/navigation.rs:250:35:
index out of bounds: the len is 0 but the index is 0

---- navigation::tests::a_node_without_a_type_still_outlines stdout ----

thread 'navigation::tests::a_node_without_a_type_still_outlines' (945812) panicked at crates/casm-lsp/src/navigation.rs:260:9:
assertion `left == right` failed
  left: 0
 right: 1

---- navigation::tests::the_outline_lists_every_node_with_its_type stdout ----

thread 'navigation::tests::the_outline_lists_every_node_with_its_type' (945829) panicked at crates/casm-lsp/src/navigation.rs:240:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    navigation::tests::a_node_without_a_type_still_outlines
    navigation::tests::an_outline_entry_spans_the_whole_node_item
    navigation::tests::the_outline_lists_every_node_with_its_type

test result: FAILED. 212 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
