*** crates/casm-lsp/src/navigation.rs:43:5: replace definition -> Option<Span> with None

*** mutation diff:
--- crates/casm-lsp/src/navigation.rs
+++ replace definition -> Option<Span> with None
@@ -35,32 +35,17 @@
 
 /// Resolves the declaration of whatever is under `position`.
 ///
 /// Returns the span of the declaring `name:` value. A cursor already on a declaration
 /// resolves to itself, which is what lets an editor confirm "yes, this is the definition"
 /// rather than appearing to do nothing.
 #[must_use]
 pub fn definition(index: &DocumentIndex, position: Position) -> Option<Span> {
-    let symbol = index.symbol_at(position)?;
-
-    match symbol.kind {
-        // A `bind:` value names a node exactly as `source:` does, so it resolves the
-        // same way.
-        SymbolKind::NodeReference(_) | SymbolKind::NodeDefinition | SymbolKind::BindingTarget => {
-            index.node_named(&symbol.text).map(|node| node.name_span)
-        }
-        // Vocabulary terms declare nothing, and a pattern is declared in another file
-        // this index does not cover.
-        SymbolKind::PatternReference
-        | SymbolKind::NodeTypeValue
-        | SymbolKind::RelationshipTypeValue
-        | SymbolKind::ControlTypeValue
-        | SymbolKind::ProtocolValue => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Finds every mention of the node under `position`.
 ///
 /// Includes the declaration when `include_declaration` is set, matching the protocol's
 /// `ReferenceParams.context.includeDeclaration`. Results are in document order.
 #[must_use]
 pub fn references(

---- navigation::tests::a_declaration_resolves_to_itself stdout ----

thread 'navigation::tests::a_declaration_resolves_to_itself' (940704) panicked at crates/casm-lsp/src/navigation.rs:158:62:
resolves

---- navigation::tests::an_endpoint_resolves_to_the_node_declaration stdout ----

thread 'navigation::tests::an_endpoint_resolves_to_the_node_declaration' (940707) panicked at crates/casm-lsp/src/navigation.rs:141:62:
api is declared

---- navigation::tests::navigation_works_on_a_document_that_does_not_parse stdout ----

thread 'navigation::tests::navigation_works_on_a_document_that_does_not_parse' (940713) panicked at crates/casm-lsp/src/navigation.rs:189:62:
api still resolves

failures:
    navigation::tests::a_declaration_resolves_to_itself
    navigation::tests::an_endpoint_resolves_to_the_node_declaration
    navigation::tests::both_endpoints_resolve_independently
    navigation::tests::navigation_works_on_a_document_that_does_not_parse

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
