*** crates/casm-lsp/src/navigation.rs:71:5: replace references -> Vec<Span> with vec![]

*** mutation diff:
--- crates/casm-lsp/src/navigation.rs
+++ replace references -> Vec<Span> with vec![]
@@ -63,41 +63,17 @@
 /// Includes the declaration when `include_declaration` is set, matching the protocol's
 /// `ReferenceParams.context.includeDeclaration`. Results are in document order.
 #[must_use]
 pub fn references(
     index: &DocumentIndex,
     position: Position,
     include_declaration: bool,
 ) -> Vec<Span> {
-    let Some(symbol) = index.symbol_at(position) else {
-        return Vec::new();
-    };
-
-    if !matches!(
-        symbol.kind,
-        SymbolKind::NodeDefinition | SymbolKind::NodeReference(_)
-    ) {
-        return Vec::new();
-    }
-
-    let mut spans: Vec<Span> = Vec::new();
-
-    if include_declaration && let Some(declaration) = index.node_named(&symbol.text) {
-        spans.push(declaration.name_span);
-    }
-
-    spans.extend(
-        index
-            .references_to(&symbol.text)
-            .into_iter()
-            .map(|found| found.span),
-    );
-    spans.sort_unstable();
-    spans
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Builds the document outline: one entry per declared node.
 #[must_use]
 pub fn outline(index: &DocumentIndex) -> Vec<Outline> {
     index
         .nodes()
         .iter()

---- navigation::tests::references_finds_every_mention stdout ----

thread 'navigation::tests::references_finds_every_mention' (943279) panicked at crates/casm-lsp/src/navigation.rs:189:9:
assertion `left == right` failed: []
  left: 0
 right: 3

---- navigation::tests::references_can_exclude_the_declaration stdout ----

thread 'navigation::tests::references_can_exclude_the_declaration' (943278) panicked at crates/casm-lsp/src/navigation.rs:197:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    navigation::tests::references_can_exclude_the_declaration
    navigation::tests::references_finds_every_mention

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
