*** crates/casm-lsp/src/navigation.rs:71:5: replace references -> Vec<Span> with vec![Default::default()]

*** mutation diff:
--- crates/casm-lsp/src/navigation.rs
+++ replace references -> Vec<Span> with vec![Default::default()]
@@ -63,41 +63,17 @@
 /// Includes the declaration when `include_declaration` is set, matching the protocol's
 /// `ReferenceParams.context.includeDeclaration`. Results are in document order.
 #[must_use]
 pub fn references(
     index: &DocumentIndex,
     position: Position,
     include_declaration: bool,
 ) -> Vec<Span> {
-    let Some(symbol) = index.symbol_at(position) else {
-        return Vec::new();
-    };
-
-    if !matches!(
-        symbol.kind,
-        SymbolKind::NodeDefinition | SymbolKind::NodeReference(_)
-    ) {
-        return Vec::new();
-    }
-
-    let mut spans: Vec<Span> = Vec::new();
-
-    if include_declaration && let Some(declaration) = index.node_named(&symbol.text) {
-        spans.push(declaration.name_span);
-    }
-
-    spans.extend(
-        index
-            .references_to(&symbol.text)
-            .into_iter()
-            .map(|found| found.span),
-    );
-    spans.sort_unstable();
-    spans
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Builds the document outline: one entry per declared node.
 #[must_use]
 pub fn outline(index: &DocumentIndex) -> Vec<Outline> {
     index
         .nodes()
         .iter()

---- navigation::tests::references_can_exclude_the_declaration stdout ----

thread 'navigation::tests::references_can_exclude_the_declaration' (943596) panicked at crates/casm-lsp/src/navigation.rs:197:9:
assertion `left == right` failed
  left: 1
 right: 2

---- navigation::tests::references_on_a_non_node_symbol_finds_nothing stdout ----

thread 'navigation::tests::references_on_a_non_node_symbol_finds_nothing' (943598) panicked at crates/casm-lsp/src/navigation.rs:212:9:
assertion failed: references(&index, on_value(&index, 3), true).is_empty()

---- navigation::tests::references_finds_every_mention stdout ----

thread 'navigation::tests::references_finds_every_mention' (943597) panicked at crates/casm-lsp/src/navigation.rs:189:9:
assertion `left == right` failed: [Span { line: 0, start: 0, end: 0 }]
  left: 1
 right: 3

failures:
    navigation::tests::references_can_exclude_the_declaration
    navigation::tests::references_finds_every_mention
    navigation::tests::references_on_a_non_node_symbol_finds_nothing
    navigation::tests::references_on_empty_space_finds_nothing

test result: FAILED. 211 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
