*** crates/casm-lsp/src/navigation.rs:75:8: delete ! in references

*** mutation diff:
--- crates/casm-lsp/src/navigation.rs
+++ delete ! in references
@@ -67,17 +67,17 @@
     index: &DocumentIndex,
     position: Position,
     include_declaration: bool,
 ) -> Vec<Span> {
     let Some(symbol) = index.symbol_at(position) else {
         return Vec::new();
     };
 
-    if !matches!(
+    if  /* ~ changed by cargo-mutants ~ */matches!(
         symbol.kind,
         SymbolKind::NodeDefinition | SymbolKind::NodeReference(_)
     ) {
         return Vec::new();
     }
 
     let mut spans: Vec<Span> = Vec::new();

---- navigation::tests::references_can_exclude_the_declaration stdout ----

thread 'navigation::tests::references_can_exclude_the_declaration' (941006) panicked at crates/casm-lsp/src/navigation.rs:221:9:
assertion `left == right` failed
  left: 0
 right: 2

---- navigation::tests::references_finds_every_mention stdout ----

thread 'navigation::tests::references_finds_every_mention' (941007) panicked at crates/casm-lsp/src/navigation.rs:213:9:
assertion `left == right` failed: []
  left: 0
 right: 3

failures:
    navigation::tests::references_can_exclude_the_declaration
    navigation::tests::references_finds_every_mention

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
