*** crates/casm-lsp/src/schema.rs:40:9: replace Term::to_markdown -> String with String::new()

*** mutation diff:
--- crates/casm-lsp/src/schema.rs
+++ replace Term::to_markdown -> String with String::new()
@@ -32,20 +32,17 @@
     /// The full explanation, shown on hover and in the expanded completion view.
     pub documentation: &'static str,
 }
 
 impl Term {
     /// Renders this term as Markdown for a hover tooltip.
     #[must_use]
     pub fn to_markdown(&self) -> String {
-        format!(
-            "**{}** — _{}_\n\n{}",
-            self.label, self.detail, self.documentation
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Looks up a term by its label in `terms`.
 #[must_use]
 pub fn find<'a>(terms: &'a [Term], label: &str) -> Option<&'a Term> {
     terms.iter().find(|term| term.label == label)
 }

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (945361) panicked at crates/casm-lsp/src/hover.rs:594:9:

---- hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block stdout ----

thread 'hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block' (945376) panicked at crates/casm-lsp/src/hover.rs:485:9:

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (945374) panicked at crates/casm-lsp/src/hover.rs:444:9:

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    schema::tests::markdown_rendering_includes_label_detail_and_documentation

test result: FAILED. 207 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
