*** crates/casm-lsp/src/schema.rs:50:41: replace == with != in find

*** mutation diff:
--- crates/casm-lsp/src/schema.rs
+++ replace == with != in find
@@ -42,17 +42,17 @@
             self.label, self.detail, self.documentation
         )
     }
 }
 
 /// Looks up a term by its label in `terms`.
 #[must_use]
 pub fn find<'a>(terms: &'a [Term], label: &str) -> Option<&'a Term> {
-    terms.iter().find(|term| term.label == label)
+    terms.iter().find(|term| term.label != /* ~ changed by cargo-mutants ~ */ label)
 }
 
 /// Keys valid at the top level of a document.
 pub const ROOT_KEYS: &[Term] = &[
     Term {
         label: "name",
         detail: "required",
         documentation: "The architecture's name. ASCII alphanumerics, `-`, `_`, and `.`, \

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (948090) panicked at crates/casm-lsp/src/hover.rs:444:9:
**compliance** — _auditable_

Satisfies an external regulatory or certification obligation.

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (948087) panicked at crates/casm-lsp/src/hover.rs:594:9:
**pattern** — _required, `name@version`_

The pattern being claimed, at an exact version. A claim naming a pattern the library does not hold is reported as unchecked, never assumed satisfied.

---- hover::tests::hovering_a_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_key_explains_the_field' (948092) panicked at crates/casm-lsp/src/hover.rs:471:9:
**source** — _required_

The originating node, by name or by id.

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback
    schema::tests::lookup_finds_a_term_by_exact_label
    schema::tests::markdown_rendering_includes_label_detail_and_documentation

test result: FAILED. 205 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
