*** crates/casm-lsp/src/schema.rs:50:5: replace find -> Option<&'a Term> with None

*** mutation diff:
--- crates/casm-lsp/src/schema.rs
+++ replace find -> Option<&'a Term> with None
@@ -42,17 +42,17 @@
             self.label, self.detail, self.documentation
         )
     }
 }
 
 /// Looks up a term by its label in `terms`.
 #[must_use]
 pub fn find<'a>(terms: &'a [Term], label: &str) -> Option<&'a Term> {
-    terms.iter().find(|term| term.label == label)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Keys valid at the top level of a document.
 pub const ROOT_KEYS: &[Term] = &[
     Term {
         label: "name",
         detail: "required",
         documentation: "The architecture's name. ASCII alphanumerics, `-`, `_`, and `.`, \

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (949115) panicked at crates/casm-lsp/src/hover.rs:591:14:
the key is under the cursor

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (949147) panicked at crates/casm-lsp/src/hover.rs:444:9:
`security` is not a recognised control type.

---- hover::tests::hovering_a_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_key_explains_the_field' (949148) panicked at crates/casm-lsp/src/hover.rs:469:14:
the key is under the cursor

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    schema::tests::lookup_finds_a_term_by_exact_label
    schema::tests::markdown_rendering_includes_label_detail_and_documentation

test result: FAILED. 206 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
