*** crates/casm-lsp/src/server.rs:119:9: replace Backend::with_document -> Option<T> with None

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace Backend::with_document -> Option<T> with None
@@ -111,19 +111,17 @@
     /// The pattern library is handed over alongside it: completion, hover, and quick-fixes
     /// all answer differently depending on what the library holds, and it is the store —
     /// not the document — that owns it.
     fn with_document<T>(
         &self,
         uri: &Uri,
         operation: impl FnOnce(&crate::documents::Document, &[Pattern]) -> T,
     ) -> Option<T> {
-        let mut store = self.store.lock().ok()?;
-        let (document, patterns) = store.get_with_patterns(uri.as_str())?;
-        Some(operation(document, patterns))
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Runs `operation`, converting a panic into an error response instead of a dead session.
 fn guarded<T>(operation_name: &'static str, operation: impl FnOnce() -> T) -> RpcResult<T> {
     std::panic::catch_unwind(AssertUnwindSafe(operation)).map_err(|_| {
         let mut error = RpcError::internal_error();
         error.message = format!(

---- hover_returns_markdown_over_the_wire stdout ----

thread 'hover_returns_markdown_over_the_wire' (951005) panicked at crates/casm-lsp/tests/protocol.rs:295:5:

failures:
    hover_returns_markdown_over_the_wire

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.36s

*** result: Failure(101)
