*** crates/casm-lsp/src/server.rs:172:17: delete field text_document_sync from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field text_document_sync from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize
@@ -164,19 +164,17 @@
             // `None` selects the protocol default, UTF-16, which is exactly what
             // `crate::text` computes. Declaring anything else here without changing that
             // module would shift every span on a line containing a non-ASCII character.
             offset_encoding: None,
             capabilities: ServerCapabilities {
                 // Full sync: architecture documents are small, and re-analysing the whole
                 // text is microseconds. Incremental sync would add a rope and a class of
                 // desynchronisation bug for no measurable gain.
-                text_document_sync: Some(TextDocumentSyncCapability::Kind(
-                    TextDocumentSyncKind::FULL,
-                )),
+                 /* ~ changed by cargo-mutants ~ */
                 completion_provider: Some(CompletionOptions {
                     // `:` and space fire after a key; `-` fires on a new sequence entry.
                     trigger_characters: Some(vec![":".to_owned(), " ".to_owned(), "-".to_owned()]),
                     ..CompletionOptions::default()
                 }),
                 hover_provider: Some(HoverProviderCapability::Simple(true)),
                 definition_provider: Some(OneOf::Left(true)),
                 references_provider: Some(OneOf::Left(true)),

*** result: Success
