*** crates/casm-lsp/src/server.rs:175:17: delete field completion_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field completion_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize
@@ -167,21 +167,17 @@
             offset_encoding: None,
             capabilities: ServerCapabilities {
                 // Full sync: architecture documents are small, and re-analysing the whole
                 // text is microseconds. Incremental sync would add a rope and a class of
                 // desynchronisation bug for no measurable gain.
                 text_document_sync: Some(TextDocumentSyncCapability::Kind(
                     TextDocumentSyncKind::FULL,
                 )),
-                completion_provider: Some(CompletionOptions {
-                    // `:` and space fire after a key; `-` fires on a new sequence entry.
-                    trigger_characters: Some(vec![":".to_owned(), " ".to_owned(), "-".to_owned()]),
-                    ..CompletionOptions::default()
-                }),
+                 /* ~ changed by cargo-mutants ~ */
                 hover_provider: Some(HoverProviderCapability::Simple(true)),
                 definition_provider: Some(OneOf::Left(true)),
                 references_provider: Some(OneOf::Left(true)),
                 document_symbol_provider: Some(OneOf::Left(true)),
                 code_action_provider: Some(CodeActionProviderCapability::Simple(true)),
                 execute_command_provider: Some(ExecuteCommandOptions {
                     commands: vec![
                         GENERATE_DIAGRAM.to_owned(),

---- the_server_advertises_the_capabilities_it_implements stdout ----

thread 'the_server_advertises_the_capabilities_it_implements' (955565) panicked at crates/casm-lsp/tests/protocol.rs:161:9:
completionProvider was not advertised:

failures:
    the_server_advertises_the_capabilities_it_implements

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.30s

*** result: Failure(101)
