*** crates/casm-lsp/src/server.rs:177:21: delete field trigger_characters from struct CompletionOptions expression in <impl LanguageServer for Backend>::initialize

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field trigger_characters from struct CompletionOptions expression in <impl LanguageServer for Backend>::initialize
@@ -169,17 +169,17 @@
                 // Full sync: architecture documents are small, and re-analysing the whole
                 // text is microseconds. Incremental sync would add a rope and a class of
                 // desynchronisation bug for no measurable gain.
                 text_document_sync: Some(TextDocumentSyncCapability::Kind(
                     TextDocumentSyncKind::FULL,
                 )),
                 completion_provider: Some(CompletionOptions {
                     // `:` and space fire after a key; `-` fires on a new sequence entry.
-                    trigger_characters: Some(vec![":".to_owned(), " ".to_owned(), "-".to_owned()]),
+                     /* ~ changed by cargo-mutants ~ */
                     ..CompletionOptions::default()
                 }),
                 hover_provider: Some(HoverProviderCapability::Simple(true)),
                 definition_provider: Some(OneOf::Left(true)),
                 references_provider: Some(OneOf::Left(true)),
                 document_symbol_provider: Some(OneOf::Left(true)),
                 code_action_provider: Some(CodeActionProviderCapability::Simple(true)),
                 execute_command_provider: Some(ExecuteCommandOptions {

*** result: Success
