*** crates/casm-lsp/src/server.rs:181:17: delete field definition_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field definition_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize
@@ -173,17 +173,17 @@
                     TextDocumentSyncKind::FULL,
                 )),
                 completion_provider: Some(CompletionOptions {
                     // `:` and space fire after a key; `-` fires on a new sequence entry.
                     trigger_characters: Some(vec![":".to_owned(), " ".to_owned(), "-".to_owned()]),
                     ..CompletionOptions::default()
                 }),
                 hover_provider: Some(HoverProviderCapability::Simple(true)),
-                definition_provider: Some(OneOf::Left(true)),
+                 /* ~ changed by cargo-mutants ~ */
                 references_provider: Some(OneOf::Left(true)),
                 document_symbol_provider: Some(OneOf::Left(true)),
                 code_action_provider: Some(CodeActionProviderCapability::Simple(true)),
                 execute_command_provider: Some(ExecuteCommandOptions {
                     commands: vec![
                         GENERATE_DIAGRAM.to_owned(),
                         VALIDATE_WORKSPACE.to_owned(),
                         RELOAD_PATTERNS.to_owned(),

---- the_server_advertises_the_capabilities_it_implements stdout ----

thread 'the_server_advertises_the_capabilities_it_implements' (955844) panicked at crates/casm-lsp/tests/protocol.rs:161:9:
definitionProvider was not advertised:

failures:
    the_server_advertises_the_capabilities_it_implements

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
