*** crates/casm-lsp/src/server.rs:183:17: delete field document_symbol_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field document_symbol_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize
@@ -175,17 +175,17 @@
                 completion_provider: Some(CompletionOptions {
                     // `:` and space fire after a key; `-` fires on a new sequence entry.
                     trigger_characters: Some(vec![":".to_owned(), " ".to_owned(), "-".to_owned()]),
                     ..CompletionOptions::default()
                 }),
                 hover_provider: Some(HoverProviderCapability::Simple(true)),
                 definition_provider: Some(OneOf::Left(true)),
                 references_provider: Some(OneOf::Left(true)),
-                document_symbol_provider: Some(OneOf::Left(true)),
+                 /* ~ changed by cargo-mutants ~ */
                 code_action_provider: Some(CodeActionProviderCapability::Simple(true)),
                 execute_command_provider: Some(ExecuteCommandOptions {
                     commands: vec![
                         GENERATE_DIAGRAM.to_owned(),
                         VALIDATE_WORKSPACE.to_owned(),
                         RELOAD_PATTERNS.to_owned(),
                     ],
                     ..ExecuteCommandOptions::default()

---- the_server_advertises_the_capabilities_it_implements stdout ----

thread 'the_server_advertises_the_capabilities_it_implements' (960650) panicked at crates/casm-lsp/tests/protocol.rs:161:9:
documentSymbolProvider was not advertised:

failures:
    the_server_advertises_the_capabilities_it_implements

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
