*** crates/casm-lsp/src/server.rs:185:17: delete field execute_command_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field execute_command_provider from struct ServerCapabilities expression in <impl LanguageServer for Backend>::initialize
@@ -177,24 +177,17 @@
                     trigger_characters: Some(vec![":".to_owned(), " ".to_owned(), "-".to_owned()]),
                     ..CompletionOptions::default()
                 }),
                 hover_provider: Some(HoverProviderCapability::Simple(true)),
                 definition_provider: Some(OneOf::Left(true)),
                 references_provider: Some(OneOf::Left(true)),
                 document_symbol_provider: Some(OneOf::Left(true)),
                 code_action_provider: Some(CodeActionProviderCapability::Simple(true)),
-                execute_command_provider: Some(ExecuteCommandOptions {
-                    commands: vec![
-                        GENERATE_DIAGRAM.to_owned(),
-                        VALIDATE_WORKSPACE.to_owned(),
-                        RELOAD_PATTERNS.to_owned(),
-                    ],
-                    ..ExecuteCommandOptions::default()
-                }),
+                 /* ~ changed by cargo-mutants ~ */
                 ..ServerCapabilities::default()
             },
         })
     }
 
     async fn initialized(&self, _: InitializedParams) {
         self.client
             .log_message(MessageType::INFO, "casm-lsp ready — architecture as code")

---- the_server_advertises_the_capabilities_it_implements stdout ----

thread 'the_server_advertises_the_capabilities_it_implements' (961081) panicked at crates/casm-lsp/tests/protocol.rs:161:9:
executeCommandProvider was not advertised:

---- the_registered_commands_are_advertised stdout ----

thread 'the_registered_commands_are_advertised' (961078) panicked at crates/casm-lsp/tests/protocol.rs:178:5:

failures:
    the_registered_commands_are_advertised
    the_server_advertises_the_capabilities_it_implements

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.30s

*** result: Failure(101)
