*** crates/casm-lsp/src/server.rs:199:9: replace <impl LanguageServer for Backend>::initialized with ()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace <impl LanguageServer for Backend>::initialized with ()
@@ -191,22 +191,17 @@
                     ..ExecuteCommandOptions::default()
                 }),
                 ..ServerCapabilities::default()
             },
         })
     }
 
     async fn initialized(&self, _: InitializedParams) {
-        self.client
-            .log_message(MessageType::INFO, "casm-lsp ready — architecture as code")
-            .await;
-
-        let note = self.reload_patterns().await;
-        self.client.log_message(MessageType::INFO, note).await;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     async fn shutdown(&self) -> RpcResult<()> {
         Ok(())
     }
 
     async fn did_open(&self, params: DidOpenTextDocumentParams) {
         let document = params.text_document;

---- a_workspace_library_is_discovered_and_the_claim_is_checked stdout ----

thread 'a_workspace_library_is_discovered_and_the_claim_is_checked' (965842) panicked at crates/casm-lsp/tests/protocol.rs:508:5:
the library was not reported as loaded:

---- without_a_library_the_claim_is_reported_as_unchecked stdout ----

thread 'without_a_library_the_claim_is_reported_as_unchecked' (966278) panicked at crates/casm-lsp/tests/protocol.rs:530:5:
the server did not say where it looked:

failures:
    a_workspace_library_is_discovered_and_the_claim_is_checked
    without_a_library_the_claim_is_reported_as_unchecked

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.40s

*** result: Failure(101)
