*** crates/casm-lsp/src/server.rs:212:9: replace <impl LanguageServer for Backend>::did_open with ()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace <impl LanguageServer for Backend>::did_open with ()
@@ -204,19 +204,17 @@
         self.client.log_message(MessageType::INFO, note).await;
     }
 
     async fn shutdown(&self) -> RpcResult<()> {
         Ok(())
     }
 
     async fn did_open(&self, params: DidOpenTextDocumentParams) {
-        let document = params.text_document;
-        self.refresh(&document.uri, document.text, document.version)
-            .await;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     async fn did_change(&self, params: DidChangeTextDocumentParams) {
         // Full sync, so the last change carries the entire document.
         let Some(change) = params.content_changes.into_iter().next_back() else {
             return;
         };
         self.refresh(

---- opening_a_broken_document_publishes_a_syntax_diagnostic stdout ----

thread 'opening_a_broken_document_publishes_a_syntax_diagnostic' (968664) panicked at crates/casm-lsp/tests/protocol.rs:204:5:

---- completion_returns_node_types_over_the_wire stdout ----

thread 'completion_returns_node_types_over_the_wire' (968661) panicked at crates/casm-lsp/tests/protocol.rs:276:5:

---- go_to_definition_resolves_an_endpoint_over_the_wire stdout ----

thread 'go_to_definition_resolves_an_endpoint_over_the_wire' (968662) panicked at crates/casm-lsp/tests/protocol.rs:326:5:
must jump to the declaration:

failures:
    completion_returns_node_types_over_the_wire
    go_to_definition_resolves_an_endpoint_over_the_wire
    hover_returns_markdown_over_the_wire
    opening_a_broken_document_publishes_a_syntax_diagnostic
    opening_a_clean_document_publishes_an_empty_diagnostic_list
    opening_a_document_publishes_diagnostics
    reloading_republishes_documents_the_client_never_touched
    the_diagram_command_renders_the_open_document
    the_server_survives_a_document_of_pathological_content
    without_a_library_the_claim_is_reported_as_unchecked

test result: FAILED. 7 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.29s

*** result: Failure(101)
