*** crates/casm-lsp/src/server.rs:219:9: replace <impl LanguageServer for Backend>::did_change with ()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace <impl LanguageServer for Backend>::did_change with ()
@@ -211,25 +211,17 @@
     async fn did_open(&self, params: DidOpenTextDocumentParams) {
         let document = params.text_document;
         self.refresh(&document.uri, document.text, document.version)
             .await;
     }
 
     async fn did_change(&self, params: DidChangeTextDocumentParams) {
         // Full sync, so the last change carries the entire document.
-        let Some(change) = params.content_changes.into_iter().next_back() else {
-            return;
-        };
-        self.refresh(
-            &params.text_document.uri,
-            change.text,
-            params.text_document.version,
-        )
-        .await;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     async fn did_change_watched_files(&self, params: DidChangeWatchedFilesParams) {
         let directory = self
             .workspace
             .lock()
             .ok()
             .and_then(|workspace| workspace.directory.clone());

*** result: Success
