*** crates/casm-lsp/src/server.rs:249:9: replace <impl LanguageServer for Backend>::did_close with ()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace <impl LanguageServer for Backend>::did_close with ()
@@ -241,23 +241,17 @@
             return;
         }
 
         let note = self.reload_patterns().await;
         self.client.log_message(MessageType::INFO, note).await;
     }
 
     async fn did_close(&self, params: DidCloseTextDocumentParams) {
-        if let Ok(mut store) = self.store.lock() {
-            store.close(params.text_document.uri.as_str());
-        }
-        // Clear the squiggles: a closed document has no findings to show.
-        self.client
-            .publish_diagnostics(params.text_document.uri, Vec::new(), None)
-            .await;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     async fn completion(&self, params: CompletionParams) -> RpcResult<Option<CompletionResponse>> {
         let location = params.text_document_position;
         let position = convert_position(location.position);
 
         guarded("completion", || {
             self.with_document(&location.text_document.uri, |document, patterns| {

---- closing_a_document_clears_its_diagnostics stdout ----

thread 'closing_a_document_clears_its_diagnostics' (972017) panicked at crates/casm-lsp/tests/protocol.rs:395:5:
closing must publish an empty list:

failures:
    closing_a_document_clears_its_diagnostics

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
