*** crates/casm-lsp/src/server.rs:439:9: replace Backend::reload_patterns -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace Backend::reload_patterns -> String with "xyzzy".into()
@@ -431,62 +431,17 @@
     ///
     /// Returns the note describing what happened, for the caller to log or hand back as a
     /// command result.
     ///
     /// Republishing is the point. Reloading a library that no document is re-analysed
     /// against would change what the *next* keystroke reports and leave every open file
     /// showing findings computed against the previous one.
     async fn reload_patterns(&self) -> String {
-        let (roots, configured) = {
-            let Ok(workspace) = self.workspace.lock() else {
-                return "casm-lsp: could not read the workspace configuration".to_owned();
-            };
-            (workspace.roots.clone(), workspace.configured.clone())
-        };
-
-        // Deliberately outside every lock: this reads the filesystem, and the store must
-        // stay available to requests arriving while it does.
-        let found = library::discover(&roots, configured.as_deref());
-
-        let refreshed = {
-            let Ok(mut store) = self.store.lock() else {
-                return "casm-lsp: could not reach the document store to reload patterns"
-                    .to_owned();
-            };
-            store.load_patterns(found.patterns.clone());
-            store
-                .uris()
-                .into_iter()
-                .filter_map(|uri| {
-                    let document = store.peek(&uri)?;
-                    let published: Vec<Diagnostic> = document
-                        .diagnostics()
-                        .iter()
-                        .map(convert_diagnostic)
-                        .collect();
-                    Some((uri, published, document.version))
-                })
-                .collect::<Vec<_>>()
-        };
-
-        if let Ok(mut workspace) = self.workspace.lock() {
-            workspace.directory = found.directory;
-        }
-
-        for (uri, diagnostics, version) in refreshed {
-            let Ok(parsed) = uri.parse::<Uri>() else {
-                continue;
-            };
-            self.client
-                .publish_diagnostics(parsed, diagnostics, Some(version))
-                .await;
-        }
-
-        format!("casm-lsp: {}", found.note)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Summarises the findings across every open document.
     ///
     /// Deliberately synchronous: it holds the store's `Mutex`, and holding a blocking
     /// lock across an `.await` is how an async runtime deadlocks itself.
     fn validate_workspace(&self) -> String {
         let Ok(store) = self.store.lock() else {

---- a_workspace_library_is_discovered_and_the_claim_is_checked stdout ----

thread 'a_workspace_library_is_discovered_and_the_claim_is_checked' (976616) panicked at crates/casm-lsp/tests/protocol.rs:508:5:
the library was not reported as loaded:

---- reloading_republishes_documents_the_client_never_touched stdout ----

thread 'reloading_republishes_documents_the_client_never_touched' (976862) panicked at crates/casm-lsp/tests/protocol.rs:607:5:
the reload was not reported:
{"jsonrpc":"2.0","result":"xyzzy","id":2}{"jsonrpc":"2.0","result":null,"id":9000}

---- without_a_library_the_claim_is_reported_as_unchecked stdout ----

thread 'without_a_library_the_claim_is_reported_as_unchecked' (977142) panicked at crates/casm-lsp/tests/protocol.rs:530:5:
the server did not say where it looked:

failures:
    a_workspace_library_is_discovered_and_the_claim_is_checked
    reloading_republishes_documents_the_client_never_touched
    without_a_library_the_claim_is_reported_as_unchecked

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
