*** crates/casm-lsp/src/server.rs:524:5: replace workspace_roots -> Vec<PathBuf> with vec![]

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace workspace_roots -> Vec<PathBuf> with vec![]
@@ -516,32 +516,17 @@
 }
 
 /// The workspace folders the client reported, most significant first.
 ///
 /// `workspaceFolders` is the modern field and `rootUri` the deprecated one. Both are read:
 /// the fallback costs three lines and is the difference between working and not working in
 /// an older client.
 fn workspace_roots(params: &InitializeParams) -> Vec<PathBuf> {
-    if let Some(folders) = params.workspace_folders.as_ref()
-        && !folders.is_empty()
-    {
-        return folders
-            .iter()
-            .map(|folder| uri_to_path(folder.uri.as_str()))
-            .collect();
-    }
-
-    // Deprecated in the protocol, still the only thing some clients send.
-    #[allow(deprecated)]
-    params
-        .root_uri
-        .as_ref()
-        .map(|uri| vec![uri_to_path(uri.as_str())])
-        .unwrap_or_default()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a protocol position into CASIMIR's.
 fn convert_position(position: Position) -> CasmPosition {
     CasmPosition::new(position.line, position.character)
 }
 
 /// Converts a CASIMIR span into a protocol range.

---- a_workspace_library_is_discovered_and_the_claim_is_checked stdout ----

thread 'a_workspace_library_is_discovered_and_the_claim_is_checked' (981182) panicked at crates/casm-lsp/tests/protocol.rs:508:5:
the library was not reported as loaded:

---- reloading_republishes_documents_the_client_never_touched stdout ----

thread 'reloading_republishes_documents_the_client_never_touched' (981640) panicked at crates/casm-lsp/tests/protocol.rs:607:5:
the reload was not reported:

failures:
    a_workspace_library_is_discovered_and_the_claim_is_checked
    reloading_republishes_documents_the_client_never_touched

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
