*** crates/casm-lsp/src/server.rs:525:12: delete ! in workspace_roots

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete ! in workspace_roots
@@ -517,17 +517,17 @@
 
 /// The workspace folders the client reported, most significant first.
 ///
 /// `workspaceFolders` is the modern field and `rootUri` the deprecated one. Both are read:
 /// the fallback costs three lines and is the difference between working and not working in
 /// an older client.
 fn workspace_roots(params: &InitializeParams) -> Vec<PathBuf> {
     if let Some(folders) = params.workspace_folders.as_ref()
-        && !folders.is_empty()
+        &&  /* ~ changed by cargo-mutants ~ */folders.is_empty()
     {
         return folders
             .iter()
             .map(|folder| uri_to_path(folder.uri.as_str()))
             .collect();
     }
 
     // Deprecated in the protocol, still the only thing some clients send.

---- a_workspace_library_is_discovered_and_the_claim_is_checked stdout ----

thread 'a_workspace_library_is_discovered_and_the_claim_is_checked' (981965) panicked at crates/casm-lsp/tests/protocol.rs:508:5:
the library was not reported as loaded:

---- reloading_republishes_documents_the_client_never_touched stdout ----

thread 'reloading_republishes_documents_the_client_never_touched' (982472) panicked at crates/casm-lsp/tests/protocol.rs:607:5:
the reload was not reported:

failures:
    a_workspace_library_is_discovered_and_the_claim_is_checked
    reloading_republishes_documents_the_client_never_touched

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.29s

*** result: Failure(101)
