*** crates/casm-lsp/src/server.rs:544:5: replace convert_position -> CasmPosition with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace convert_position -> CasmPosition with Default::default()
@@ -536,17 +536,17 @@
         .root_uri
         .as_ref()
         .map(|uri| vec![uri_to_path(uri.as_str())])
         .unwrap_or_default()
 }
 
 /// Converts a protocol position into CASIMIR's.
 fn convert_position(position: Position) -> CasmPosition {
-    CasmPosition::new(position.line, position.character)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a CASIMIR span into a protocol range.
 fn convert_span(span: Span) -> Range {
     Range {
         start: Position {
             line: span.line,
             character: span.start,

---- server::tests::positions_convert_in_both_directions_without_shifting stdout ----

thread 'server::tests::positions_convert_in_both_directions_without_shifting' (982437) panicked at crates/casm-lsp/src/server.rs:687:9:
assertion `left == right` failed
  left: Position { line: 0, character: 0 }
 right: Position { line: 4, character: 11 }

failures:
    server::tests::positions_convert_in_both_directions_without_shifting

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
