*** crates/casm-lsp/src/server.rs:549:5: replace convert_span -> Range with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace convert_span -> Range with Default::default()
@@ -541,26 +541,17 @@
 
 /// Converts a protocol position into CASIMIR's.
 fn convert_position(position: Position) -> CasmPosition {
     CasmPosition::new(position.line, position.character)
 }
 
 /// Converts a CASIMIR span into a protocol range.
 fn convert_span(span: Span) -> Range {
-    Range {
-        start: Position {
-            line: span.line,
-            character: span.start,
-        },
-        end: Position {
-            line: span.line,
-            character: span.end,
-        },
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns `true` if `span` intersects `range`, by line.
 ///
 /// Line granularity is deliberate: an editor asks for actions at the cursor, and a fix
 /// for the node on that line is what the author expects to be offered.
 fn overlaps(span: Span, range: Range) -> bool {
     span.line >= range.start.line && span.line <= range.end.line

---- server::tests::positions_convert_in_both_directions_without_shifting stdout ----

thread 'server::tests::positions_convert_in_both_directions_without_shifting' (983641) panicked at crates/casm-lsp/src/server.rs:681:9:
assertion `left == right` failed
  left: Position { line: 0, character: 0 }
 right: Position { line: 4, character: 11 }

failures:
    server::tests::positions_convert_in_both_directions_without_shifting

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
