*** crates/casm-lsp/src/server.rs:566:5: replace overlaps -> bool with false

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace overlaps -> bool with false
@@ -558,17 +558,17 @@
     }
 }
 
 /// Returns `true` if `span` intersects `range`, by line.
 ///
 /// Line granularity is deliberate: an editor asks for actions at the cursor, and a fix
 /// for the node on that line is what the author expects to be offered.
 fn overlaps(span: Span, range: Range) -> bool {
-    span.line >= range.start.line && span.line <= range.end.line
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a CASIMIR diagnostic into a protocol one.
 fn convert_diagnostic(diagnostic: &crate::diagnostics::Diagnostic) -> Diagnostic {
     Diagnostic {
         range: convert_span(diagnostic.span),
         severity: Some(match diagnostic.severity {
             Severity::Error => DiagnosticSeverity::ERROR,

---- server::tests::overlap_is_tested_by_line stdout ----

thread 'server::tests::overlap_is_tested_by_line' (990000) panicked at crates/casm-lsp/src/server.rs:721:9:
the first line

failures:
    server::tests::overlap_is_tested_by_line

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
