*** crates/casm-lsp/src/server.rs:619:5: replace convert_completion -> CompletionItem with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace convert_completion -> CompletionItem with Default::default()
@@ -611,31 +611,17 @@
         },
         selection_range: convert_span(entry.selection_span),
         children: None,
     }
 }
 
 /// Converts a CASIMIR completion into a protocol item.
 fn convert_completion(item: &completion::Completion) -> CompletionItem {
-    CompletionItem {
-        label: item.label.clone(),
-        kind: Some(match item.kind {
-            ItemKind::Field => CompletionItemKind::FIELD,
-            ItemKind::Value => CompletionItemKind::ENUM_MEMBER,
-            ItemKind::Reference => CompletionItemKind::REFERENCE,
-        }),
-        detail: Some(item.detail.clone()),
-        documentation: Some(Documentation::MarkupContent(MarkupContent {
-            kind: MarkupKind::Markdown,
-            value: item.documentation.clone(),
-        })),
-        insert_text: Some(item.insert_text.clone()),
-        ..CompletionItem::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a CASIMIR code action into a protocol one.
 fn convert_action(uri: &Uri, action: actions::CodeAction) -> CodeActionOrCommand {
     let edit = (!action.edits.is_empty()).then(|| {
         let edits: Vec<TextEdit> = action
             .edits
             .iter()

---- server::tests::a_completion_carries_markdown_documentation_and_its_insert_text stdout ----

thread 'server::tests::a_completion_carries_markdown_documentation_and_its_insert_text' (993064) panicked at crates/casm-lsp/src/server.rs:790:9:
assertion `left == right` failed
  left: None
 right: Some("service")

---- server::tests::completion_kinds_map_onto_the_protocol stdout ----

thread 'server::tests::completion_kinds_map_onto_the_protocol' (993067) panicked at crates/casm-lsp/src/server.rs:766:9:
assertion `left == right` failed
  left: None
 right: Some(Field)

failures:
    server::tests::a_completion_carries_markdown_documentation_and_its_insert_text
    server::tests::completion_kinds_map_onto_the_protocol

test result: FAILED. 213 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
