*** crates/casm-lsp/src/server.rs:621:9: delete field kind from struct CompletionItem expression in convert_completion

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field kind from struct CompletionItem expression in convert_completion
@@ -613,21 +613,17 @@
         children: None,
     }
 }
 
 /// Converts a CASIMIR completion into a protocol item.
 fn convert_completion(item: &completion::Completion) -> CompletionItem {
     CompletionItem {
         label: item.label.clone(),
-        kind: Some(match item.kind {
-            ItemKind::Field => CompletionItemKind::FIELD,
-            ItemKind::Value => CompletionItemKind::ENUM_MEMBER,
-            ItemKind::Reference => CompletionItemKind::REFERENCE,
-        }),
+         /* ~ changed by cargo-mutants ~ */
         detail: Some(item.detail.clone()),
         documentation: Some(Documentation::MarkupContent(MarkupContent {
             kind: MarkupKind::Markdown,
             value: item.documentation.clone(),
         })),
         insert_text: Some(item.insert_text.clone()),
         ..CompletionItem::default()
     }

---- server::tests::completion_kinds_map_onto_the_protocol stdout ----

thread 'server::tests::completion_kinds_map_onto_the_protocol' (995696) panicked at crates/casm-lsp/src/server.rs:776:9:
assertion `left == right` failed
  left: None
 right: Some(Field)

failures:
    server::tests::completion_kinds_map_onto_the_protocol

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
