*** crates/casm-lsp/src/server.rs:626:9: delete field detail from struct CompletionItem expression in convert_completion

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field detail from struct CompletionItem expression in convert_completion
@@ -618,17 +618,17 @@
 fn convert_completion(item: &completion::Completion) -> CompletionItem {
     CompletionItem {
         label: item.label.clone(),
         kind: Some(match item.kind {
             ItemKind::Field => CompletionItemKind::FIELD,
             ItemKind::Value => CompletionItemKind::ENUM_MEMBER,
             ItemKind::Reference => CompletionItemKind::REFERENCE,
         }),
-        detail: Some(item.detail.clone()),
+         /* ~ changed by cargo-mutants ~ */
         documentation: Some(Documentation::MarkupContent(MarkupContent {
             kind: MarkupKind::Markdown,
             value: item.documentation.clone(),
         })),
         insert_text: Some(item.insert_text.clone()),
         ..CompletionItem::default()
     }
 }

*** result: Success
