*** crates/casm-lsp/src/server.rs:627:9: delete field documentation from struct CompletionItem expression in convert_completion

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field documentation from struct CompletionItem expression in convert_completion
@@ -619,20 +619,17 @@
     CompletionItem {
         label: item.label.clone(),
         kind: Some(match item.kind {
             ItemKind::Field => CompletionItemKind::FIELD,
             ItemKind::Value => CompletionItemKind::ENUM_MEMBER,
             ItemKind::Reference => CompletionItemKind::REFERENCE,
         }),
         detail: Some(item.detail.clone()),
-        documentation: Some(Documentation::MarkupContent(MarkupContent {
-            kind: MarkupKind::Markdown,
-            value: item.documentation.clone(),
-        })),
+         /* ~ changed by cargo-mutants ~ */
         insert_text: Some(item.insert_text.clone()),
         ..CompletionItem::default()
     }
 }
 
 /// Converts a CASIMIR code action into a protocol one.
 fn convert_action(uri: &Uri, action: actions::CodeAction) -> CodeActionOrCommand {
     let edit = (!action.edits.is_empty()).then(|| {

---- server::tests::a_completion_carries_markdown_documentation_and_its_insert_text stdout ----

thread 'server::tests::a_completion_carries_markdown_documentation_and_its_insert_text' (996804) panicked at crates/casm-lsp/src/server.rs:802:9:
assertion failed: matches!(item.documentation,
    Some(Documentation::MarkupContent(MarkupContent
    { kind: MarkupKind::Markdown, .. })))

failures:
    server::tests::a_completion_carries_markdown_documentation_and_its_insert_text

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
