*** crates/casm-lsp/src/server.rs:631:9: delete field insert_text from struct CompletionItem expression in convert_completion

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field insert_text from struct CompletionItem expression in convert_completion
@@ -623,17 +623,17 @@
             ItemKind::Value => CompletionItemKind::ENUM_MEMBER,
             ItemKind::Reference => CompletionItemKind::REFERENCE,
         }),
         detail: Some(item.detail.clone()),
         documentation: Some(Documentation::MarkupContent(MarkupContent {
             kind: MarkupKind::Markdown,
             value: item.documentation.clone(),
         })),
-        insert_text: Some(item.insert_text.clone()),
+         /* ~ changed by cargo-mutants ~ */
         ..CompletionItem::default()
     }
 }
 
 /// Converts a CASIMIR code action into a protocol one.
 fn convert_action(uri: &Uri, action: actions::CodeAction) -> CodeActionOrCommand {
     let edit = (!action.edits.is_empty()).then(|| {
         let edits: Vec<TextEdit> = action

---- server::tests::a_completion_carries_markdown_documentation_and_its_insert_text stdout ----

thread 'server::tests::a_completion_carries_markdown_documentation_and_its_insert_text' (997622) panicked at crates/casm-lsp/src/server.rs:804:9:
assertion `left == right` failed
  left: None
 right: Some("service")

failures:
    server::tests::a_completion_carries_markdown_documentation_and_its_insert_text

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
