*** crates/casm-lsp/src/server.rs:649:13: delete field changes from struct WorkspaceEdit expression in convert_action

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field changes from struct WorkspaceEdit expression in convert_action
@@ -641,17 +641,17 @@
             .iter()
             .map(|edit| TextEdit {
                 range: convert_span(edit.span),
                 new_text: edit.new_text.clone(),
             })
             .collect();
 
         WorkspaceEdit {
-            changes: Some([(uri.clone(), edits)].into_iter().collect()),
+             /* ~ changed by cargo-mutants ~ */
             ..WorkspaceEdit::default()
         }
     });
 
     CodeActionOrCommand::CodeAction(CodeAction {
         title: action.title.clone(),
         kind: Some(match action.kind {
             ActionKind::QuickFix => CodeActionKind::QUICKFIX,

*** result: Success
