*** crates/casm-lsp/src/server.rs:655:9: delete field title from struct CodeAction expression in convert_action

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field title from struct CodeAction expression in convert_action
@@ -647,17 +647,17 @@
 
         WorkspaceEdit {
             changes: Some([(uri.clone(), edits)].into_iter().collect()),
             ..WorkspaceEdit::default()
         }
     });
 
     CodeActionOrCommand::CodeAction(CodeAction {
-        title: action.title.clone(),
+         /* ~ changed by cargo-mutants ~ */
         kind: Some(match action.kind {
             ActionKind::QuickFix => CodeActionKind::QUICKFIX,
             ActionKind::Source => CodeActionKind::SOURCE,
         }),
         edit,
         command: action.command.map(|command| Command {
             title: command.title,
             command: command.id,

*** result: Success
