*** crates/casm-lsp/src/server.rs:660:9: delete field edit from struct CodeAction expression in convert_action

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field edit from struct CodeAction expression in convert_action
@@ -652,17 +652,17 @@
     });
 
     CodeActionOrCommand::CodeAction(CodeAction {
         title: action.title.clone(),
         kind: Some(match action.kind {
             ActionKind::QuickFix => CodeActionKind::QUICKFIX,
             ActionKind::Source => CodeActionKind::SOURCE,
         }),
-        edit,
+         /* ~ changed by cargo-mutants ~ */
         command: action.command.map(|command| Command {
             title: command.title,
             command: command.id,
             arguments: Some(vec![serde_json::Value::String(uri.as_str().to_owned())]),
         }),
         ..CodeAction::default()
     })
 }

*** result: Success
