*** crates/casm-lsp/src/server.rs:661:9: delete field command from struct CodeAction expression in convert_action

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ delete field command from struct CodeAction expression in convert_action
@@ -653,21 +653,17 @@
 
     CodeActionOrCommand::CodeAction(CodeAction {
         title: action.title.clone(),
         kind: Some(match action.kind {
             ActionKind::QuickFix => CodeActionKind::QUICKFIX,
             ActionKind::Source => CodeActionKind::SOURCE,
         }),
         edit,
-        command: action.command.map(|command| Command {
-            title: command.title,
-            command: command.id,
-            arguments: Some(vec![serde_json::Value::String(uri.as_str().to_owned())]),
-        }),
+         /* ~ changed by cargo-mutants ~ */
         ..CodeAction::default()
     })
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,

*** result: Success
