*** crates/casm-lsp/src/server.rs:90:9: replace Backend::refresh with ()

*** mutation diff:
--- crates/casm-lsp/src/server.rs
+++ replace Backend::refresh with ()
@@ -82,33 +82,17 @@
                 ValidatorConfig::default(),
             )),
             workspace: Mutex::new(Workspace::default()),
         }
     }
 
     /// Analyses a document and pushes its diagnostics to the client.
     async fn refresh(&self, uri: &Uri, text: String, version: i32) {
-        let published = {
-            let Ok(mut store) = self.store.lock() else {
-                // A poisoned lock means a previous panic was contained. Reporting it is
-                // more useful than silently serving stale analyses.
-                return;
-            };
-            let document = store.upsert(uri.as_str(), text, version);
-            document
-                .diagnostics()
-                .iter()
-                .map(convert_diagnostic)
-                .collect::<Vec<_>>()
-        };
-
-        self.client
-            .publish_diagnostics(uri.clone(), published, Some(version))
-            .await;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Runs `operation` against the stored document for `uri`, if it is open.
     ///
     /// The pattern library is handed over alongside it: completion, hover, and quick-fixes
     /// all answer differently depending on what the library holds, and it is the store —
     /// not the document — that owns it.
     fn with_document<T>(

---- go_to_definition_resolves_an_endpoint_over_the_wire stdout ----

thread 'go_to_definition_resolves_an_endpoint_over_the_wire' (950168) panicked at crates/casm-lsp/tests/protocol.rs:326:5:
must jump to the declaration:

---- completion_returns_node_types_over_the_wire stdout ----

thread 'completion_returns_node_types_over_the_wire' (950167) panicked at crates/casm-lsp/tests/protocol.rs:276:5:

---- hover_returns_markdown_over_the_wire stdout ----

thread 'hover_returns_markdown_over_the_wire' (950169) panicked at crates/casm-lsp/tests/protocol.rs:295:5:

failures:
    completion_returns_node_types_over_the_wire
    go_to_definition_resolves_an_endpoint_over_the_wire
    hover_returns_markdown_over_the_wire
    opening_a_broken_document_publishes_a_syntax_diagnostic
    opening_a_clean_document_publishes_an_empty_diagnostic_list
    opening_a_document_publishes_diagnostics
    reloading_republishes_documents_the_client_never_touched
    the_diagram_command_renders_the_open_document
    the_server_survives_a_document_of_pathological_content
    without_a_library_the_claim_is_reported_as_unchecked

test result: FAILED. 7 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.28s

*** result: Failure(101)
