*** crates/casm-lsp/src/text.rs:101:5: replace utf16_len -> u32 with 1

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace utf16_len -> u32 with 1
@@ -93,17 +93,17 @@
 /// Returns the length of `text` in UTF-16 code units.
 ///
 /// This is the unit LSP counts in. A character outside the Basic Multilingual Plane —
 /// an emoji, say — is two units, not one.
 #[must_use]
 pub fn utf16_len(text: &str) -> u32 {
     // A document long enough to overflow `u32` would exceed the parser's size ceiling
     // long before reaching here, but saturate rather than wrap regardless.
-    u32::try_from(text.chars().map(char::len_utf16).sum::<usize>()).unwrap_or(u32::MAX)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a byte offset within `line` into a UTF-16 code-unit offset.
 ///
 /// An offset past the end of the line, or one that falls inside a multi-byte character,
 /// yields the length of the whole line rather than panicking.
 #[must_use]
 pub fn byte_to_utf16(line: &str, byte_offset: usize) -> u32 {

---- actions::tests::adding_security_controls_produces_a_document_that_still_parses stdout ----

thread 'actions::tests::adding_security_controls_produces_a_document_that_still_parses' (1022989) panicked at crates/casm-lsp/src/actions.rs:361:9:
the fix produced invalid YAML:
name: x
nodes:
  - name: api
 
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (1022985) panicked at crates/casm-lsp/src/actions.rs:485:9:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: A
        description: first
      - type: security
        standard: B
        description: second

---- actions::tests::appended_controls_adopt_the_authors_indentation stdout ----

thread 'actions::tests::appended_controls_adopt_the_authors_indentation' (1022991) panicked at crates/casm-lsp/src/actions.rs:458:9:
name: x
nodes:
  - name: api
    type: service
    controls:
    - type: security
      standard: OIDC
 
    - type: security
      standard: TODO-AUTHENTICATION
      description: TODO describe how callers of this node are authenticated

failures:
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::a_node_type_value_offers_node_types
    completion::tests::a_pattern_reference_is_completed_from_the_library
    completion::tests::a_protocol_value_offers_protocols_in_both_places_it_appears
    completion::tests::a_relationship_type_value_offers_relationship_ty

test result: FAILED. 163 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
