*** crates/casm-lsp/src/text.rs:110:5: replace byte_to_utf16 -> u32 with 1

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace byte_to_utf16 -> u32 with 1
@@ -102,18 +102,17 @@
 }
 
 /// Converts a byte offset within `line` into a UTF-16 code-unit offset.
 ///
 /// An offset past the end of the line, or one that falls inside a multi-byte character,
 /// yields the length of the whole line rather than panicking.
 #[must_use]
 pub fn byte_to_utf16(line: &str, byte_offset: usize) -> u32 {
-    line.get(..byte_offset)
-        .map_or_else(|| utf16_len(line), utf16_len)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a UTF-16 code-unit offset within `line` into a byte offset.
 ///
 /// The inverse of [`byte_to_utf16`], needed whenever the protocol hands us a cursor
 /// position and we must slice the line at it. An offset past the end of the line clamps
 /// to the line's length, so slicing with the result is always valid.
 #[must_use]

---- diagnostics::tests::a_node_finding_is_anchored_on_the_node_name stdout ----

thread 'diagnostics::tests::a_node_finding_is_anchored_on_the_node_name' (1024188) panicked at crates/casm-lsp/src/diagnostics.rs:384:9:
assertion `left == right` failed: just the name
  left: 0
 right: 9

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (1024194) panicked at crates/casm-lsp/src/diagnostics.rs:367:9:
and it underlines something

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (1024276) panicked at crates/casm-lsp/src/hover.rs:591:14:
the key is under the cursor

failures:
    diagnostics::tests::a_node_finding_is_anchored_on_the_node_name
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type

test result: FAILED. 181 passed; 34 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
