*** crates/casm-lsp/src/text.rs:121:5: replace utf16_to_byte -> usize with 1

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace utf16_to_byte -> usize with 1
@@ -113,28 +113,17 @@
 
 /// Converts a UTF-16 code-unit offset within `line` into a byte offset.
 ///
 /// The inverse of [`byte_to_utf16`], needed whenever the protocol hands us a cursor
 /// position and we must slice the line at it. An offset past the end of the line clamps
 /// to the line's length, so slicing with the result is always valid.
 #[must_use]
 pub fn utf16_to_byte(line: &str, utf16_offset: u32) -> usize {
-    let mut consumed = 0_u32;
-
-    for (byte_offset, character) in line.char_indices() {
-        if consumed >= utf16_offset {
-            return byte_offset;
-        }
-        // A cursor cannot sit inside a surrogate pair, so landing mid-character means the
-        // client sent a position we cannot honour; take the character boundary before it.
-        consumed = consumed.saturating_add(u32::try_from(character.len_utf16()).unwrap_or(1));
-    }
-
-    line.len()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Builds a span covering `[start_byte, end_byte)` of `line`.
 #[must_use]
 pub fn span_of_bytes(line_number: u32, line: &str, start_byte: usize, end_byte: usize) -> Span {
     Span::new(
         line_number,
         byte_to_utf16(line, start_byte),

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (1027224) panicked at crates/casm-lsp/src/actions.rs:517:9:
name: x
nodes:
  - name: api
 
    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do   type: service

---- actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first stdout ----

thread 'actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first' (1027225) panicked at crates/casm-lsp/src/actions.rs:485:9:
name: x
nodes:
  - name: api
    type: service
    controls:
      - type: security
        standard: A
        description: first
      - type: security
        standard: B
        description: second

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (1027227) panicked at crates/casm-lsp/src/actions.rs:383:9:
name: x
nodes:
  - name: orders-db
 
    controls:
      - type: security
        standard: TODO-ENCRYPTION-AT-REST
        description: TODO describe how this data is encrypted at rest and where the keys live
      - type: operational
        standard: TODO-BACKUP
        description: TODO describe the backup schedule, retention, and when a restore was last tested   type: database

failures:
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::several_edits_apply_without_disturbing_each_others_offsets
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::a_node_field_position_offers_node_keys
    completion::tests::a_node_type_value_offers_node_types
    completion::tests::a_pattern_reference_is_completed_from_the_library

test result: FAILED. 190 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
