*** crates/casm-lsp/src/text.rs:124:21: replace >= with < in utf16_to_byte

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace >= with < in utf16_to_byte
@@ -116,17 +116,17 @@
 /// The inverse of [`byte_to_utf16`], needed whenever the protocol hands us a cursor
 /// position and we must slice the line at it. An offset past the end of the line clamps
 /// to the line's length, so slicing with the result is always valid.
 #[must_use]
 pub fn utf16_to_byte(line: &str, utf16_offset: u32) -> usize {
     let mut consumed = 0_u32;
 
     for (byte_offset, character) in line.char_indices() {
-        if consumed >= utf16_offset {
+        if consumed < /* ~ changed by cargo-mutants ~ */ utf16_offset {
             return byte_offset;
         }
         // A cursor cannot sit inside a surrogate pair, so landing mid-character means the
         // client sent a position we cannot honour; take the character boundary before it.
         consumed = consumed.saturating_add(u32::try_from(character.len_utf16()).unwrap_or(1));
     }
 
     line.len()

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (1027494) panicked at crates/casm-lsp/src/actions.rs:383:9:
name: x
nodes:
  - name: orders-db

    controls:
      - type: security
        standard: TODO-ENCRYPTION-AT-REST
        description: TODO describe how this data is encrypted at rest and where the keys live
      - type: operational
        standard: TODO-BACKUP
        description: TODO describe the backup schedule, retention, and when a restore was last tested    type: database

---- actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node stdout ----

thread 'actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node' (1027491) panicked at crates/casm-lsp/src/actions.rs:517:9:
name: x
nodes:
  - name: api

    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION
        description: TODO describe what a caller must be permitted to do    type: service

---- actions::tests::adding_security_controls_produces_a_document_that_still_parses stdout ----

thread 'actions::tests::adding_security_controls_produces_a_document_that_still_parses' (1027496) panicked at crates/casm-lsp/src/actions.rs:361:9:
the fix produced invalid YAML:
name: x
nodes:
  - name: api

    controls:
      - type: security
        standard: TODO-AUTHENTICATION
        description: TODO describe how callers of this node are authenticated
      - type: security
        standard: TODO-AUTHORISATION

failures:
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::several_edits_apply_without_disturbing_each_others_offsets
    completion::tests::a_binding_value_offers_the_nodes_this_document_declares
    completion::tests::a_control_type_value_offers_control_types
    completion::tests::a_node_field_position_offers_node_keys
    completion::tests::a_node_type_value_offers_node_types
    completion::tests::a_pattern_reference_is_completed_from_the_library

test result: FAILED. 190 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
