*** crates/casm-lsp/src/text.rs:138:5: replace span_of_bytes -> Span with Default::default()

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace span_of_bytes -> Span with Default::default()
@@ -130,21 +130,17 @@
     }
 
     line.len()
 }
 
 /// Builds a span covering `[start_byte, end_byte)` of `line`.
 #[must_use]
 pub fn span_of_bytes(line_number: u32, line: &str, start_byte: usize, end_byte: usize) -> Span {
-    Span::new(
-        line_number,
-        byte_to_utf16(line, start_byte),
-        byte_to_utf16(line, end_byte),
-    )
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- actions::tests::a_controls_header_is_added_when_the_node_has_none stdout ----

thread 'actions::tests::a_controls_header_is_added_when_the_node_has_none' (1027497) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'services-require-security-controls'

---- actions::tests::a_quick_fix_records_the_diagnostic_it_resolves stdout ----

thread 'actions::tests::a_quick_fix_records_the_diagnostic_it_resolves' (1027502) panicked at crates/casm-lsp/src/actions.rs:539:20:
index out of bounds: the len is 0 but the index is 0

---- actions::tests::adding_datastore_controls_clears_its_diagnostic stdout ----

thread 'actions::tests::adding_datastore_controls_clears_its_diagnostic' (1027503) panicked at crates/casm-lsp/src/actions.rs:339:9:
no quick-fix offered for 'stateful-nodes-require-controls'

failures:
    actions::tests::a_controls_header_is_added_when_the_node_has_none
    actions::tests::a_fix_on_a_node_followed_by_relationships_stays_inside_the_node
    actions::tests::a_fix_on_the_second_node_does_not_disturb_the_first
    actions::tests::a_quick_fix_records_the_diagnostic_it_resolves
    actions::tests::adding_datastore_controls_clears_its_diagnostic
    actions::tests::adding_security_controls_actually_clears_the_diagnostic
    actions::tests::adding_security_controls_produces_a_document_that_still_parses
    actions::tests::an_existing_controls_block_is_appended_to_rather_than_duplicated
    actions::tests::appended_controls_adopt_the_authors_indentation
    actions::tests::applying_an_edit_preserves_the_trailing_newline
    actions::tests::inserted_controls_are_marked_todo_rather_than_invented
    diagnostics::tests::a_conformance_finding_is_anchored_on_the_claim_not

test result: FAILED. 166 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
