*** crates/casm-lsp/src/text.rs:75:23: replace == with != in Span::contains

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace == with != in Span::contains
@@ -67,17 +67,17 @@
 
     /// Returns `true` if `position` falls within this span.
     ///
     /// The end is treated as inclusive. A cursor sitting immediately after a word is,
     /// to a user, still "on" that word — and hover that dies at the last character feels
     /// broken even though it is technically correct.
     #[must_use]
     pub const fn contains(&self, position: Position) -> bool {
-        position.line == self.line
+        position.line != /* ~ changed by cargo-mutants ~ */ self.line
             && position.character >= self.start
             && position.character <= self.end
     }
 
     /// The span's width in UTF-16 code units.
     #[must_use]
     pub const fn width(&self) -> u32 {
         self.end.saturating_sub(self.start)

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (1011062) panicked at crates/casm-lsp/src/hover.rs:558:9:
**edge-gateway** — _gateway_

_Showing partial information: the document does not currently parse._

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (1011059) panicked at crates/casm-lsp/src/hover.rs:591:14:
the key is under the cursor

---- hover::tests::hovering_a_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_key_explains_the_field' (1011065) panicked at crates/casm-lsp/src/hover.rs:469:14:
the key is under the cursor

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics

test result: FAILED. 189 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
