*** crates/casm-lsp/src/text.rs:75:9: replace Span::contains -> bool with true

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace Span::contains -> bool with true
@@ -67,19 +67,17 @@
 
     /// Returns `true` if `position` falls within this span.
     ///
     /// The end is treated as inclusive. A cursor sitting immediately after a word is,
     /// to a user, still "on" that word — and hover that dies at the last character feels
     /// broken even though it is technically correct.
     #[must_use]
     pub const fn contains(&self, position: Position) -> bool {
-        position.line == self.line
-            && position.character >= self.start
-            && position.character <= self.end
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The span's width in UTF-16 code units.
     #[must_use]
     pub const fn width(&self) -> u32 {
         self.end.saturating_sub(self.start)
     }

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (1006327) panicked at crates/casm-lsp/src/hover.rs:594:9:
**edge-gateway** — _gateway_

_Showing partial information: the document does not currently parse._

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (1006328) panicked at crates/casm-lsp/src/hover.rs:558:9:
**edge-gateway** — _gateway_

_Showing partial information: the document does not currently parse._

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (1006329) panicked at crates/casm-lsp/src/hover.rs:444:9:
**api** — _service_

Public entry point.

**Interfaces**
- `rest` — http2 v2.1.0

**Controls**
- `OIDC` (security) — tokens required *(evidence required)*

**Calls**

failures:
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    hover::tests::hovering_an_unmodelled_protocol_explains_the_custom_fallback
    hover::tests::hovering_empty_space_produces_nothing

test result: FAILED. 195 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
