*** crates/casm-lsp/src/text.rs:75:9: replace Span::contains -> bool with false

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace Span::contains -> bool with false
@@ -67,19 +67,17 @@
 
     /// Returns `true` if `position` falls within this span.
     ///
     /// The end is treated as inclusive. A cursor sitting immediately after a word is,
     /// to a user, still "on" that word — and hover that dies at the last character feels
     /// broken even though it is technically correct.
     #[must_use]
     pub const fn contains(&self, position: Position) -> bool {
-        position.line == self.line
-            && position.character >= self.start
-            && position.character <= self.end
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The span's width in UTF-16 code units.
     #[must_use]
     pub const fn width(&self) -> u32 {
         self.end.saturating_sub(self.start)
     }

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (1010252) panicked at crates/casm-lsp/src/hover.rs:581:14:
the bound node is under the cursor

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (1010253) panicked at crates/casm-lsp/src/hover.rs:591:14:
the key is under the cursor

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (1010254) panicked at crates/casm-lsp/src/hover.rs:555:14:
the reference is under the cursor

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it

test result: FAILED. 189 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
