*** crates/casm-lsp/src/text.rs:76:13: replace && with || in Span::contains

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace && with || in Span::contains
@@ -68,17 +68,17 @@
     /// Returns `true` if `position` falls within this span.
     ///
     /// The end is treated as inclusive. A cursor sitting immediately after a word is,
     /// to a user, still "on" that word — and hover that dies at the last character feels
     /// broken even though it is technically correct.
     #[must_use]
     pub const fn contains(&self, position: Position) -> bool {
         position.line == self.line
-            && position.character >= self.start
+            || /* ~ changed by cargo-mutants ~ */ position.character >= self.start
             && position.character <= self.end
     }
 
     /// The span's width in UTF-16 code units.
     #[must_use]
     pub const fn width(&self) -> u32 {
         self.end.saturating_sub(self.start)
     }

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (1010223) panicked at crates/casm-lsp/src/hover.rs:558:9:
**edge-gateway** — _gateway_

_Showing partial information: the document does not currently parse._

---- hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type stdout ----

thread 'hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type' (1010225) panicked at crates/casm-lsp/src/hover.rs:444:9:
**service** — _stateless_

A deployable unit of business logic. Must declare at least two security controls.

---- hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block stdout ----

thread 'hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block' (1010244) panicked at crates/casm-lsp/src/hover.rs:485:9:
**api** — _service_

Public entry point.

**Interfaces**
- `rest` — http2 v2.1.0

**Controls**
- `OIDC` (security) — tokens required *(evidence required)*

**Calls**

failures:
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_relationship_type_explains_its_blocking_semantics
    index::tests::a_position_over_a_key_resolves_to_no_symbol
    navigation::tests::an_enum_value_has_no_declaration_to_jump_to
    navigation::tests::both_endpoints_resolve_independently
    navigation::tests::references_on_a_non_node_symbol_finds_nothing
    text::tests::containment_covers_the_span_inclusively_at_both_ends

test result: FAILED. 202 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
