*** crates/casm-lsp/src/text.rs:77:35: replace <= with > in Span::contains

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace <= with > in Span::contains
@@ -69,17 +69,17 @@
     ///
     /// The end is treated as inclusive. A cursor sitting immediately after a word is,
     /// to a user, still "on" that word — and hover that dies at the last character feels
     /// broken even though it is technically correct.
     #[must_use]
     pub const fn contains(&self, position: Position) -> bool {
         position.line == self.line
             && position.character >= self.start
-            && position.character <= self.end
+            && position.character > /* ~ changed by cargo-mutants ~ */ self.end
     }
 
     /// The span's width in UTF-16 code units.
     #[must_use]
     pub const fn width(&self) -> u32 {
         self.end.saturating_sub(self.start)
     }

---- hover::tests::hovering_a_bound_node_explains_the_node stdout ----

thread 'hover::tests::hovering_a_bound_node_explains_the_node' (1014696) panicked at crates/casm-lsp/src/hover.rs:581:14:
the bound node is under the cursor

---- hover::tests::hovering_a_claim_key_explains_the_field stdout ----

thread 'hover::tests::hovering_a_claim_key_explains_the_field' (1014697) panicked at crates/casm-lsp/src/hover.rs:591:14:
the key is under the cursor

---- hover::tests::hovering_a_claimed_pattern_shows_what_it_requires stdout ----

thread 'hover::tests::hovering_a_claimed_pattern_shows_what_it_requires' (1014698) panicked at crates/casm-lsp/src/hover.rs:558:9:
**pattern** — _required, `name@version`_

The pattern being claimed, at an exact version. A claim naming a pattern the library does not hold is reported as unchecked, never assumed satisfied.

failures:
    hover::tests::hovering_a_bound_node_explains_the_node
    hover::tests::hovering_a_claim_key_explains_the_field
    hover::tests::hovering_a_claimed_pattern_shows_what_it_requires
    hover::tests::hovering_a_control_type_explains_it_without_confusing_it_for_a_node_type
    hover::tests::hovering_a_key_explains_the_field
    hover::tests::hovering_a_key_uses_the_vocabulary_of_the_enclosing_block
    hover::tests::hovering_a_node_name_lists_its_interfaces_and_controls
    hover::tests::hovering_a_node_name_lists_what_it_calls_and_what_calls_it
    hover::tests::hovering_a_node_name_shows_its_type_and_description
    hover::tests::hovering_a_node_type_explains_the_type
    hover::tests::hovering_a_pattern_the_library_lacks_says_so
    hover::tests::hovering_a_protocol_explains_it

test result: FAILED. 189 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
