*** crates/casm-lsp/src/text.rs:83:9: replace Span::width -> u32 with 0

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace Span::width -> u32 with 0
@@ -75,17 +75,17 @@
         position.line == self.line
             && position.character >= self.start
             && position.character <= self.end
     }
 
     /// The span's width in UTF-16 code units.
     #[must_use]
     pub const fn width(&self) -> u32 {
-        self.end.saturating_sub(self.start)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the span covers no characters.
     #[must_use]
     pub const fn is_empty(&self) -> bool {
         self.start >= self.end
     }
 }

---- diagnostics::tests::a_node_finding_is_anchored_on_the_node_name stdout ----

thread 'diagnostics::tests::a_node_finding_is_anchored_on_the_node_name' (1015096) panicked at crates/casm-lsp/src/diagnostics.rs:384:9:
assertion `left == right` failed: just the name
  left: 0
 right: 9

---- diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint stdout ----

thread 'diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint' (1015115) panicked at crates/casm-lsp/src/diagnostics.rs:367:9:
and it underlines something

---- hover::tests::hovering_reports_the_span_so_the_editor_can_highlight_it stdout ----

thread 'hover::tests::hovering_reports_the_span_so_the_editor_can_highlight_it' (1015183) panicked at crates/casm-lsp/src/hover.rs:500:9:
assertion `left == right` failed: just `api`, not the whole line
  left: 0
 right: 3

failures:
    diagnostics::tests::a_node_finding_is_anchored_on_the_node_name
    diagnostics::tests::an_unresolved_reference_is_anchored_on_the_offending_endpoint
    hover::tests::hovering_reports_the_span_so_the_editor_can_highlight_it
    index::tests::spans_are_correct_on_lines_containing_multibyte_text
    text::tests::spans_are_built_from_byte_ranges
    text::tests::spans_over_multibyte_text_are_narrower_than_their_byte_range

test result: FAILED. 209 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
