*** crates/casm-lsp/src/text.rs:89:9: replace Span::is_empty -> bool with true

*** mutation diff:
--- crates/casm-lsp/src/text.rs
+++ replace Span::is_empty -> bool with true
@@ -81,17 +81,17 @@
     #[must_use]
     pub const fn width(&self) -> u32 {
         self.end.saturating_sub(self.start)
     }
 
     /// Returns `true` if the span covers no characters.
     #[must_use]
     pub const fn is_empty(&self) -> bool {
-        self.start >= self.end
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Returns the length of `text` in UTF-16 code units.
 ///
 /// This is the unit LSP counts in. A character outside the Basic Multilingual Plane —
 /// an emoji, say — is two units, not one.
 #[must_use]

---- text::tests::an_empty_span_is_identified stdout ----

thread 'text::tests::an_empty_span_is_identified' (1018584) panicked at crates/casm-lsp/src/text.rs:270:9:
assertion failed: !Span::new(0, 3, 4).is_empty()

failures:
    text::tests::an_empty_span_is_identified

test result: FAILED. 214 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
