*** crates/casm-parser/src/document.rs:471:75: replace == with != in NodeIndex<'a>::lookup

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace == with != in NodeIndex<'a>::lookup
@@ -463,17 +463,17 @@
         }
     }
 
     /// Looks up a reference written as either a node name or a `NodeId`.
     fn lookup(&self, reference: &str) -> Option<NodeId> {
         // Names are tried first: they are the common case, and a name that happens to
         // look like a UUID is impossible (the CASIMIR alphabet permits it, but a node so
         // named would still be found here, which is the author's evident intent).
-        if let Some((_, id)) = self.by_name.iter().find(|(name, _)| *name == reference) {
+        if let Some((_, id)) = self.by_name.iter().find(|(name, _)| *name != /* ~ changed by cargo-mutants ~ */ reference) {
             return Some(*id);
         }
 
         NodeId::parse(reference)
             .ok()
             .filter(|id| self.by_name.iter().any(|(_, known)| known == id))
     }

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (1041593) panicked at crates/casm-parser/src/document.rs:735:46:

---- document::tests::emitted_relationships_reference_nodes_by_name stdout ----

thread 'document::tests::emitted_relationships_reference_nodes_by_name' (1041596) panicked at crates/casm-parser/src/document.rs:886:9:
assertion `left == right` failed
  left: "orders-db"
 right: "api"

---- document::tests::resolves_endpoints_written_as_ids stdout ----

thread 'document::tests::resolves_endpoints_written_as_ids' (1041597) panicked at crates/casm-parser/src/document.rs:713:59:
called `Result::unwrap()` on an `Err` value: Semantic { path: "architecture.yaml", message: "relationship '019fd1e8-73e6-7523-9277-b975df25e557' -> 'orders-db': relationship source and target are both '019fd1e8-73e6-7523-9277-b975df25e557'; self-edges are not permitted", suggestion: None }

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    document::tests::emitted_relationships_reference_nodes_by_name
    document::tests::resolves_endpoints_written_as_ids
    document::tests::resolves_endpoints_written_as_names
    document::tests::round_trip_preserves_interfaces_and_controls
    document::tests::round_trip_preserves_the_architecture
    tests::a_dangling_endpoint_is_reported_even_with_valid_syntax
    tests::a_self_edge_is_rejected_by_the_core_through_the_parser
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::emitted_yaml_reparses_to_an_equal_architecture
    tests::parses_the_equivalent_json_document

test result: FAILED. 70 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
