*** crates/casm-parser/src/document.rs:477:69: replace == with != in NodeIndex<'a>::lookup

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace == with != in NodeIndex<'a>::lookup
@@ -469,17 +469,17 @@
         // look like a UUID is impossible (the CASIMIR alphabet permits it, but a node so
         // named would still be found here, which is the author's evident intent).
         if let Some((_, id)) = self.by_name.iter().find(|(name, _)| *name == reference) {
             return Some(*id);
         }
 
         NodeId::parse(reference)
             .ok()
-            .filter(|id| self.by_name.iter().any(|(_, known)| known == id))
+            .filter(|id| self.by_name.iter().any(|(_, known)| known != /* ~ changed by cargo-mutants ~ */ id))
     }
 
     /// The "did you mean" hint for an unresolvable reference, if one is close enough.
     fn hint(&self, reference: &str) -> Option<String> {
         let names = self.by_name.iter().map(|(name, _)| *name);
         suggest::closest(reference, names).map(suggest::did_you_mean)
     }

*** result: Success
