*** crates/casm-parser/src/document.rs:482:9: replace NodeIndex<'a>::hint -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace NodeIndex<'a>::hint -> Option<String> with Some(String::new())
@@ -474,18 +474,17 @@
 
         NodeId::parse(reference)
             .ok()
             .filter(|id| self.by_name.iter().any(|(_, known)| known == id))
     }
 
     /// The "did you mean" hint for an unresolvable reference, if one is close enough.
     fn hint(&self, reference: &str) -> Option<String> {
-        let names = self.by_name.iter().map(|(name, _)| *name);
-        suggest::closest(reference, names).map(suggest::did_you_mean)
+        Some(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves a relationship endpoint.
     fn resolve(
         &self,
         reference: &str,
         endpoint: &'static str,
         path: &Path,

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (2205669) panicked at crates/casm-parser/src/document.rs:816:17:
assertion `left == right` failed
  left: Some("")
 right: Some("did you mean `orders-db`?")

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (2205668) panicked at crates/casm-parser/src/document.rs:828:67:
assertion `left == right` failed
  left: Some("")
 right: None

---- tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node stdout ----

thread 'tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node' (2205735) panicked at crates/casm-parser/src/lib.rs:467:9:
assertion `left == right` failed: rendered: architecture.yaml: relationship target 'orders-bd' does not match any declared node
  help: 
  left: Some("")
 right: Some("did you mean `orders-db`?")

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node

test result: FAILED. 91 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
