*** crates/casm-parser/src/document.rs:493:9: replace NodeIndex<'a>::resolve -> Result<NodeId, ParseError> with Ok(Default::default())

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace NodeIndex<'a>::resolve -> Result<NodeId, ParseError> with Ok(Default::default())
@@ -485,23 +485,17 @@
 
     /// Resolves a relationship endpoint.
     fn resolve(
         &self,
         reference: &str,
         endpoint: &'static str,
         path: &Path,
     ) -> Result<NodeId, ParseError> {
-        self.lookup(reference)
-            .ok_or_else(|| ParseError::UnresolvedReference {
-                path: path.to_path_buf(),
-                endpoint,
-                reference: reference.to_owned(),
-                suggestion: self.hint(reference),
-            })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves a pattern-conformance binding.
     ///
     /// A distinct error from [`NodeIndex::resolve`] because the fix is distinct: a
     /// dangling endpoint means the topology is wrong, while a dangling binding means the
     /// claim points at a node that is not there.
     fn resolve_binding(

---- document::tests::emitted_relationships_reference_nodes_by_name stdout ----

thread 'document::tests::emitted_relationships_reference_nodes_by_name' (1044283) panicked at crates/casm-parser/src/document.rs:878:69:
called `Result::unwrap()` on an `Err` value: Semantic { path: "architecture.yaml", message: "relationship references source node '019fd1e8-9741-79e0-9791-f274e5439749', which does not exist in architecture 'checkout'", suggestion: None }

---- document::tests::an_inline_schema_is_hashed_at_parse_time stdout ----

thread 'document::tests::an_inline_schema_is_hashed_at_parse_time' (1044278) panicked at crates/casm-parser/src/document.rs:826:59:
called `Result::unwrap()` on an `Err` value: Semantic { path: "architecture.yaml", message: "relationship references source node '019fd1e8-9741-79e0-9791-f247a45cfbaa', which does not exist in architecture 'checkout'", suggestion: None }

---- document::tests::resolves_relationships_declared_before_their_nodes stdout ----

thread 'document::tests::resolves_relationships_declared_before_their_nodes' (1044286) panicked at crates/casm-parser/src/document.rs:718:9:
declaration order must not matter

failures:
    document::tests::an_inline_schema_is_hashed_at_parse_time
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    document::tests::emitted_relationships_reference_nodes_by_name
    document::tests::resolves_endpoints_written_as_ids
    document::tests::resolves_endpoints_written_as_names
    document::tests::resolves_relationships_declared_before_their_nodes
    document::tests::round_trip_preserves_interfaces_and_controls
    document::tests::round_trip_preserves_node_ids
    document::tests::round_trip_preserves_the_architecture
    tests::a_dangling_endpoint_is_reported_even_with_valid_syntax
    tests::a_self_edge_is_rejected_by_the_core_through_the_parser

test result: FAILED. 62 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
