*** crates/casm-parser/src/document.rs:514:9: replace NodeIndex<'a>::resolve_binding -> Result<NodeId, ParseError> with Ok(Default::default())

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace NodeIndex<'a>::resolve_binding -> Result<NodeId, ParseError> with Ok(Default::default())
@@ -506,24 +506,17 @@
     /// claim points at a node that is not there.
     fn resolve_binding(
         &self,
         reference: &str,
         pattern: &str,
         role: &str,
         path: &Path,
     ) -> Result<NodeId, ParseError> {
-        self.lookup(reference)
-            .ok_or_else(|| ParseError::UnresolvedBinding {
-                path: path.to_path_buf(),
-                pattern: pattern.to_owned(),
-                role: role.to_owned(),
-                reference: reference.to_owned(),
-                suggestion: self.hint(reference),
-            })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A CASIMIR architecture in authoring form: permissive, unvalidated, human-shaped.
 ///
 /// See the module documentation for the grammar and for why this type is separate from
 /// [`Architecture`].
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]

---- document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so stdout ----

thread 'document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so' (2206471) panicked at crates/casm-parser/src/document.rs:765:67:
resolves: Semantic { path: "architecture.yaml", message: "pattern 'secure-web-tier@1.0.0' binds role 'edge' to node '019fd2ca-3c4c-71a2-b5a1-5b8cccf8b01f', which does not exist in architecture 'checkout'", suggestion: None }

failures:
    document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so

test result: FAILED. 93 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.23s

*** result: Failure(101)
