*** crates/casm-parser/src/error.rs:197:9: replace ParseError::location -> Option<Location> with None

*** mutation diff:
--- crates/casm-parser/src/error.rs
+++ replace ParseError::location -> Option<Location> with None
@@ -189,28 +189,17 @@
             | Self::Io { path, .. } => Some(path),
             Self::Emit { .. } => None,
         }
     }
 
     /// Where in the file the failure occurred, when that is known.
     #[must_use]
     pub const fn location(&self) -> Option<Location> {
-        match self {
-            Self::Syntax { location, .. } => Some(*location),
-            Self::UnknownFormat { .. }
-            | Self::Semantic { .. }
-            | Self::UnresolvedReference { .. }
-            | Self::UnresolvedBinding { .. }
-            | Self::DuplicatePattern { .. }
-            | Self::TooManyPatterns { .. }
-            | Self::TooLarge { .. }
-            | Self::Io { .. }
-            | Self::Emit { .. } => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The actionable fix hint, when one could be inferred.
     #[must_use]
     pub fn suggestion(&self) -> Option<&str> {
         match self {
             Self::Syntax { suggestion, .. }
             | Self::Semantic { suggestion, .. }

*** result: Success
