*** crates/casm-parser/src/error.rs:214:9: replace ParseError::suggestion -> Option<&str> with Some("")

*** mutation diff:
--- crates/casm-parser/src/error.rs
+++ replace ParseError::suggestion -> Option<&str> with Some("")
@@ -206,28 +206,17 @@
             | Self::Io { .. }
             | Self::Emit { .. } => None,
         }
     }
 
     /// The actionable fix hint, when one could be inferred.
     #[must_use]
     pub fn suggestion(&self) -> Option<&str> {
-        match self {
-            Self::Syntax { suggestion, .. }
-            | Self::Semantic { suggestion, .. }
-            | Self::UnresolvedReference { suggestion, .. }
-            | Self::UnresolvedBinding { suggestion, .. } => suggestion.as_deref(),
-            Self::UnknownFormat { .. }
-            | Self::DuplicatePattern { .. }
-            | Self::TooManyPatterns { .. }
-            | Self::TooLarge { .. }
-            | Self::Io { .. }
-            | Self::Emit { .. } => None,
-        }
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders the error the way a compiler would: location, message, then a hint.
     ///
     /// ```text
     /// architecture.yaml:14:5: unknown variant `srvice`, expected one of `service`, …
     ///   help: did you mean `service`?
     /// ```

---- error::tests::accessors_agree_with_the_variant stdout ----

thread 'error::tests::accessors_agree_with_the_variant' (2209257) panicked at crates/casm-parser/src/error.rs:322:9:
assertion `left == right` failed
  left: Some("")
 right: Some("orders-db")

---- error::tests::render_appends_the_help_line stdout ----

thread 'error::tests::render_appends_the_help_line' (2209260) panicked at crates/casm-parser/src/error.rs:279:9:
assertion `left == right` failed
  left: "a.yaml:1:1: bad\n  help: "
 right: "a.yaml:1:1: bad\n  help: try `service`"

---- error::tests::render_omits_the_help_line_when_there_is_no_hint stdout ----

thread 'error::tests::render_omits_the_help_line_when_there_is_no_hint' (2209261) panicked at crates/casm-parser/src/error.rs:288:9:
assertion failed: !err.render().contains("help:")

failures:
    error::tests::accessors_agree_with_the_variant
    error::tests::render_appends_the_help_line
    error::tests::render_omits_the_help_line_when_there_is_no_hint
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 88 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
