*** crates/casm-parser/src/error.rs:236:9: replace ParseError::render -> String with String::new()

*** mutation diff:
--- crates/casm-parser/src/error.rs
+++ replace ParseError::render -> String with String::new()
@@ -228,22 +228,17 @@
     /// Renders the error the way a compiler would: location, message, then a hint.
     ///
     /// ```text
     /// architecture.yaml:14:5: unknown variant `srvice`, expected one of `service`, …
     ///   help: did you mean `service`?
     /// ```
     #[must_use]
     pub fn render(&self) -> String {
-        let mut out = self.to_string();
-        if let Some(hint) = self.suggestion() {
-            out.push_str("\n  help: ");
-            out.push_str(hint);
-        }
-        out
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The canonical result type of `casm-parser`.
 pub type Result<T, E = ParseError> = core::result::Result<T, E>;
 
 #[cfg(test)]
 #[allow(

---- error::tests::render_appends_the_help_line stdout ----

thread 'error::tests::render_appends_the_help_line' (2209985) panicked at crates/casm-parser/src/error.rs:285:9:
assertion `left == right` failed
  left: ""
 right: "a.yaml:1:1: bad\n  help: try `service`"

failures:
    error::tests::render_appends_the_help_line

test result: FAILED. 93 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
