*** crates/casm-parser/src/error.rs:46:9: replace <impl fmt::Display for Location>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-parser/src/error.rs
+++ replace <impl fmt::Display for Location>::fmt -> fmt::Result with Ok(Default::default())
@@ -38,17 +38,17 @@
     #[must_use]
     pub const fn start() -> Self {
         Self { line: 1, column: 1 }
     }
 }
 
 impl fmt::Display for Location {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        write!(f, "{}:{}", self.line, self.column)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Everything that can go wrong turning bytes into an [`casm_core::Architecture`].
 #[derive(Error, Debug, Clone, PartialEq, Eq)]
 #[non_exhaustive]
 pub enum ParseError {
     /// The file's format could not be determined from its extension or contents.

---- error::tests::location_preserves_real_positions stdout ----

thread 'error::tests::location_preserves_real_positions' (1046222) panicked at crates/casm-parser/src/error.rs:268:9:
assertion `left == right` failed
  left: ""
 right: "14:5"

---- error::tests::render_appends_the_help_line stdout ----

thread 'error::tests::render_appends_the_help_line' (1046223) panicked at crates/casm-parser/src/error.rs:290:9:
assertion `left == right` failed
  left: "a.yaml:: bad\n  help: try `service`"
 right: "a.yaml:1:1: bad\n  help: try `service`"

---- error::tests::syntax_errors_lead_with_path_and_position stdout ----

thread 'error::tests::syntax_errors_lead_with_path_and_position' (1046225) panicked at crates/casm-parser/src/error.rs:279:9:
assertion failed: err.to_string().starts_with("architecture.yaml:14:5:")

failures:
    error::tests::location_preserves_real_positions
    error::tests::render_appends_the_help_line
    error::tests::syntax_errors_lead_with_path_and_position

test result: FAILED. 80 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
