*** crates/casm-parser/src/format.rs:101:43: replace && with || in Format::first_meaningful_line

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace && with || in Format::first_meaningful_line
@@ -93,17 +93,17 @@
         Self::Yaml
     }
 
     /// Returns the first line that is neither blank nor a `#` comment.
     fn first_meaningful_line(source: &str) -> Option<&str> {
         source
             .lines()
             .map(str::trim)
-            .find(|line| !line.is_empty() && !line.starts_with('#') && !line.starts_with("---"))
+            .find(|line| !line.is_empty() || /* ~ changed by cargo-mutants ~ */ !line.starts_with('#') && !line.starts_with("---"))
     }
 
     /// Resolves the format for a path, falling back to sniffing its contents.
     #[must_use]
     pub fn resolve(path: &Path, source: &str) -> Self {
         Self::from_path(path).unwrap_or_else(|| Self::sniff(source))
     }
 }

---- format::tests::sniff_detects_json_by_its_opening_brace stdout ----

thread 'format::tests::sniff_detects_json_by_its_opening_brace' (1057139) panicked at crates/casm-parser/src/format.rs:166:9:
assertion `left == right` failed
  left: Yaml
 right: Json

failures:
    format::tests::sniff_detects_json_by_its_opening_brace

test result: FAILED. 82 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
