*** crates/casm-parser/src/format.rs:113:9: replace <impl core::fmt::Display for Format>::fmt -> core::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace <impl core::fmt::Display for Format>::fmt -> core::fmt::Result with Ok(Default::default())
@@ -105,17 +105,17 @@
     #[must_use]
     pub fn resolve(path: &Path, source: &str) -> Self {
         Self::from_path(path).unwrap_or_else(|| Self::sniff(source))
     }
 }
 
 impl core::fmt::Display for Format {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
-        f.write_str(self.label())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

*** result: Success
