*** crates/casm-parser/src/format.rs:34:9: replace Format::label -> &'static str with ""

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace Format::label -> &'static str with ""
@@ -26,21 +26,17 @@
 
 impl Format {
     /// Every format CASIMIR can read, in preference order.
     pub const ALL: [Self; 3] = [Self::Yaml, Self::Json, Self::Toml];
 
     /// Returns the canonical lowercase label.
     #[must_use]
     pub const fn label(self) -> &'static str {
-        match self {
-            Self::Yaml => "yaml",
-            Self::Json => "json",
-            Self::Toml => "toml",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// The file extensions conventionally associated with this format.
     #[must_use]
     pub const fn extensions(self) -> &'static [&'static str] {
         match self {
             Self::Yaml => &["yaml", "yml"],
             Self::Json => &["json"],

*** result: Success
