*** crates/casm-parser/src/format.rs:57:9: replace Format::from_path -> Option<Self> with None

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace Format::from_path -> Option<Self> with None
@@ -49,20 +49,17 @@
     }
 
     /// Classifies a path by its extension, case-insensitively.
     ///
     /// Returns `None` for an unrecognised or absent extension; callers fall back to
     /// [`Format::sniff`].
     #[must_use]
     pub fn from_path(path: &Path) -> Option<Self> {
-        let extension = path.extension()?.to_str()?.to_ascii_lowercase();
-        Self::ALL
-            .into_iter()
-            .find(|format| format.extensions().contains(&extension.as_str()))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Guesses a format from the document's first meaningful character.
     ///
     /// This is a heuristic of last resort, used only when the path carries no usable
     /// extension (a stdin pipe, for instance). It is deliberately conservative: a
     /// document whose shape is ambiguous between YAML and TOML is called YAML, because
     /// YAML is the authoring default and produces the more familiar error messages.

---- format::tests::extension_matching_is_case_insensitive stdout ----

thread 'format::tests::extension_matching_is_case_insensitive' (2213230) panicked at crates/casm-parser/src/format.rs:144:9:
assertion `left == right` failed
  left: None
 right: Some(Yaml)

---- format::tests::extensions_are_recognised stdout ----

thread 'format::tests::extensions_are_recognised' (2213231) panicked at crates/casm-parser/src/format.rs:134:13:
assertion `left == right` failed: a.yaml
  left: None
 right: Some(Yaml)

---- format::tests::resolve_prefers_the_extension_over_the_contents stdout ----

thread 'format::tests::resolve_prefers_the_extension_over_the_contents' (2213233) panicked at crates/casm-parser/src/format.rs:240:9:
assertion `left == right` failed
  left: Yaml
 right: Json

failures:
    format::tests::extension_matching_is_case_insensitive
    format::tests::extensions_are_recognised
    format::tests::resolve_prefers_the_extension_over_the_contents
    library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 83 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
