*** crates/casm-parser/src/format.rs:75:35: replace || with && in Format::sniff

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace || with && in Format::sniff
@@ -67,17 +67,17 @@
     /// document whose shape is ambiguous between YAML and TOML is called YAML, because
     /// YAML is the authoring default and produces the more familiar error messages.
     #[must_use]
     pub fn sniff(source: &str) -> Self {
         let Some(first) = Self::first_meaningful_line(source) else {
             return Self::Yaml;
         };
 
-        if first.starts_with('{') || first.starts_with('[') && first.ends_with(',') {
+        if first.starts_with('{') && /* ~ changed by cargo-mutants ~ */ first.starts_with('[') && first.ends_with(',') {
             return Self::Json;
         }
 
         // A TOML table header (`[section]`) is unambiguous; a YAML sequence entry
         // (`- item`) and a mapping (`key: value`) are not TOML at all.
         if first.starts_with('[') && first.ends_with(']') {
             return Self::Toml;
         }

---- format::tests::resolve_falls_back_to_sniffing_without_an_extension stdout ----

thread 'format::tests::resolve_falls_back_to_sniffing_without_an_extension' (1051453) panicked at crates/casm-parser/src/format.rs:215:9:
assertion `left == right` failed
  left: Yaml
 right: Json

---- format::tests::sniff_detects_json_by_its_opening_brace stdout ----

thread 'format::tests::sniff_detects_json_by_its_opening_brace' (1051456) panicked at crates/casm-parser/src/format.rs:165:9:
assertion `left == right` failed
  left: Yaml
 right: Json

failures:
    format::tests::resolve_falls_back_to_sniffing_without_an_extension
    format::tests::sniff_detects_json_by_its_opening_brace

test result: FAILED. 81 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
