*** crates/casm-parser/src/format.rs:81:35: replace && with || in Format::sniff

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace && with || in Format::sniff
@@ -73,17 +73,17 @@
         };
 
         if first.starts_with('{') || first.starts_with('[') && first.ends_with(',') {
             return Self::Json;
         }
 
         // A TOML table header (`[section]`) is unambiguous; a YAML sequence entry
         // (`- item`) and a mapping (`key: value`) are not TOML at all.
-        if first.starts_with('[') && first.ends_with(']') {
+        if first.starts_with('[') || /* ~ changed by cargo-mutants ~ */ first.ends_with(']') {
             return Self::Toml;
         }
 
         // `key = value` with no colon before the equals is TOML's assignment syntax.
         if let Some(equals) = first.find('=') {
             let before_equals = first.get(..equals).unwrap_or_default();
             if !before_equals.contains(':') && !before_equals.trim().is_empty() {
                 return Self::Toml;

*** result: Success
