*** crates/casm-parser/src/format.rs:88:16: delete ! in Format::sniff

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ delete ! in Format::sniff
@@ -80,17 +80,17 @@
         // (`- item`) and a mapping (`key: value`) are not TOML at all.
         if first.starts_with('[') && first.ends_with(']') {
             return Self::Toml;
         }
 
         // `key = value` with no colon before the equals is TOML's assignment syntax.
         if let Some(equals) = first.find('=') {
             let before_equals = first.get(..equals).unwrap_or_default();
-            if !before_equals.contains(':') && !before_equals.trim().is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */before_equals.contains(':') && !before_equals.trim().is_empty() {
                 return Self::Toml;
             }
         }
 
         Self::Yaml
     }
 
     /// Returns the first line that is neither blank nor a `#` comment.

---- format::tests::sniff_detects_toml_by_bare_assignment stdout ----

thread 'format::tests::sniff_detects_toml_by_bare_assignment' (1053319) panicked at crates/casm-parser/src/format.rs:176:9:
assertion `left == right` failed
  left: Yaml
 right: Toml

---- format::tests::sniff_is_not_fooled_by_a_yaml_value_containing_equals stdout ----

thread 'format::tests::sniff_is_not_fooled_by_a_yaml_value_containing_equals' (1053320) panicked at crates/casm-parser/src/format.rs:190:9:
assertion `left == right` failed
  left: Toml
 right: Yaml

failures:
    format::tests::sniff_detects_toml_by_bare_assignment
    format::tests::sniff_is_not_fooled_by_a_yaml_value_containing_equals

test result: FAILED. 81 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
