*** crates/casm-parser/src/format.rs:98:9: replace Format::first_meaningful_line -> Option<&str> with Some("xyzzy")

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace Format::first_meaningful_line -> Option<&str> with Some("xyzzy")
@@ -90,20 +90,17 @@
             }
         }
 
         Self::Yaml
     }
 
     /// Returns the first line that is neither blank nor a `#` comment.
     fn first_meaningful_line(source: &str) -> Option<&str> {
-        source
-            .lines()
-            .map(str::trim)
-            .find(|line| !line.is_empty() && !line.starts_with('#') && !line.starts_with("---"))
+        Some("xyzzy") /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves the format for a path, falling back to sniffing its contents.
     #[must_use]
     pub fn resolve(path: &Path, source: &str) -> Self {
         Self::from_path(path).unwrap_or_else(|| Self::sniff(source))
     }
 }

---- format::tests::a_table_header_needs_both_brackets_to_be_toml stdout ----

thread 'format::tests::a_table_header_needs_both_brackets_to_be_toml' (2217166) panicked at crates/casm-parser/src/format.rs:188:9:
assertion `left == right` failed
  left: Yaml
 right: Toml

---- format::tests::resolve_falls_back_to_sniffing_without_an_extension stdout ----

thread 'format::tests::resolve_falls_back_to_sniffing_without_an_extension' (2217170) panicked at crates/casm-parser/src/format.rs:246:9:
assertion `left == right` failed
  left: Yaml
 right: Json

---- format::tests::sniff_detects_json_by_its_opening_brace stdout ----

thread 'format::tests::sniff_detects_json_by_its_opening_brace' (2217173) panicked at crates/casm-parser/src/format.rs:162:9:
assertion `left == right` failed
  left: Yaml
 right: Json

failures:
    format::tests::a_table_header_needs_both_brackets_to_be_toml
    format::tests::resolve_falls_back_to_sniffing_without_an_extension
    format::tests::sniff_detects_json_by_its_opening_brace
    format::tests::sniff_detects_toml_by_a_table_header
    format::tests::sniff_detects_toml_by_bare_assignment

test result: FAILED. 89 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
