*** crates/casm-parser/src/lib.rs:132:23: replace > with == in parse_file

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace > with == in parse_file
@@ -124,17 +124,17 @@
 /// - Otherwise as [`parse_str`].
 pub fn parse_file(path: &Path) -> Result<Architecture> {
     let metadata = std::fs::metadata(path).map_err(|error| ParseError::Io {
         path: path.to_path_buf(),
         message: error.to_string(),
     })?;
 
     // Rule 5: check the bound before allocating, not after.
-    if metadata.len() > MAX_DOCUMENT_BYTES {
+    if metadata.len() == /* ~ changed by cargo-mutants ~ */ MAX_DOCUMENT_BYTES {
         return Err(ParseError::TooLarge {
             path: path.to_path_buf(),
             size: metadata.len(),
             limit: MAX_DOCUMENT_BYTES,
         });
     }
 
     let source = std::fs::read_to_string(path).map_err(|error| ParseError::Io {

*** result: Success
