*** crates/casm-parser/src/lib.rs:132:23: replace > with < in parse_file

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace > with < in parse_file
@@ -124,17 +124,17 @@
 /// - Otherwise as [`parse_str`].
 pub fn parse_file(path: &Path) -> Result<Architecture> {
     let metadata = std::fs::metadata(path).map_err(|error| ParseError::Io {
         path: path.to_path_buf(),
         message: error.to_string(),
     })?;
 
     // Rule 5: check the bound before allocating, not after.
-    if metadata.len() > MAX_DOCUMENT_BYTES {
+    if metadata.len() < /* ~ changed by cargo-mutants ~ */ MAX_DOCUMENT_BYTES {
         return Err(ParseError::TooLarge {
             path: path.to_path_buf(),
             size: metadata.len(),
             limit: MAX_DOCUMENT_BYTES,
         });
     }
 
     let source = std::fs::read_to_string(path).map_err(|error| ParseError::Io {

---- tests::parse_file_reads_a_real_document stdout ----

thread 'tests::parse_file_reads_a_real_document' (2190031) panicked at crates/casm-parser/src/lib.rs:582:46:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/tmp/casm-parser-test/architecture.yaml", size: 299, limit: 67108864 }

---- tests::a_file_at_the_ceiling_is_read_and_one_past_it_is_refused stdout ----

thread 'tests::a_file_at_the_ceiling_is_read_and_one_past_it_is_refused' (2190019) panicked at crates/casm-parser/src/lib.rs:404:9:
a file past the ceiling must be refused

failures:
    tests::a_file_at_the_ceiling_is_read_and_one_past_it_is_refused
    tests::parse_file_reads_a_real_document

test result: FAILED. 92 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.98s

*** result: Failure(101)
