*** crates/casm-parser/src/lib.rs:235:5: replace infer_suggestion -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace infer_suggestion -> Option<String> with Some(String::new())
@@ -227,33 +227,17 @@
 }
 
 /// Extracts a "did you mean" hint from a serde "unknown variant/field" message.
 ///
 /// `serde` already names both the offending token and the permitted set, in backticks;
 /// all that is missing is picking the nearest one. This turns a wall of twelve valid
 /// variants into a single actionable line.
 fn infer_suggestion(message: &str) -> Option<String> {
-    if !message.contains("unknown variant") && !message.contains("unknown field") {
-        return None;
-    }
-
-    let quoted: Vec<&str> = message
-        .split('`')
-        .skip(1)
-        .step_by(2)
-        .filter(|token| !token.is_empty())
-        .collect();
-
-    let (offender, expected) = quoted.split_first()?;
-    if expected.is_empty() {
-        return None;
-    }
-
-    suggest::closest(offender, expected.iter().copied()).map(suggest::did_you_mean)
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a byte offset into a 1-indexed line and column.
 ///
 /// Used for TOML, whose errors carry a span rather than a position.
 fn offset_to_location(source: &str, offset: usize) -> Location {
     let consumed = source.get(..offset).unwrap_or(source);
     let line = consumed.matches('\n').count() + 1;

---- tests::an_unknown_field_suggests_the_nearest_valid_one stdout ----

thread 'tests::an_unknown_field_suggests_the_nearest_valid_one' (2195907) panicked at crates/casm-parser/src/lib.rs:428:9:
assertion `left == right` failed: rendered: architecture.yaml:3:5: nodes[0]: unknown field `nmae`, expected one of `name`, `type`, `id`, `description`, `interfaces`, `controls`, `metadata` at line 3 column 5
  help: 
  left: Some("")
 right: Some("did you mean `name`?")

---- tests::an_unknown_node_type_suggests_the_nearest_valid_one stdout ----

thread 'tests::an_unknown_node_type_suggests_the_nearest_valid_one' (2195908) panicked at crates/casm-parser/src/lib.rs:416:9:
assertion `left == right` failed: rendered: architecture.yaml:4:11: nodes[0].type: unknown variant `srvice`, expected one of `service`, `database`, `queue`, `cache`, `gateway`, `storage`, `external-system`, `legacy`, `human`, `boundary` at line 4 column 11
  help: 
  left: Some("")
 right: Some("did you mean `service`?")

---- tests::suggestion_inference_declines_when_nothing_is_near stdout ----

thread 'tests::suggestion_inference_declines_when_nothing_is_near' (2195922) panicked at crates/casm-parser/src/lib.rs:550:9:
assertion `left == right` failed
  left: Some("")
 right: None

failures:
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one
    tests::suggestion_inference_declines_when_nothing_is_near
    tests::suggestion_inference_ignores_unrelated_messages

test result: FAILED. 90 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.97s

*** result: Failure(101)
