*** crates/casm-parser/src/lib.rs:243:25: delete ! in infer_suggestion

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ delete ! in infer_suggestion
@@ -235,17 +235,17 @@
     if !message.contains("unknown variant") && !message.contains("unknown field") {
         return None;
     }
 
     let quoted: Vec<&str> = message
         .split('`')
         .skip(1)
         .step_by(2)
-        .filter(|token| !token.is_empty())
+        .filter(|token|  /* ~ changed by cargo-mutants ~ */token.is_empty())
         .collect();
 
     let (offender, expected) = quoted.split_first()?;
     if expected.is_empty() {
         return None;
     }
 
     suggest::closest(offender, expected.iter().copied()).map(suggest::did_you_mean)

---- tests::an_unknown_field_suggests_the_nearest_valid_one stdout ----

thread 'tests::an_unknown_field_suggests_the_nearest_valid_one' (2198743) panicked at crates/casm-parser/src/lib.rs:444:9:
assertion `left == right` failed: rendered: architecture.yaml:3:5: nodes[0]: unknown field `nmae`, expected one of `name`, `type`, `id`, `description`, `interfaces`, `controls`, `metadata` at line 3 column 5
  left: None
 right: Some("did you mean `name`?")

---- tests::an_unknown_node_type_suggests_the_nearest_valid_one stdout ----

thread 'tests::an_unknown_node_type_suggests_the_nearest_valid_one' (2198744) panicked at crates/casm-parser/src/lib.rs:432:9:
assertion `left == right` failed: rendered: architecture.yaml:4:11: nodes[0].type: unknown variant `srvice`, expected one of `service`, `database`, `queue`, `cache`, `gateway`, `storage`, `external-system`, `legacy`, `human`, `boundary` at line 4 column 11
  left: None
 right: Some("did you mean `service`?")

failures:
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 92 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.73s

*** result: Failure(101)
