*** crates/casm-parser/src/lib.rs:263:9: replace + with - in offset_to_location

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace + with - in offset_to_location
@@ -255,17 +255,17 @@
 ///
 /// Used for TOML, whose errors carry a span rather than a position.
 fn offset_to_location(source: &str, offset: usize) -> Location {
     let consumed = source.get(..offset).unwrap_or(source);
     let line = consumed.matches('\n').count() + 1;
     let column = consumed
         .rsplit_once('\n')
         .map_or(consumed.len(), |(_, tail)| tail.len())
-        + 1;
+        - /* ~ changed by cargo-mutants ~ */ 1;
     Location::new(line, column)
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- tests::offset_conversion_matches_hand_counted_positions stdout ----

thread 'tests::offset_conversion_matches_hand_counted_positions' (2200643) panicked at crates/casm-parser/src/lib.rs:260:18:
attempt to subtract with overflow

failures:
    tests::offset_conversion_matches_hand_counted_positions

test result: FAILED. 93 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
