*** crates/casm-parser/src/lib.rs:90:40: replace * with /

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace * with /
@@ -82,17 +82,17 @@
     Library, MAX_LIBRARY_PATTERNS, PatternDoc, RequiredRelationshipDoc, RequirementDoc,
     emit_pattern_str, parse_pattern_file, parse_pattern_str,
 };
 
 /// The largest document `casm-parser` will read from disk, in bytes.
 ///
 /// 64 MiB is roughly two orders of magnitude beyond the largest plausible hand-written
 /// architecture, which makes it a generous ceiling that still bounds the blast radius.
-pub const MAX_DOCUMENT_BYTES: u64 = 64 * 1024 * 1024;
+pub const MAX_DOCUMENT_BYTES: u64 = 64 / /* ~ changed by cargo-mutants ~ */ 1024 * 1024;
 
 /// Parses an architecture from an in-memory document.
 ///
 /// The format is resolved from `path`'s extension, falling back to sniffing `source`.
 /// `path` is used only for format detection and error attribution; nothing is read from
 /// disk.
 ///
 /// # Errors

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (2197573) panicked at crates/casm-parser/src/library.rs:669:49:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/tmp/casm-library-019fd2c9-e7a4-7d62-bda5-0439b419fac5/other.yaml", size: 27, limit: 0 }

---- library::tests::a_library_refuses_two_definitions_of_the_same_reference stdout ----

thread 'library::tests::a_library_refuses_two_definitions_of_the_same_reference' (2197574) panicked at crates/casm-parser/src/library.rs:706:22:
expected DuplicatePattern, got TooLarge { path: "/tmp/casm-library-019fd2c9-e7a4-7d62-bda5-0444cb3f9688/a.yaml", size: 23, limit: 0 }

---- library::tests::a_library_skips_files_that_are_not_architecture_formats stdout ----

thread 'library::tests::a_library_skips_files_that_are_not_architecture_formats' (2197575) panicked at crates/casm-parser/src/library.rs:689:46:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/tmp/casm-library-019fd2c9-e7a5-7ab2-8a26-6e743a20ff67/p.yaml", size: 8, limit: 0 }

failures:
    library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not
    library::tests::two_versions_of_one_pattern_coexist
    tests::parse_file_reads_a_real_document
    tests::the_document_ceiling_is_the_value_it_claims_to_be

test result: FAILED. 84 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
