*** crates/casm-parser/src/lib.rs:90:47: replace * with /

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace * with /
@@ -82,17 +82,17 @@
     Library, MAX_LIBRARY_PATTERNS, PatternDoc, RequiredRelationshipDoc, RequirementDoc,
     emit_pattern_str, parse_pattern_file, parse_pattern_str,
 };
 
 /// The largest document `casm-parser` will read from disk, in bytes.
 ///
 /// 64 MiB is roughly two orders of magnitude beyond the largest plausible hand-written
 /// architecture, which makes it a generous ceiling that still bounds the blast radius.
-pub const MAX_DOCUMENT_BYTES: u64 = 64 * 1024 * 1024;
+pub const MAX_DOCUMENT_BYTES: u64 = 64 * 1024 / /* ~ changed by cargo-mutants ~ */ 1024;
 
 /// Parses an architecture from an in-memory document.
 ///
 /// The format is resolved from `path`'s extension, falling back to sniffing `source`.
 /// `path` is used only for format detection and error attribution; nothing is read from
 /// disk.
 ///
 /// # Errors

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (1030372) panicked at crates/casm-parser/src/library.rs:625:49:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/tmp/casm-library-019fd1e7-f9bf-7440-a2f9-999f7697d747/secure-web-tier.yaml", size: 333, limit: 64 }

---- tests::parse_file_reads_a_real_document stdout ----

thread 'tests::parse_file_reads_a_real_document' (1030419) panicked at crates/casm-parser/src/lib.rs:541:46:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/tmp/casm-parser-test/architecture.yaml", size: 299, limit: 64 }

failures:
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    tests::parse_file_reads_a_real_document

test result: FAILED. 81 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
