*** crates/casm-parser/src/library.rs:300:5: replace emit_pattern_str -> Result<String, ParseError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace emit_pattern_str -> Result<String, ParseError> with Ok("xyzzy".into())
@@ -292,17 +292,17 @@
 }
 
 /// Serialises a pattern back into authoring form.
 ///
 /// # Errors
 ///
 /// Returns [`ParseError::Emit`] if the underlying serialiser fails.
 pub fn emit_pattern_str(pattern: &Pattern, format: Format) -> Result<String, ParseError> {
-    crate::serialize(&PatternDoc::from_pattern(pattern), format)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads a file, refusing one larger than [`MAX_DOCUMENT_BYTES`].
 fn read_bounded(path: &Path) -> Result<String, ParseError> {
     let metadata = std::fs::metadata(path).map_err(|error| ParseError::Io {
         path: path.to_path_buf(),
         message: error.to_string(),
     })?;

---- library::tests::a_pattern_round_trips_through_every_format stdout ----

thread 'library::tests::a_pattern_round_trips_through_every_format' (1062270) panicked at crates/casm-parser/src/library.rs:540:18:
called `Result::unwrap()` on an `Err` value: Syntax { path: "secure-web-tier.yaml", location: Location { line: 1, column: 1 }, message: "invalid type: string \"xyzzy\", expected struct PatternDoc", suggestion: None }

failures:
    library::tests::a_pattern_round_trips_through_every_format

test result: FAILED. 82 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
