*** crates/casm-parser/src/library.rs:305:5: replace read_bounded -> Result<String, ParseError> with Ok(String::new())

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace read_bounded -> Result<String, ParseError> with Ok(String::new())
@@ -297,33 +297,17 @@
 ///
 /// Returns [`ParseError::Emit`] if the underlying serialiser fails.
 pub fn emit_pattern_str(pattern: &Pattern, format: Format) -> Result<String, ParseError> {
     crate::serialize(&PatternDoc::from_pattern(pattern), format)
 }
 
 /// Reads a file, refusing one larger than [`MAX_DOCUMENT_BYTES`].
 fn read_bounded(path: &Path) -> Result<String, ParseError> {
-    let metadata = std::fs::metadata(path).map_err(|error| ParseError::Io {
-        path: path.to_path_buf(),
-        message: error.to_string(),
-    })?;
-
-    if metadata.len() > MAX_DOCUMENT_BYTES {
-        return Err(ParseError::TooLarge {
-            path: path.to_path_buf(),
-            size: metadata.len(),
-            limit: MAX_DOCUMENT_BYTES,
-        });
-    }
-
-    std::fs::read_to_string(path).map_err(|error| ParseError::Io {
-        path: path.to_path_buf(),
-        message: error.to_string(),
-    })
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A collection of patterns, loaded from a directory or assembled in memory.
 ///
 /// Lookup is by `name@version`. Two versions of one pattern coexist happily — that is
 /// what makes a migration expressible as a period during which an architecture claims
 /// both.
 #[derive(Clone, Debug, Default)]

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (2223988) panicked at crates/casm-parser/src/library.rs:733:49:
called `Result::unwrap()` on an `Err` value: Syntax { path: "/tmp/casm-library-019fd2ca-a219-7a11-8511-0b99f5164b84/v1.yaml", location: Location { line: 1, column: 1 }, message: "missing field `name`", suggestion: None }

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (2223984) panicked at crates/casm-parser/src/library.rs:653:49:
called `Result::unwrap()` on an `Err` value: Syntax { path: "/tmp/casm-library-019fd2ca-a219-7a11-8511-0b68ba071b39/other.yaml", location: Location { line: 1, column: 1 }, message: "missing field `name`", suggestion: None }

---- library::tests::a_library_refuses_two_definitions_of_the_same_reference stdout ----

thread 'library::tests::a_library_refuses_two_definitions_of_the_same_reference' (2223985) panicked at crates/casm-parser/src/library.rs:690:22:
expected DuplicatePattern, got Syntax { path: "/tmp/casm-library-019fd2ca-a219-7a11-8511-0b7e33877f2d/a.yaml", location: Location { line: 1, column: 1 }, message: "missing field `name`", suggestion: None }

failures:
    library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 86 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
