*** crates/casm-parser/src/library.rs:310:23: replace > with < in read_bounded

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace > with < in read_bounded
@@ -302,17 +302,17 @@
 
 /// Reads a file, refusing one larger than [`MAX_DOCUMENT_BYTES`].
 fn read_bounded(path: &Path) -> Result<String, ParseError> {
     let metadata = std::fs::metadata(path).map_err(|error| ParseError::Io {
         path: path.to_path_buf(),
         message: error.to_string(),
     })?;
 
-    if metadata.len() > MAX_DOCUMENT_BYTES {
+    if metadata.len() < /* ~ changed by cargo-mutants ~ */ MAX_DOCUMENT_BYTES {
         return Err(ParseError::TooLarge {
             path: path.to_path_buf(),
             size: metadata.len(),
             limit: MAX_DOCUMENT_BYTES,
         });
     }
 
     std::fs::read_to_string(path).map_err(|error| ParseError::Io {

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (1063976) panicked at crates/casm-parser/src/library.rs:625:49:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/tmp/casm-library-019fd1e9-39c5-7960-84d1-57cbfe5d1fe8/other.yaml", size: 27, limit: 67108864 }

---- library::tests::a_library_refuses_two_definitions_of_the_same_reference stdout ----

thread 'library::tests::a_library_refuses_two_definitions_of_the_same_reference' (1063977) panicked at crates/casm-parser/src/library.rs:662:22:
expected DuplicatePattern, got TooLarge { path: "/tmp/casm-library-019fd1e9-39c5-7960-84d1-57a5f3ba8638/a.yaml", size: 23, limit: 67108864 }

---- library::tests::a_library_skips_files_that_are_not_architecture_formats stdout ----

thread 'library::tests::a_library_skips_files_that_are_not_architecture_formats' (1063978) panicked at crates/casm-parser/src/library.rs:645:46:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/tmp/casm-library-019fd1e9-39c5-7960-84d1-57b3d75b51a1/p.yaml", size: 8, limit: 67108864 }

failures:
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 77 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
