*** crates/casm-parser/src/library.rs:310:23: replace > with >= in read_bounded

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace > with >= in read_bounded
@@ -302,17 +302,17 @@
 
 /// Reads a file, refusing one larger than [`MAX_DOCUMENT_BYTES`].
 fn read_bounded(path: &Path) -> Result<String, ParseError> {
     let metadata = std::fs::metadata(path).map_err(|error| ParseError::Io {
         path: path.to_path_buf(),
         message: error.to_string(),
     })?;
 
-    if metadata.len() > MAX_DOCUMENT_BYTES {
+    if metadata.len() >= /* ~ changed by cargo-mutants ~ */ MAX_DOCUMENT_BYTES {
         return Err(ParseError::TooLarge {
             path: path.to_path_buf(),
             size: metadata.len(),
             limit: MAX_DOCUMENT_BYTES,
         });
     }
 
     std::fs::read_to_string(path).map_err(|error| ParseError::Io {

*** result: Success
