*** crates/casm-parser/src/library.rs:368:31: replace && with || in Library::load

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace && with || in Library::load
@@ -360,17 +360,17 @@
         // Sorted, so that a duplicate-definition error names the same file every run.
         let mut files: Vec<PathBuf> = Vec::new();
         for entry in entries {
             let entry = entry.map_err(|error| ParseError::Io {
                 path: directory.to_path_buf(),
                 message: error.to_string(),
             })?;
             let path = entry.path();
-            if path.is_file() && Format::from_path(&path).is_some() {
+            if path.is_file() || /* ~ changed by cargo-mutants ~ */ Format::from_path(&path).is_some() {
                 files.push(path);
             }
         }
         files.sort();
 
         if files.len() > MAX_LIBRARY_PATTERNS {
             return Err(ParseError::TooManyPatterns {
                 path: directory.to_path_buf(),

---- library::tests::a_library_skips_files_that_are_not_architecture_formats stdout ----

thread 'library::tests::a_library_skips_files_that_are_not_architecture_formats' (1065321) panicked at crates/casm-parser/src/library.rs:645:46:
called `Result::unwrap()` on an `Err` value: Syntax { path: "/tmp/casm-library-019fd1e9-44bf-73f0-a9e7-ae9283c05d72/README.md", location: Location { line: 2, column: 1 }, message: "missing field `name` at line 2 column 1", suggestion: None }

failures:
    library::tests::a_library_skips_files_that_are_not_architecture_formats

test result: FAILED. 82 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
