*** crates/casm-parser/src/library.rs:374:24: replace > with < in Library::load

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace > with < in Library::load
@@ -366,17 +366,17 @@
             })?;
             let path = entry.path();
             if path.is_file() && Format::from_path(&path).is_some() {
                 files.push(path);
             }
         }
         files.sort();
 
-        if files.len() > MAX_LIBRARY_PATTERNS {
+        if files.len() < /* ~ changed by cargo-mutants ~ */ MAX_LIBRARY_PATTERNS {
             return Err(ParseError::TooManyPatterns {
                 path: directory.to_path_buf(),
                 count: files.len(),
                 limit: MAX_LIBRARY_PATTERNS,
             });
         }
 
         let mut library = Self::new();

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (2229105) panicked at crates/casm-parser/src/library.rs:669:49:
called `Result::unwrap()` on an `Err` value: TooManyPatterns { path: "/tmp/casm-library-019fd2ca-c335-7a30-90fd-9516c09fe844", count: 2, limit: 1024 }

---- library::tests::a_library_skips_files_that_are_not_architecture_formats stdout ----

thread 'library::tests::a_library_skips_files_that_are_not_architecture_formats' (2229107) panicked at crates/casm-parser/src/library.rs:689:46:
called `Result::unwrap()` on an `Err` value: TooManyPatterns { path: "/tmp/casm-library-019fd2ca-c335-7a30-90fd-952b479fe5fc", count: 1, limit: 1024 }

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (2229109) panicked at crates/casm-parser/src/library.rs:749:49:
called `Result::unwrap()` on an `Err` value: TooManyPatterns { path: "/tmp/casm-library-019fd2ca-c337-7f23-981f-2acb1bdda08e", count: 1, limit: 1024 }

failures:
    library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 86 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.01s

*** result: Failure(101)
