*** crates/casm-parser/src/library.rs:397:9: replace Library::insert -> Result<(), ParseError> with Ok(())

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::insert -> Result<(), ParseError> with Ok(())
@@ -389,31 +389,17 @@
 
     /// Adds a pattern, refusing a second definition of the same `name@version`.
     ///
     /// # Errors
     ///
     /// Returns [`ParseError::DuplicatePattern`] naming both files, because "which file
     /// wins" is a question no ordering answers defensibly.
     pub fn insert(&mut self, pattern: Pattern, source: PathBuf) -> Result<(), ParseError> {
-        let reference = pattern.reference();
-        if let Some((_, existing)) = self
-            .patterns
-            .iter()
-            .find(|(known, _)| known.reference() == reference)
-        {
-            return Err(ParseError::DuplicatePattern {
-                path: source,
-                pattern: reference,
-                first: existing.clone(),
-            });
-        }
-
-        self.patterns.push((pattern, source));
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every pattern, in load order.
     pub fn patterns(&self) -> impl Iterator<Item = &Pattern> {
         self.patterns.iter().map(|(pattern, _)| pattern)
     }
 
     /// How many patterns the library holds.

---- library::tests::a_library_refuses_two_definitions_of_the_same_reference stdout ----

thread 'library::tests::a_library_refuses_two_definitions_of_the_same_reference' (1067142) panicked at crates/casm-parser/src/library.rs:642:47:
called `Result::unwrap_err()` on an `Ok` value: Library { patterns: [] }

---- library::tests::a_library_skips_files_that_are_not_architecture_formats stdout ----

thread 'library::tests::a_library_skips_files_that_are_not_architecture_formats' (1067143) panicked at crates/casm-parser/src/library.rs:631:9:
assertion `left == right` failed
  left: 0
 right: 1

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (1067145) panicked at crates/casm-parser/src/library.rs:695:14:
called `Option::unwrap()` on a `None` value

failures:
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 77 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
