*** crates/casm-parser/src/library.rs:401:50: replace == with != in Library::insert

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace == with != in Library::insert
@@ -393,17 +393,17 @@
     ///
     /// Returns [`ParseError::DuplicatePattern`] naming both files, because "which file
     /// wins" is a question no ordering answers defensibly.
     pub fn insert(&mut self, pattern: Pattern, source: PathBuf) -> Result<(), ParseError> {
         let reference = pattern.reference();
         if let Some((_, existing)) = self
             .patterns
             .iter()
-            .find(|(known, _)| known.reference() == reference)
+            .find(|(known, _)| known.reference() != /* ~ changed by cargo-mutants ~ */ reference)
         {
             return Err(ParseError::DuplicatePattern {
                 path: source,
                 pattern: reference,
                 first: existing.clone(),
             });
         }

---- library::tests::a_library_refuses_two_definitions_of_the_same_reference stdout ----

thread 'library::tests::a_library_refuses_two_definitions_of_the_same_reference' (2229328) panicked at crates/casm-parser/src/library.rs:700:47:

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (2229327) panicked at crates/casm-parser/src/library.rs:669:49:
called `Result::unwrap()` on an `Err` value: DuplicatePattern { path: "/tmp/casm-library-019fd2ca-c597-7350-8a84-419f8f9bf54a/secure-web-tier.yaml", pattern: "secure-web-tier@1.0.0", first: "/tmp/casm-library-019fd2ca-c597-7350-8a84-419f8f9bf54a/other.yaml" }

---- library::tests::two_versions_of_one_pattern_coexist stdout ----

thread 'library::tests::two_versions_of_one_pattern_coexist' (2229341) panicked at crates/casm-parser/src/library.rs:717:49:
called `Result::unwrap()` on an `Err` value: DuplicatePattern { path: "/tmp/casm-library-019fd2ca-c59a-7762-9c68-988b2906502c/v2.yaml", pattern: "p@2.0.0", first: "/tmp/casm-library-019fd2ca-c59a-7762-9c68-988b2906502c/v1.yaml" }

failures:
    library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 90 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
