*** crates/casm-parser/src/library.rs:416:9: replace Library::patterns -> impl Iterator<Item =&Pattern> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::patterns -> impl Iterator<Item =&Pattern> with ::std::iter::empty()
@@ -408,17 +408,17 @@
         }
 
         self.patterns.push((pattern, source));
         Ok(())
     }
 
     /// Every pattern, in load order.
     pub fn patterns(&self) -> impl Iterator<Item = &Pattern> {
-        self.patterns.iter().map(|(pattern, _)| pattern)
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many patterns the library holds.
     #[inline]
     #[must_use]
     pub fn len(&self) -> usize {
         self.patterns.len()
     }

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (1068668) panicked at crates/casm-parser/src/library.rs:709:14:
called `Option::unwrap()` on a `None` value

---- library::tests::a_wrong_version_is_answered_with_the_versions_that_exist stdout ----

thread 'library::tests::a_wrong_version_is_answered_with_the_versions_that_exist' (1068677) panicked at crates/casm-parser/src/library.rs:698:14:
called `Option::unwrap()` on a `None` value

---- library::tests::two_versions_of_one_pattern_coexist stdout ----

thread 'library::tests::two_versions_of_one_pattern_coexist' (1068680) panicked at crates/casm-parser/src/library.rs:674:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 80 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
