*** crates/casm-parser/src/library.rs:423:9: replace Library::len -> usize with 0

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::len -> usize with 0
@@ -415,17 +415,17 @@
     pub fn patterns(&self) -> impl Iterator<Item = &Pattern> {
         self.patterns.iter().map(|(pattern, _)| pattern)
     }
 
     /// How many patterns the library holds.
     #[inline]
     #[must_use]
     pub fn len(&self) -> usize {
-        self.patterns.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the library holds no patterns.
     #[inline]
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.patterns.is_empty()
     }

---- library::tests::a_library_skips_files_that_are_not_architecture_formats stdout ----

thread 'library::tests::a_library_skips_files_that_are_not_architecture_formats' (1069107) panicked at crates/casm-parser/src/library.rs:645:9:
assertion `left == right` failed
  left: 0
 right: 1

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (1069105) panicked at crates/casm-parser/src/library.rs:627:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_skips_files_that_are_not_architecture_formats

test result: FAILED. 81 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
