*** crates/casm-parser/src/library.rs:445:9: replace Library::source_of -> Option<&Path> with None

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::source_of -> Option<&Path> with None
@@ -437,20 +437,17 @@
             .iter()
             .find(|(pattern, _)| reference.matches(pattern))
             .map(|(pattern, _)| pattern)
     }
 
     /// The file a pattern was loaded from, if it came from one.
     #[must_use]
     pub fn source_of(&self, reference: &PatternRef) -> Option<&Path> {
-        self.patterns
-            .iter()
-            .find(|(pattern, _)| reference.matches(pattern))
-            .map(|(_, path)| path.as_path())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every version of `name` the library holds, in load order.
     pub fn versions_of<'a>(&'a self, name: &'a str) -> impl Iterator<Item = &'a Pattern> {
         self.patterns()
             .filter(move |pattern| pattern.name().as_str() == name)
     }

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (2233023) panicked at crates/casm-parser/src/library.rs:672:43:
called `Option::unwrap()` on a `None` value

failures:
    library::tests::a_library_loads_every_pattern_file_in_a_directory

test result: FAILED. 93 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.82s

*** result: Failure(101)
