*** crates/casm-parser/src/library.rs:454:60: replace == with != in Library::versions_of

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace == with != in Library::versions_of
@@ -446,17 +446,17 @@
             .iter()
             .find(|(pattern, _)| reference.matches(pattern))
             .map(|(_, path)| path.as_path())
     }
 
     /// Every version of `name` the library holds, in load order.
     pub fn versions_of<'a>(&'a self, name: &'a str) -> impl Iterator<Item = &'a Pattern> {
         self.patterns()
-            .filter(move |pattern| pattern.name().as_str() == name)
+            .filter(move |pattern| pattern.name().as_str() != /* ~ changed by cargo-mutants ~ */ name)
     }
 
     /// The nearest reference to `wanted`, for a "did you mean" hint.
     ///
     /// Nearest by name rather than by version: an author who wrote the wrong version
     /// number is better served by being shown the versions that exist.
     #[must_use]
     pub fn closest(&self, wanted: &PatternRef) -> Option<String> {

---- library::tests::a_wrong_version_is_answered_with_the_versions_that_exist stdout ----

thread 'library::tests::a_wrong_version_is_answered_with_the_versions_that_exist' (2234357) panicked at crates/casm-parser/src/library.rs:743:9:
did you mean `p`?

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (2234349) panicked at crates/casm-parser/src/library.rs:754:9:
assertion `left == right` failed
  left: "'secure-web-teir' is available at version 1.0.0"
 right: "did you mean `secure-web-tier`?"

---- library::tests::two_versions_of_one_pattern_coexist stdout ----

thread 'library::tests::two_versions_of_one_pattern_coexist' (2234362) panicked at crates/casm-parser/src/library.rs:718:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 91 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
