*** crates/casm-parser/src/library.rs:463:9: replace Library::closest -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::closest -> Option<String> with Some("xyzzy".into())
@@ -455,30 +455,17 @@
     }
 
     /// The nearest reference to `wanted`, for a "did you mean" hint.
     ///
     /// Nearest by name rather than by version: an author who wrote the wrong version
     /// number is better served by being shown the versions that exist.
     #[must_use]
     pub fn closest(&self, wanted: &PatternRef) -> Option<String> {
-        if self.versions_of(wanted.name()).next().is_some() {
-            let available: Vec<String> = self
-                .versions_of(wanted.name())
-                .map(|pattern| pattern.version().to_string())
-                .collect();
-            return Some(format!(
-                "'{}' is available at version {}",
-                wanted.name(),
-                available.join(", ")
-            ));
-        }
-
-        let names = self.patterns().map(|pattern| pattern.name().as_str());
-        suggest::closest(wanted.name(), names).map(suggest::did_you_mean)
+        Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (1073552) panicked at crates/casm-parser/src/library.rs:697:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "did you mean `secure-web-tier`?"

---- library::tests::a_wrong_version_is_answered_with_the_versions_that_exist stdout ----

thread 'library::tests::a_wrong_version_is_answered_with_the_versions_that_exist' (1073558) panicked at crates/casm-parser/src/library.rs:686:9:
xyzzy

---- library::tests::an_empty_library_suggests_nothing stdout ----

thread 'library::tests::an_empty_library_suggests_nothing' (1073559) panicked at crates/casm-parser/src/library.rs:704:9:
assertion failed: library.closest(&PatternRef::parse("p@1.0.0").unwrap()).is_none()

failures:
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::an_empty_library_suggests_nothing

test result: FAILED. 80 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
