*** crates/casm-parser/src/library.rs:56:5: replace default_version -> String with String::new()

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace default_version -> String with String::new()
@@ -48,17 +48,17 @@
 /// The most patterns a single library directory will load.
 ///
 /// Rule 5: a directory is attacker-controlled input in exactly the same way a file is.
 /// A thousand is far beyond any plausible hand-curated library.
 pub const MAX_LIBRARY_PATTERNS: usize = 1024;
 
 /// The default version when a pattern file omits one.
 fn default_version() -> String {
-    "0.1.0".to_owned()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A requirement as written by a human.
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(deny_unknown_fields, rename_all = "kebab-case")]
 pub struct RequirementDoc {
     /// The role's name, unique within the pattern.
     pub role: String,

---- library::tests::a_library_skips_files_that_are_not_architecture_formats stdout ----

thread 'library::tests::a_library_skips_files_that_are_not_architecture_formats' (2220515) panicked at crates/casm-parser/src/library.rs:689:46:
called `Result::unwrap()` on an `Err` value: Semantic { path: "/tmp/casm-library-019fd2ca-834a-7a12-9e00-08d3b753b11f/p.yaml", message: "pattern version '' is not valid semantic versioning: empty string, expected a semver version", suggestion: None }

---- library::tests::a_pattern_file_may_omit_its_version stdout ----

thread 'library::tests::a_pattern_file_may_omit_its_version' (2220519) panicked at crates/casm-parser/src/library.rs:529:69:
called `Result::unwrap()` on an `Err` value: Semantic { path: "secure-web-tier.yaml", message: "pattern version '' is not valid semantic versioning: empty string, expected a semver version", suggestion: None }

---- library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint stdout ----

thread 'library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint' (2220522) panicked at crates/casm-parser/src/library.rs:568:17:
pattern version '' is not valid semantic versioning: empty string, expected a semver version

failures:
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_pattern_file_may_omit_its_version
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint

test result: FAILED. 91 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
