*** crates/casm-parser/src/suggest.rs:100:41: replace match guard distance < best_distance with true in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace match guard distance < best_distance with true in closest
@@ -92,17 +92,17 @@
 
     let mut best: Option<(&'a str, usize)> = None;
     let mut tied = false;
 
     for candidate in candidates {
         let distance = edit_distance(input, candidate);
 
         match best {
-            Some((_, best_distance)) if distance < best_distance => {
+            Some((_, best_distance)) if true /* ~ changed by cargo-mutants ~ */ => {
                 best = Some((candidate, distance));
                 tied = false;
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }

---- suggest::tests::closest_accepts_an_exact_match stdout ----

thread 'suggest::tests::closest_accepts_an_exact_match' (1081221) panicked at crates/casm-parser/src/suggest.rs:217:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- suggest::tests::closest_declines_on_a_tie stdout ----

thread 'suggest::tests::closest_declines_on_a_tie' (1081222) panicked at crates/casm-parser/src/suggest.rs:197:9:
assertion `left == right` failed
  left: Some("abd")
 right: None

---- suggest::tests::closest_finds_an_obvious_typo stdout ----

thread 'suggest::tests::closest_finds_an_obvious_typo' (1081224) panicked at crates/casm-parser/src/suggest.rs:181:9:
assertion `left == right` failed
  left: None
 right: Some("orders-db")

failures:
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_declines_on_a_tie
    suggest::tests::closest_finds_an_obvious_typo
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 77 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
