*** crates/casm-parser/src/suggest.rs:100:50: replace < with == in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace < with == in closest
@@ -92,17 +92,17 @@
 
     let mut best: Option<(&'a str, usize)> = None;
     let mut tied = false;
 
     for candidate in candidates {
         let distance = edit_distance(input, candidate);
 
         match best {
-            Some((_, best_distance)) if distance < best_distance => {
+            Some((_, best_distance)) if distance == /* ~ changed by cargo-mutants ~ */ best_distance => {
                 best = Some((candidate, distance));
                 tied = false;
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (1083184) panicked at crates/casm-parser/src/document.rs:744:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

---- suggest::tests::closest_declines_on_a_tie stdout ----

thread 'suggest::tests::closest_declines_on_a_tie' (1083227) panicked at crates/casm-parser/src/suggest.rs:197:9:
assertion `left == right` failed
  left: Some("abd")
 right: None

failures:
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    suggest::tests::closest_declines_on_a_tie

test result: FAILED. 81 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
