*** crates/casm-parser/src/suggest.rs:100:50: replace < with > in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace < with > in closest
@@ -92,17 +92,17 @@
 
     let mut best: Option<(&'a str, usize)> = None;
     let mut tied = false;
 
     for candidate in candidates {
         let distance = edit_distance(input, candidate);
 
         match best {
-            Some((_, best_distance)) if distance < best_distance => {
+            Some((_, best_distance)) if distance > /* ~ changed by cargo-mutants ~ */ best_distance => {
                 best = Some((candidate, distance));
                 tied = false;
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (2245466) panicked at crates/casm-parser/src/document.rs:817:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

---- suggest::tests::closest_accepts_an_exact_match stdout ----

thread 'suggest::tests::closest_accepts_an_exact_match' (2245550) panicked at crates/casm-parser/src/suggest.rs:251:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- suggest::tests::closest_finds_an_obvious_typo stdout ----

thread 'suggest::tests::closest_finds_an_obvious_typo' (2245555) panicked at crates/casm-parser/src/suggest.rs:193:9:
assertion `left == right` failed
  left: None
 right: Some("orders-db")

failures:
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_finds_an_obvious_typo
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 88 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
