*** crates/casm-parser/src/suggest.rs:104:41: replace match guard distance == best_distance with true in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace match guard distance == best_distance with true in closest
@@ -96,17 +96,17 @@
     for candidate in candidates {
         let distance = edit_distance(input, candidate);
 
         match best {
             Some((_, best_distance)) if distance < best_distance => {
                 best = Some((candidate, distance));
                 tied = false;
             }
-            Some((_, best_distance)) if distance == best_distance => tied = true,
+            Some((_, best_distance)) if true /* ~ changed by cargo-mutants ~ */ => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }
 
     match best {
         Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
             Some(candidate)

---- suggest::tests::closest_accepts_an_exact_match stdout ----

thread 'suggest::tests::closest_accepts_an_exact_match' (2243992) panicked at crates/casm-parser/src/suggest.rs:251:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- suggest::tests::closest_finds_an_obvious_typo stdout ----

thread 'suggest::tests::closest_finds_an_obvious_typo' (2243995) panicked at crates/casm-parser/src/suggest.rs:193:9:
assertion `left == right` failed
  left: None
 right: Some("orders-db")

---- tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node stdout ----

thread 'tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node' (2244011) panicked at crates/casm-parser/src/lib.rs:467:9:
assertion `left == right` failed: rendered: architecture.yaml: relationship target 'orders-bd' does not match any declared node
  left: None
 right: Some("did you mean `orders-db`?")

failures:
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_finds_an_obvious_typo
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 89 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
