*** crates/casm-parser/src/suggest.rs:104:41: replace match guard distance == best_distance with false in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace match guard distance == best_distance with false in closest
@@ -96,17 +96,17 @@
     for candidate in candidates {
         let distance = edit_distance(input, candidate);
 
         match best {
             Some((_, best_distance)) if distance < best_distance => {
                 best = Some((candidate, distance));
                 tied = false;
             }
-            Some((_, best_distance)) if distance == best_distance => tied = true,
+            Some((_, best_distance)) if false /* ~ changed by cargo-mutants ~ */ => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }
 
     match best {
         Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
             Some(candidate)

---- suggest::tests::closest_declines_on_a_tie stdout ----

thread 'suggest::tests::closest_declines_on_a_tie' (1083132) panicked at crates/casm-parser/src/suggest.rs:197:9:
assertion `left == right` failed
  left: Some("abc")
 right: None

failures:
    suggest::tests::closest_declines_on_a_tie

test result: FAILED. 82 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
