*** crates/casm-parser/src/suggest.rs:111:40: replace match guard distance <= MAX_PLAUSIBLE_DISTANCE && !tied with true in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace match guard distance <= MAX_PLAUSIBLE_DISTANCE && !tied with true in closest
@@ -103,17 +103,17 @@
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }
 
     match best {
-        Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
+        Some((candidate, distance)) if true /* ~ changed by cargo-mutants ~ */ => {
             Some(candidate)
         }
         _ => None,
     }
 }
 
 /// Formats a "did you mean" hint for a misspelled reference.
 #[must_use]

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (2247806) panicked at crates/casm-parser/src/document.rs:829:67:
assertion `left == right` failed
  left: Some("did you mean `orders-db`?")
 right: None

---- suggest::tests::closest_declines_when_nothing_is_near stdout ----

thread 'suggest::tests::closest_declines_when_nothing_is_near' (2247856) panicked at crates/casm-parser/src/suggest.rs:221:9:
assertion `left == right` failed: a wrong hint is worse than none
  left: Some("orders-db")
 right: None

---- suggest::tests::closest_declines_on_a_tie stdout ----

thread 'suggest::tests::closest_declines_on_a_tie' (2247855) panicked at crates/casm-parser/src/suggest.rs:231:9:
assertion `left == right` failed
  left: Some("abc")
 right: None

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    suggest::tests::closest_declines_on_a_tie
    suggest::tests::closest_declines_when_nothing_is_near
    tests::suggestion_inference_declines_when_nothing_is_near

test result: FAILED. 90 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
