*** crates/casm-parser/src/suggest.rs:111:40: replace match guard distance <= MAX_PLAUSIBLE_DISTANCE && !tied with false in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace match guard distance <= MAX_PLAUSIBLE_DISTANCE && !tied with false in closest
@@ -103,17 +103,17 @@
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }
 
     match best {
-        Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
+        Some((candidate, distance)) if false /* ~ changed by cargo-mutants ~ */ => {
             Some(candidate)
         }
         _ => None,
     }
 }
 
 /// Formats a "did you mean" hint for a misspelled reference.
 #[must_use]

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (1085203) panicked at crates/casm-parser/src/document.rs:744:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (1085235) panicked at crates/casm-parser/src/library.rs:709:14:
called `Option::unwrap()` on a `None` value

---- library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint stdout ----

thread 'library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint' (1085240) panicked at crates/casm-parser/src/library.rs:569:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `application`?")

failures:
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_finds_an_obvious_typo
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 75 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
