*** crates/casm-parser/src/suggest.rs:111:49: replace <= with > in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace <= with > in closest
@@ -103,17 +103,17 @@
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }
 
     match best {
-        Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
+        Some((candidate, distance)) if distance > /* ~ changed by cargo-mutants ~ */ MAX_PLAUSIBLE_DISTANCE && !tied => {
             Some(candidate)
         }
         _ => None,
     }
 }
 
 /// Formats a "did you mean" hint for a misspelled reference.
 #[must_use]

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (2249234) panicked at crates/casm-parser/src/document.rs:817:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (2249233) panicked at crates/casm-parser/src/document.rs:829:67:
assertion `left == right` failed
  left: Some("did you mean `orders-db`?")
 right: None

---- library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint stdout ----

thread 'library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint' (2249275) panicked at crates/casm-parser/src/library.rs:569:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `application`?")

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_finds_an_obvious_typo
    suggest::tests::the_suggestion_threshold_is_a_strict_comparison
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 84 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
