*** crates/casm-parser/src/suggest.rs:30:5: replace edit_distance -> usize with 0

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace edit_distance -> usize with 0
@@ -22,62 +22,17 @@
 pub const MAX_PLAUSIBLE_DISTANCE: usize = 3;
 
 /// Computes the Levenshtein edit distance between two strings.
 ///
 /// Comparison is case-insensitive on ASCII, because `Service` versus `service` is a
 /// capitalisation slip rather than a different word.
 #[must_use]
 pub fn edit_distance(left: &str, right: &str) -> usize {
-    let left: Vec<char> = left.chars().flat_map(char::to_lowercase).collect();
-    let right: Vec<char> = right.chars().flat_map(char::to_lowercase).collect();
-
-    if left.is_empty() {
-        return right.len();
-    }
-    if right.is_empty() {
-        return left.len();
-    }
-
-    // Two rolling rows rather than a full (n+1)×(m+1) matrix.
-    let mut previous: Vec<usize> = (0..=right.len()).collect();
-    let mut current: Vec<usize> = vec![0; right.len() + 1];
-
-    for (i, left_char) in left.iter().enumerate() {
-        if let Some(slot) = current.first_mut() {
-            *slot = i + 1;
-        }
-
-        for (j, right_char) in right.iter().enumerate() {
-            let substitution_cost = usize::from(left_char != right_char);
-            let deletion = previous
-                .get(j + 1)
-                .copied()
-                .unwrap_or(usize::MAX)
-                .saturating_add(1);
-            let insertion = current
-                .get(j)
-                .copied()
-                .unwrap_or(usize::MAX)
-                .saturating_add(1);
-            let substitution = previous
-                .get(j)
-                .copied()
-                .unwrap_or(usize::MAX)
-                .saturating_add(substitution_cost);
-
-            if let Some(slot) = current.get_mut(j + 1) {
-                *slot = deletion.min(insertion).min(substitution);
-            }
-        }
-
-        core::mem::swap(&mut previous, &mut current);
-    }
-
-    previous.last().copied().unwrap_or(0)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns the candidate closest to `input`, if any is close enough to be worth saying.
 ///
 /// Returns `None` when the nearest candidate is further than
 /// [`MAX_PLAUSIBLE_DISTANCE`], or when two candidates tie — an ambiguous suggestion
 /// misleads more than it helps.
 #[must_use]

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (1073936) panicked at crates/casm-parser/src/document.rs:744:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

---- suggest::tests::closest_accepts_an_exact_match stdout ----

thread 'suggest::tests::closest_accepts_an_exact_match' (1073979) panicked at crates/casm-parser/src/suggest.rs:172:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- suggest::tests::closest_finds_an_obvious_typo stdout ----

thread 'suggest::tests::closest_finds_an_obvious_typo' (1073982) panicked at crates/casm-parser/src/suggest.rs:136:9:
assertion `left == right` failed
  left: None
 right: Some("orders-db")

failures:
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_finds_an_obvious_typo
    suggest::tests::distance_counts_single_edits
    suggest::tests::distance_handles_empty_strings
    suggest::tests::distance_handles_multibyte_characters_without_panicking
    suggest::tests::distance_is_symmetric
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 73 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
