*** crates/casm-parser/src/suggest.rs:46:23: replace + with * in edit_distance

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace + with * in edit_distance
@@ -38,17 +38,17 @@
     }
 
     // Two rolling rows rather than a full (n+1)×(m+1) matrix.
     let mut previous: Vec<usize> = (0..=right.len()).collect();
     let mut current: Vec<usize> = vec![0; right.len() + 1];
 
     for (i, left_char) in left.iter().enumerate() {
         if let Some(slot) = current.first_mut() {
-            *slot = i + 1;
+            *slot = i * /* ~ changed by cargo-mutants ~ */ 1;
         }
 
         for (j, right_char) in right.iter().enumerate() {
             let substitution_cost = usize::from(left_char != right_char);
             let deletion = previous
                 .get(j + 1)
                 .copied()
                 .unwrap_or(usize::MAX)

*** result: Success
