*** crates/casm-parser/src/suggest.rs:50:59: replace != with == in edit_distance

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace != with == in edit_distance
@@ -42,17 +42,17 @@
     let mut current: Vec<usize> = vec![0; right.len() + 1];
 
     for (i, left_char) in left.iter().enumerate() {
         if let Some(slot) = current.first_mut() {
             *slot = i + 1;
         }
 
         for (j, right_char) in right.iter().enumerate() {
-            let substitution_cost = usize::from(left_char != right_char);
+            let substitution_cost = usize::from(left_char == /* ~ changed by cargo-mutants ~ */ right_char);
             let deletion = previous
                 .get(j + 1)
                 .copied()
                 .unwrap_or(usize::MAX)
                 .saturating_add(1);
             let insertion = current
                 .get(j)
                 .copied()

---- suggest::tests::closest_declines_when_nothing_is_near stdout ----

thread 'suggest::tests::closest_declines_when_nothing_is_near' (1075887) panicked at crates/casm-parser/src/suggest.rs:187:9:
assertion `left == right` failed: a wrong hint is worse than none
  left: Some("orders-db")
 right: None

---- suggest::tests::distance_counts_single_edits stdout ----

thread 'suggest::tests::distance_counts_single_edits' (1075891) panicked at crates/casm-parser/src/suggest.rs:146:9:
assertion `left == right` failed: one insertion
  left: 2
 right: 1

---- suggest::tests::distance_is_case_insensitive stdout ----

thread 'suggest::tests::distance_is_case_insensitive' (1075894) panicked at crates/casm-parser/src/suggest.rs:141:9:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    suggest::tests::closest_declines_when_nothing_is_near
    suggest::tests::closest_finds_an_obvious_typo
    suggest::tests::distance_counts_single_edits
    suggest::tests::distance_handles_multibyte_characters_without_panicking
    suggest::tests::distance_is_case_insensitive
    suggest::tests::distance_is_symmetric
    suggest::tests::distance_is_zero_for_identical_strings
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one
    tests::suggestion_inference_declines_when_nothing_is_near

test result: FAILED. 73 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
