*** crates/casm-parser/src/suggest.rs:52:24: replace + with * in edit_distance

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace + with * in edit_distance
@@ -44,17 +44,17 @@
     for (i, left_char) in left.iter().enumerate() {
         if let Some(slot) = current.first_mut() {
             *slot = i + 1;
         }
 
         for (j, right_char) in right.iter().enumerate() {
             let substitution_cost = usize::from(left_char != right_char);
             let deletion = previous
-                .get(j + 1)
+                .get(j * /* ~ changed by cargo-mutants ~ */ 1)
                 .copied()
                 .unwrap_or(usize::MAX)
                 .saturating_add(1);
             let insertion = current
                 .get(j)
                 .copied()
                 .unwrap_or(usize::MAX)
                 .saturating_add(1);

---- suggest::tests::distance_is_symmetric stdout ----

thread 'suggest::tests::distance_is_symmetric' (2238808) panicked at crates/casm-parser/src/suggest.rs:172:9:
assertion `left == right` failed
  left: 3
 right: 6

---- suggest::tests::distance_counts_single_edits stdout ----

thread 'suggest::tests::distance_counts_single_edits' (2238804) panicked at crates/casm-parser/src/suggest.rs:147:9:
assertion `left == right` failed: one deletion
  left: 8
 right: 1

---- suggest::tests::distance_accumulates_edits_rather_than_multiplying_them stdout ----

thread 'suggest::tests::distance_accumulates_edits_rather_than_multiplying_them' (2238803) panicked at crates/casm-parser/src/suggest.rs:163:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    suggest::tests::distance_accumulates_edits_rather_than_multiplying_them
    suggest::tests::distance_counts_single_edits
    suggest::tests::distance_is_symmetric

test result: FAILED. 91 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
