*** crates/casm-parser/src/suggest.rs:67:51: replace + with - in edit_distance

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace + with - in edit_distance
@@ -59,17 +59,17 @@
                 .unwrap_or(usize::MAX)
                 .saturating_add(1);
             let substitution = previous
                 .get(j)
                 .copied()
                 .unwrap_or(usize::MAX)
                 .saturating_add(substitution_cost);
 
-            if let Some(slot) = current.get_mut(j + 1) {
+            if let Some(slot) = current.get_mut(j - /* ~ changed by cargo-mutants ~ */ 1) {
                 *slot = deletion.min(insertion).min(substitution);
             }
         }
 
         core::mem::swap(&mut previous, &mut current);
     }
 
     previous.last().copied().unwrap_or(0)

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (1077191) panicked at crates/casm-parser/src/suggest.rs:67:49:
attempt to subtract with overflow

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (1077187) panicked at crates/casm-parser/src/suggest.rs:67:49:
attempt to subtract with overflow

---- library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint stdout ----

thread 'library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint' (1077266) panicked at crates/casm-parser/src/suggest.rs:67:49:
attempt to subtract with overflow

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    library::tests::an_unknown_field_is_rejected_rather_than_silently_ignored
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_declines_on_a_tie
    suggest::tests::closest_declines_when_nothing_is_near
    suggest::tests::closest_finds_an_obvious_typo
    suggest::tests::distance_counts_single_edits
    suggest::tests::distance_handles_multibyte_characters_without_panicking
    suggest::tests::distance_is_case_insensitive

test result: FAILED. 64 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
