*** crates/casm-parser/src/suggest.rs:67:51: replace + with * in edit_distance

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace + with * in edit_distance
@@ -59,17 +59,17 @@
                 .unwrap_or(usize::MAX)
                 .saturating_add(1);
             let substitution = previous
                 .get(j)
                 .copied()
                 .unwrap_or(usize::MAX)
                 .saturating_add(substitution_cost);
 
-            if let Some(slot) = current.get_mut(j + 1) {
+            if let Some(slot) = current.get_mut(j * /* ~ changed by cargo-mutants ~ */ 1) {
                 *slot = deletion.min(insertion).min(substitution);
             }
         }
 
         core::mem::swap(&mut previous, &mut current);
     }
 
     previous.last().copied().unwrap_or(0)

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (1077668) panicked at crates/casm-parser/src/document.rs:744:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (1077667) panicked at crates/casm-parser/src/document.rs:756:67:
assertion `left == right` failed
  left: Some("did you mean `api`?")
 right: None

---- library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint stdout ----

thread 'library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint' (1077705) panicked at crates/casm-parser/src/library.rs:569:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `application`?")

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_finds_an_obvious_typo
    suggest::tests::distance_counts_single_edits
    suggest::tests::distance_handles_multibyte_characters_without_panicking
    suggest::tests::distance_is_symmetric
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 72 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
