*** crates/casm-parser/src/suggest.rs:89:20: replace > with >= in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace > with >= in closest
@@ -81,17 +81,17 @@
 /// [`MAX_PLAUSIBLE_DISTANCE`], or when two candidates tie — an ambiguous suggestion
 /// misleads more than it helps.
 #[must_use]
 pub fn closest<'a, I>(input: &str, candidates: I) -> Option<&'a str>
 where
     I: IntoIterator<Item = &'a str>,
 {
     // Rule 4: bound the work regardless of what the document contains.
-    if input.len() > MAX_NAME_LEN {
+    if input.len() >= /* ~ changed by cargo-mutants ~ */ MAX_NAME_LEN {
         return None;
     }
 
     let mut best: Option<(&'a str, usize)> = None;
     let mut tied = false;
 
     for candidate in candidates {
         let distance = edit_distance(input, candidate);

*** result: Success
