*** crates/casm-parser/src/suggest.rs:89:5: replace closest -> Option<&'a str> with None

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace closest -> Option<&'a str> with None
@@ -81,43 +81,17 @@
 /// [`MAX_PLAUSIBLE_DISTANCE`], or when two candidates tie — an ambiguous suggestion
 /// misleads more than it helps.
 #[must_use]
 pub fn closest<'a, I>(input: &str, candidates: I) -> Option<&'a str>
 where
     I: IntoIterator<Item = &'a str>,
 {
     // Rule 4: bound the work regardless of what the document contains.
-    if input.len() > MAX_NAME_LEN {
-        return None;
-    }
-
-    let mut best: Option<(&'a str, usize)> = None;
-    let mut tied = false;
-
-    for candidate in candidates {
-        let distance = edit_distance(input, candidate);
-
-        match best {
-            Some((_, best_distance)) if distance < best_distance => {
-                best = Some((candidate, distance));
-                tied = false;
-            }
-            Some((_, best_distance)) if distance == best_distance => tied = true,
-            Some(_) => {}
-            None => best = Some((candidate, distance)),
-        }
-    }
-
-    match best {
-        Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
-            Some(candidate)
-        }
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Formats a "did you mean" hint for a misspelled reference.
 #[must_use]
 pub fn did_you_mean(candidate: &str) -> String {
     format!("did you mean `{candidate}`?")
 }

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (1078847) panicked at crates/casm-parser/src/document.rs:744:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (1078880) panicked at crates/casm-parser/src/library.rs:709:14:
called `Option::unwrap()` on a `None` value

---- suggest::tests::closest_accepts_an_exact_match stdout ----

thread 'suggest::tests::closest_accepts_an_exact_match' (1078890) panicked at crates/casm-parser/src/suggest.rs:191:9:
assertion `left == right` failed
  left: None
 right: Some("api")

failures:
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_finds_an_obvious_typo
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 75 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
