*** crates/casm-renderer/src/lib.rs:104:5: replace escape_label -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace escape_label -> String with "xyzzy".into()
@@ -96,24 +96,17 @@
 }
 
 /// Escapes a free-form label for embedding in a quoted diagram string.
 ///
 /// Node *names* never need this — the CASIMIR name alphabet has no metacharacters — but
 /// descriptions are arbitrary text supplied by the author.
 #[must_use]
 pub fn escape_label(raw: &str) -> String {
-    raw.chars()
-        .map(|c| match c {
-            '"' => "'".to_owned(),
-            '\n' | '\r' => " ".to_owned(),
-            '\\' => "/".to_owned(),
-            other => other.to_string(),
-        })
-        .collect()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The Mermaid backend: flowcharts that render natively in GitHub and most wikis.
 pub struct Mermaid;
 
 impl Mermaid {
     /// Maps a node type onto a Mermaid node shape, given a label.
     fn shape(node_type: NodeType, label: &str) -> String {

---- tests::escaping_neutralises_quotes_newlines_and_backslashes stdout ----

thread 'tests::escaping_neutralises_quotes_newlines_and_backslashes' (1090471) panicked at crates/casm-renderer/src/lib.rs:598:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "say 'hi'"

---- tests::mermaid_labels_edges_with_protocol_and_budget stdout ----

thread 'tests::mermaid_labels_edges_with_protocol_and_budget' (1090477) panicked at crates/casm-renderer/src/lib.rs:516:9:
flowchart LR
  %% storefront v1.2.0
  n0{{"gateway"}}
  n1["orders"]
  n2[("orders-db")]
  n0 -->|"xyzzy"| n1
  n1 -->|"xyzzy"| n2

failures:
    tests::escaping_neutralises_quotes_newlines_and_backslashes
    tests::mermaid_labels_edges_with_protocol_and_budget

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
