*** crates/casm-renderer/src/lib.rs:120:9: replace Mermaid::shape -> String with String::new()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace Mermaid::shape -> String with String::new()
@@ -112,26 +112,17 @@
 }
 
 /// The Mermaid backend: flowcharts that render natively in GitHub and most wikis.
 pub struct Mermaid;
 
 impl Mermaid {
     /// Maps a node type onto a Mermaid node shape, given a label.
     fn shape(node_type: NodeType, label: &str) -> String {
-        match node_type {
-            NodeType::Database | NodeType::Storage => format!("[(\"{label}\")]"),
-            NodeType::Queue => format!("[[\"{label}\"]]"),
-            NodeType::Cache => format!("[/\"{label}\"/]"),
-            NodeType::Gateway => format!("{{{{\"{label}\"}}}}"),
-            NodeType::ExternalSystem => format!("([\"{label}\"])"),
-            NodeType::Human => format!("((\"{label}\"))"),
-            NodeType::Boundary => format!("{{\"{label}\"}}"),
-            NodeType::Service | NodeType::Legacy => format!("[\"{label}\"]"),
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Maps a relationship type onto a Mermaid arrow.
     fn arrow(relationship_type: RelationshipType) -> &'static str {
         match relationship_type {
             RelationshipType::Sync | RelationshipType::DependsOn => "-->",
             RelationshipType::Async | RelationshipType::EventDriven => "-.->",
             RelationshipType::Composed => "---",

---- tests::mermaid_shapes_distinguish_node_types stdout ----

thread 'tests::mermaid_shapes_distinguish_node_types' (1090589) panicked at crates/casm-renderer/src/lib.rs:497:9:
gateway is a hexagon: flowchart LR
  %% storefront v1.2.0
  n0
  n1
  n2
  n0 -->|"sync / grpc / 100ms"| n1
  n1 -->|"sync / grpc / 50ms"| n2

failures:
    tests::mermaid_shapes_distinguish_node_types

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
