*** crates/casm-renderer/src/lib.rs:134:9: replace Mermaid::arrow -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace Mermaid::arrow -> &'static str with ""
@@ -126,23 +126,17 @@
             NodeType::Human => format!("((\"{label}\"))"),
             NodeType::Boundary => format!("{{\"{label}\"}}"),
             NodeType::Service | NodeType::Legacy => format!("[\"{label}\"]"),
         }
     }
 
     /// Maps a relationship type onto a Mermaid arrow.
     fn arrow(relationship_type: RelationshipType) -> &'static str {
-        match relationship_type {
-            RelationshipType::Sync | RelationshipType::DependsOn => "-->",
-            RelationshipType::Async | RelationshipType::EventDriven => "-.->",
-            RelationshipType::Composed => "---",
-            RelationshipType::DeployedOn => "-.-",
-            RelationshipType::QuantumEntangled => "==>",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Builds the edge label: protocol and budget, whichever are declared.
     fn edge_label(relationship: &Relationship) -> String {
         let mut parts = vec![relationship.relationship_type().to_string()];
         if let Some(protocol) = relationship.protocol() {
             parts.push(protocol.to_string());
         }

---- tests::mermaid_arrows_distinguish_blocking_from_async stdout ----

thread 'tests::mermaid_arrows_distinguish_blocking_from_async' (1091267) panicked at crates/casm-renderer/src/lib.rs:549:9:
async edges are dashed

failures:
    tests::mermaid_arrows_distinguish_blocking_from_async

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
