*** crates/casm-renderer/src/lib.rs:145:9: replace Mermaid::edge_label -> String with String::new()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace Mermaid::edge_label -> String with String::new()
@@ -137,24 +137,17 @@
             RelationshipType::Composed => "---",
             RelationshipType::DeployedOn => "-.-",
             RelationshipType::QuantumEntangled => "==>",
         }
     }
 
     /// Builds the edge label: protocol and budget, whichever are declared.
     fn edge_label(relationship: &Relationship) -> String {
-        let mut parts = vec![relationship.relationship_type().to_string()];
-        if let Some(protocol) = relationship.protocol() {
-            parts.push(protocol.to_string());
-        }
-        if let Some(budget) = relationship.latency_budget_ms() {
-            parts.push(format!("{budget}ms"));
-        }
-        parts.join(" / ")
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Renderer for Mermaid {
     fn id(&self) -> &'static str {
         "mermaid"
     }

---- tests::ascii_lists_nodes_interfaces_controls_and_edges stdout ----

thread 'tests::ascii_lists_nodes_interfaces_controls_and_edges' (1091280) panicked at crates/casm-renderer/src/lib.rs:583:9:
storefront v1.2.0
=================
Order capture

[gateway] gateway
    Public entry point
    ----> orders

[service] orders
    :: grpc (grpc v1.0.0)
    # AUTH [security]

---- tests::mermaid_labels_edges_with_protocol_and_budget stdout ----

thread 'tests::mermaid_labels_edges_with_protocol_and_budget' (1091294) panicked at crates/casm-renderer/src/lib.rs:516:9:
flowchart LR
  %% storefront v1.2.0
  n0{{"gateway"}}
  n1["orders"]
  n2[("orders-db")]
  n0 -->|""| n1
  n1 -->|""| n2

failures:
    tests::ascii_lists_nodes_interfaces_controls_and_edges
    tests::mermaid_labels_edges_with_protocol_and_budget

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
