*** crates/casm-renderer/src/lib.rs:158:9: replace <impl Renderer for Mermaid>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Mermaid>::id -> &'static str with ""
@@ -150,17 +150,17 @@
             parts.push(format!("{budget}ms"));
         }
         parts.join(" / ")
     }
 }
 
 impl Renderer for Mermaid {
     fn id(&self) -> &'static str {
-        "mermaid"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn extension(&self) -> &'static str {
         "mmd"
     }
 
     fn render(&self, architecture: &Architecture) -> String {
         let ids = diagram_ids(architecture);

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1091936) panicked at crates/casm-renderer/src/lib.rs:463:9:
assertion `left == right` failed
  left: None
 right: Some("mmd")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
