*** crates/casm-renderer/src/lib.rs:162:9: replace <impl Renderer for Mermaid>::extension -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Mermaid>::extension -> &'static str with ""
@@ -154,17 +154,17 @@
 }
 
 impl Renderer for Mermaid {
     fn id(&self) -> &'static str {
         "mermaid"
     }
 
     fn extension(&self) -> &'static str {
-        "mmd"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn render(&self, architecture: &Architecture) -> String {
         let ids = diagram_ids(architecture);
         let mut out = String::from("flowchart LR\n");
 
         // Writing to a `String` cannot fail; the `Result` is discarded deliberately
         // rather than unwrapped, per NASA Rule 3.

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1091961) panicked at crates/casm-renderer/src/lib.rs:463:9:
assertion `left == right` failed
  left: Some("")
 right: Some("mmd")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
