*** crates/casm-renderer/src/lib.rs:166:9: replace <impl Renderer for Mermaid>::render -> String with String::new()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Mermaid>::render -> String with String::new()
@@ -158,43 +158,17 @@
         "mermaid"
     }
 
     fn extension(&self) -> &'static str {
         "mmd"
     }
 
     fn render(&self, architecture: &Architecture) -> String {
-        let ids = diagram_ids(architecture);
-        let mut out = String::from("flowchart LR\n");
-
-        // Writing to a `String` cannot fail; the `Result` is discarded deliberately
-        // rather than unwrapped, per NASA Rule 3.
-        let _ = writeln!(
-            out,
-            "  %% {} v{}",
-            architecture.name(),
-            architecture.version()
-        );
-
-        for node in architecture.nodes() {
-            let id = diagram_id(&ids, node.id());
-            let shape = Self::shape(node.node_type(), node.name().as_str());
-            let _ = writeln!(out, "  {id}{shape}");
-        }
-
-        for edge in architecture.relationships() {
-            let source = diagram_id(&ids, edge.source());
-            let target = diagram_id(&ids, edge.target());
-            let arrow = Self::arrow(edge.relationship_type());
-            let label = escape_label(&Self::edge_label(edge));
-            let _ = writeln!(out, "  {source} {arrow}|\"{label}\"| {target}");
-        }
-
-        out
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The Graphviz DOT backend: for complex layouts and downstream tooling.
 pub struct Dot;
 
 impl Dot {
     /// Maps a node type onto a Graphviz shape.

---- tests::diagram_identifiers_are_positional_not_uuid_derived stdout ----

thread 'tests::diagram_identifiers_are_positional_not_uuid_derived' (1092720) panicked at crates/casm-renderer/src/lib.rs:459:9:

---- tests::every_backend_handles_an_empty_architecture stdout ----

thread 'tests::every_backend_handles_an_empty_architecture' (1092725) panicked at crates/casm-renderer/src/lib.rs:418:13:
mermaid produced nothing

---- tests::mermaid_arrows_distinguish_blocking_from_async stdout ----

thread 'tests::mermaid_arrows_distinguish_blocking_from_async' (1092728) panicked at crates/casm-renderer/src/lib.rs:529:9:
async edges are dashed

failures:
    tests::diagram_identifiers_are_positional_not_uuid_derived
    tests::every_backend_handles_an_empty_architecture
    tests::every_backend_output_ends_with_a_newline
    tests::mermaid_arrows_distinguish_blocking_from_async
    tests::mermaid_declares_a_flowchart_and_the_architecture_version
    tests::mermaid_labels_edges_with_protocol_and_budget
    tests::mermaid_shapes_distinguish_node_types
    tests::rendering_covers_every_relationship_type
    tests::rendering_never_panics_on_an_architecture_with_every_node_type

test result: FAILED. 10 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
