*** crates/casm-renderer/src/lib.rs:202:9: replace Dot::shape -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace Dot::shape -> &'static str with "xyzzy"
@@ -194,27 +194,17 @@
 }
 
 /// The Graphviz DOT backend: for complex layouts and downstream tooling.
 pub struct Dot;
 
 impl Dot {
     /// Maps a node type onto a Graphviz shape.
     fn shape(node_type: NodeType) -> &'static str {
-        match node_type {
-            NodeType::Database | NodeType::Storage => "cylinder",
-            NodeType::Queue => "box3d",
-            NodeType::Cache => "parallelogram",
-            NodeType::Gateway => "hexagon",
-            NodeType::ExternalSystem => "ellipse",
-            NodeType::Human => "circle",
-            NodeType::Boundary => "diamond",
-            NodeType::Legacy => "note",
-            NodeType::Service => "box",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Maps a relationship type onto a Graphviz edge style.
     ///
     /// Graphviz offers fewer distinct line styles than CASIMIR has relationship types,
     /// so `composed` and `quantum-entangled` share `bold`. They remain distinguishable
     /// by the edge label, which always carries the exact type.
     fn style(relationship_type: RelationshipType) -> &'static str {

---- tests::dot_shapes_distinguish_node_types stdout ----

thread 'tests::dot_shapes_distinguish_node_types' (1093107) panicked at crates/casm-renderer/src/lib.rs:562:9:
digraph "storefront" {
  rankdir=LR;
  node [fontname="Helvetica"];
  edge [fontname="Helvetica", fontsize=10];
  n0 [label="gateway", shape=xyzzy];
  n1 [label="orders", shape=xyzzy];
  n2 [label="orders-db", shape=xyzzy];
  n0 -> n1 [label="sync / grpc / 100ms", style=solid];
  n1 -> n2 [label="sync / grpc / 50ms", style=solid];
}

failures:
    tests::dot_shapes_distinguish_node_types

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
