*** crates/casm-renderer/src/lib.rs:221:9: replace Dot::style -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace Dot::style -> &'static str with ""
@@ -213,22 +213,17 @@
     }
 
     /// Maps a relationship type onto a Graphviz edge style.
     ///
     /// Graphviz offers fewer distinct line styles than CASIMIR has relationship types,
     /// so `composed` and `quantum-entangled` share `bold`. They remain distinguishable
     /// by the edge label, which always carries the exact type.
     fn style(relationship_type: RelationshipType) -> &'static str {
-        match relationship_type {
-            RelationshipType::Sync | RelationshipType::DependsOn => "solid",
-            RelationshipType::Async | RelationshipType::EventDriven => "dashed",
-            RelationshipType::Composed | RelationshipType::QuantumEntangled => "bold",
-            RelationshipType::DeployedOn => "dotted",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Renderer for Dot {
     fn id(&self) -> &'static str {
         "dot"
     }

---- tests::dot_styles_distinguish_relationship_types stdout ----

thread 'tests::dot_styles_distinguish_relationship_types' (1093587) panicked at crates/casm-renderer/src/lib.rs:575:9:
digraph "storefront" {
  rankdir=LR;
  node [fontname="Helvetica"];
  edge [fontname="Helvetica", fontsize=10];
  n0 [label="gateway", shape=hexagon];
  n1 [label="orders", shape=box];
  n2 [label="orders-db", shape=cylinder];
  n0 -> n1 [label="sync / grpc / 100ms", style=];
  n1 -> n2 [label="sync / grpc / 50ms", style=];
}

failures:
    tests::dot_styles_distinguish_relationship_types

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
