*** crates/casm-renderer/src/lib.rs:232:9: replace <impl Renderer for Dot>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Dot>::id -> &'static str with ""
@@ -224,17 +224,17 @@
             RelationshipType::Composed | RelationshipType::QuantumEntangled => "bold",
             RelationshipType::DeployedOn => "dotted",
         }
     }
 }
 
 impl Renderer for Dot {
     fn id(&self) -> &'static str {
-        "dot"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn extension(&self) -> &'static str {
         "dot"
     }
 
     fn render(&self, architecture: &Architecture) -> String {
         let ids = diagram_ids(architecture);

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1093543) panicked at crates/casm-renderer/src/lib.rs:464:9:
assertion `left == right` failed
  left: None
 right: Some("dot")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
