*** crates/casm-renderer/src/lib.rs:236:9: replace <impl Renderer for Dot>::extension -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Dot>::extension -> &'static str with ""
@@ -228,17 +228,17 @@
 }
 
 impl Renderer for Dot {
     fn id(&self) -> &'static str {
         "dot"
     }
 
     fn extension(&self) -> &'static str {
-        "dot"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn render(&self, architecture: &Architecture) -> String {
         let ids = diagram_ids(architecture);
         let mut out = format!("digraph \"{}\" {{\n", architecture.name());
 
         out.push_str("  rankdir=LR;\n");
         out.push_str("  node [fontname=\"Helvetica\"];\n");

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1094312) panicked at crates/casm-renderer/src/lib.rs:464:9:
assertion `left == right` failed
  left: Some("")
 right: Some("dot")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
