*** crates/casm-renderer/src/lib.rs:240:9: replace <impl Renderer for Dot>::render -> String with String::new()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Dot>::render -> String with String::new()
@@ -232,46 +232,17 @@
         "dot"
     }
 
     fn extension(&self) -> &'static str {
         "dot"
     }
 
     fn render(&self, architecture: &Architecture) -> String {
-        let ids = diagram_ids(architecture);
-        let mut out = format!("digraph \"{}\" {{\n", architecture.name());
-
-        out.push_str("  rankdir=LR;\n");
-        out.push_str("  node [fontname=\"Helvetica\"];\n");
-        out.push_str("  edge [fontname=\"Helvetica\", fontsize=10];\n");
-
-        for node in architecture.nodes() {
-            let id = diagram_id(&ids, node.id());
-            let _ = writeln!(
-                out,
-                "  {id} [label=\"{}\", shape={}];",
-                node.name(),
-                Self::shape(node.node_type())
-            );
-        }
-
-        for edge in architecture.relationships() {
-            let source = diagram_id(&ids, edge.source());
-            let target = diagram_id(&ids, edge.target());
-            let label = escape_label(&Mermaid::edge_label(edge));
-            let _ = writeln!(
-                out,
-                "  {source} -> {target} [label=\"{label}\", style={}];",
-                Self::style(edge.relationship_type())
-            );
-        }
-
-        out.push_str("}\n");
-        out
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The ASCII backend: readable in a CI log, a terminal, or a commit message.
 pub struct Ascii;
 
 impl Ascii {
     /// Renders the header block.

---- tests::dot_produces_a_balanced_digraph stdout ----

thread 'tests::dot_produces_a_balanced_digraph' (1094284) panicked at crates/casm-renderer/src/lib.rs:535:9:
assertion failed: output.starts_with("digraph \"storefront\" {\n")

---- tests::dot_shapes_distinguish_node_types stdout ----

thread 'tests::dot_shapes_distinguish_node_types' (1094285) panicked at crates/casm-renderer/src/lib.rs:543:9:

---- tests::dot_styles_distinguish_relationship_types stdout ----

thread 'tests::dot_styles_distinguish_relationship_types' (1094286) panicked at crates/casm-renderer/src/lib.rs:551:9:

failures:
    tests::dot_produces_a_balanced_digraph
    tests::dot_shapes_distinguish_node_types
    tests::dot_styles_distinguish_relationship_types
    tests::every_backend_handles_an_empty_architecture
    tests::every_backend_output_ends_with_a_newline
    tests::rendering_covers_every_relationship_type
    tests::rendering_never_panics_on_an_architecture_with_every_node_type

test result: FAILED. 12 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
