*** crates/casm-renderer/src/lib.rs:279:9: replace Ascii::header -> String with String::new()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace Ascii::header -> String with String::new()
@@ -271,25 +271,17 @@
 }
 
 /// The ASCII backend: readable in a CI log, a terminal, or a commit message.
 pub struct Ascii;
 
 impl Ascii {
     /// Renders the header block.
     fn header(architecture: &Architecture) -> String {
-        let title = format!("{} v{}", architecture.name(), architecture.version());
-        let rule = "=".repeat(title.len());
-        let mut out = format!("{title}\n{rule}\n");
-
-        if let Some(description) = architecture.description() {
-            let _ = writeln!(out, "{description}");
-        }
-        out.push('\n');
-        out
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders one node and its outgoing edges.
     fn node_block(architecture: &Architecture, node: &Node) -> String {
         let mut out = format!("[{}] {}\n", node.node_type(), node.name());
 
         if let Some(description) = node.description() {
             let _ = writeln!(out, "    {description}");

---- tests::ascii_lists_nodes_interfaces_controls_and_edges stdout ----

thread 'tests::ascii_lists_nodes_interfaces_controls_and_edges' (1094940) panicked at crates/casm-renderer/src/lib.rs:578:9:
[gateway] gateway
    Public entry point
    --sync / grpc / 100ms--> orders

[service] orders
    :: grpc (grpc v1.0.0)
    # AUTH [security]
    --sync / grpc / 50ms--> orders-db

[database] orders-db

failures:
    tests::ascii_lists_nodes_interfaces_controls_and_edges

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
