*** crates/casm-renderer/src/lib.rs:292:9: replace Ascii::node_block -> String with String::new()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace Ascii::node_block -> String with String::new()
@@ -284,50 +284,17 @@
             let _ = writeln!(out, "{description}");
         }
         out.push('\n');
         out
     }
 
     /// Renders one node and its outgoing edges.
     fn node_block(architecture: &Architecture, node: &Node) -> String {
-        let mut out = format!("[{}] {}\n", node.node_type(), node.name());
-
-        if let Some(description) = node.description() {
-            let _ = writeln!(out, "    {description}");
-        }
-
-        for interface in node.interfaces() {
-            let _ = writeln!(
-                out,
-                "    :: {} ({} v{})",
-                interface.name(),
-                interface.protocol(),
-                interface.version()
-            );
-        }
-
-        for control in node.controls() {
-            let _ = writeln!(
-                out,
-                "    # {} [{}]",
-                control.standard(),
-                control.control_type()
-            );
-        }
-
-        for edge in architecture.outgoing(node.id()) {
-            let target = architecture.node(edge.target()).map_or_else(
-                || edge.target().to_string(),
-                |n| n.name().as_str().to_owned(),
-            );
-            let _ = writeln!(out, "    --{}--> {target}", Mermaid::edge_label(edge));
-        }
-
-        out
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Renderer for Ascii {
     fn id(&self) -> &'static str {
         "ascii"
     }

---- tests::a_hostile_description_cannot_break_out_of_a_label stdout ----

thread 'tests::a_hostile_description_cannot_break_out_of_a_label' (1095008) panicked at crates/casm-renderer/src/lib.rs:594:9:
the text is still shown: x v0.1.0
========


1 node(s), 0 relationship(s)

---- tests::ascii_lists_nodes_interfaces_controls_and_edges stdout ----

thread 'tests::ascii_lists_nodes_interfaces_controls_and_edges' (1095009) panicked at crates/casm-renderer/src/lib.rs:554:9:
storefront v1.2.0
=================
Order capture




3 node(s), 2 relationship(s)

failures:
    tests::a_hostile_description_cannot_break_out_of_a_label
    tests::ascii_lists_nodes_interfaces_controls_and_edges

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
