*** crates/casm-renderer/src/lib.rs:331:9: replace <impl Renderer for Ascii>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Ascii>::id -> &'static str with ""
@@ -323,17 +323,17 @@
         }
 
         out
     }
 }
 
 impl Renderer for Ascii {
     fn id(&self) -> &'static str {
-        "ascii"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn extension(&self) -> &'static str {
         "txt"
     }
 
     fn render(&self, architecture: &Architecture) -> String {
         let mut out = Self::header(architecture);

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1095655) panicked at crates/casm-renderer/src/lib.rs:465:9:
assertion `left == right` failed
  left: None
 right: Some("txt")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
