*** crates/casm-renderer/src/lib.rs:335:9: replace <impl Renderer for Ascii>::extension -> &'static str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Ascii>::extension -> &'static str with ""
@@ -327,17 +327,17 @@
 }
 
 impl Renderer for Ascii {
     fn id(&self) -> &'static str {
         "ascii"
     }
 
     fn extension(&self) -> &'static str {
-        "txt"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn render(&self, architecture: &Architecture) -> String {
         let mut out = Self::header(architecture);
 
         if architecture.is_empty() {
             out.push_str("(no nodes)\n");
             return out;

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1095749) panicked at crates/casm-renderer/src/lib.rs:465:9:
assertion `left == right` failed
  left: Some("")
 right: Some("txt")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
