*** crates/casm-renderer/src/lib.rs:339:9: replace <impl Renderer for Ascii>::render -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace <impl Renderer for Ascii>::render -> String with "xyzzy".into()
@@ -331,36 +331,17 @@
         "ascii"
     }
 
     fn extension(&self) -> &'static str {
         "txt"
     }
 
     fn render(&self, architecture: &Architecture) -> String {
-        let mut out = Self::header(architecture);
-
-        if architecture.is_empty() {
-            out.push_str("(no nodes)\n");
-            return out;
-        }
-
-        for node in architecture.nodes() {
-            out.push_str(&Self::node_block(architecture, node));
-            out.push('\n');
-        }
-
-        let _ = writeln!(
-            out,
-            "{} node(s), {} relationship(s)",
-            architecture.node_count(),
-            architecture.relationship_count()
-        );
-
-        out
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- tests::a_hostile_description_cannot_break_out_of_a_label stdout ----

thread 'tests::a_hostile_description_cannot_break_out_of_a_label' (1096050) panicked at crates/casm-renderer/src/lib.rs:608:9:
the text is still shown: xyzzy

---- tests::ascii_says_so_when_there_is_nothing_to_draw stdout ----

thread 'tests::ascii_says_so_when_there_is_nothing_to_draw' (1096052) panicked at crates/casm-renderer/src/lib.rs:581:9:
xyzzy

---- tests::ascii_lists_nodes_interfaces_controls_and_edges stdout ----

thread 'tests::ascii_lists_nodes_interfaces_controls_and_edges' (1096051) panicked at crates/casm-renderer/src/lib.rs:567:9:
xyzzy

failures:
    tests::a_hostile_description_cannot_break_out_of_a_label
    tests::ascii_lists_nodes_interfaces_controls_and_edges
    tests::ascii_says_so_when_there_is_nothing_to_draw
    tests::every_backend_output_ends_with_a_newline

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
