*** crates/casm-renderer/src/lib.rs:69:5: replace built_in -> Vec<Box<dyn Renderer>> with vec![]

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace built_in -> Vec<Box<dyn Renderer>> with vec![]
@@ -61,17 +61,17 @@
     ///
     /// Must be a pure function: the same architecture always yields the same bytes.
     fn render(&self, architecture: &Architecture) -> String;
 }
 
 /// Returns every built-in backend.
 #[must_use]
 pub fn built_in() -> Vec<Box<dyn Renderer>> {
-    vec![Box::new(Mermaid), Box::new(Dot), Box::new(Ascii)]
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Looks up a backend by its identifier.
 #[must_use]
 pub fn by_id(id: &str) -> Option<Box<dyn Renderer>> {
     built_in().into_iter().find(|backend| backend.id() == id)
 }

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1088933) panicked at crates/casm-renderer/src/lib.rs:463:9:
assertion `left == right` failed
  left: None
 right: Some("mmd")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
