*** crates/casm-renderer/src/lib.rs:75:56: replace == with != in by_id

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace == with != in by_id
@@ -67,17 +67,17 @@
 #[must_use]
 pub fn built_in() -> Vec<Box<dyn Renderer>> {
     vec![Box::new(Mermaid), Box::new(Dot), Box::new(Ascii)]
 }
 
 /// Looks up a backend by its identifier.
 #[must_use]
 pub fn by_id(id: &str) -> Option<Box<dyn Renderer>> {
-    built_in().into_iter().find(|backend| backend.id() == id)
+    built_in().into_iter().find(|backend| backend.id() != /* ~ changed by cargo-mutants ~ */ id)
 }
 
 /// Assigns each node a stable, positional diagram identifier.
 ///
 /// Positional rather than `UUID`-derived: a node's `NodeId` changes whenever the file is
 /// regenerated without a pinned id, and a diagram whose every identifier churns is a
 /// diagram nobody can review in a pull request.
 fn diagram_ids(architecture: &Architecture) -> Vec<(NodeId, String)> {

---- tests::backends_are_discoverable_by_id stdout ----

thread 'tests::backends_are_discoverable_by_id' (1088953) panicked at crates/casm-renderer/src/lib.rs:463:9:
assertion `left == right` failed
  left: Some("dot")
 right: Some("mmd")

failures:
    tests::backends_are_discoverable_by_id

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
