*** crates/casm-renderer/src/lib.rs:84:5: replace diagram_ids -> Vec<(NodeId, String)> with vec![]

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace diagram_ids -> Vec<(NodeId, String)> with vec![]
@@ -76,21 +76,17 @@
 }
 
 /// Assigns each node a stable, positional diagram identifier.
 ///
 /// Positional rather than `UUID`-derived: a node's `NodeId` changes whenever the file is
 /// regenerated without a pinned id, and a diagram whose every identifier churns is a
 /// diagram nobody can review in a pull request.
 fn diagram_ids(architecture: &Architecture) -> Vec<(NodeId, String)> {
-    architecture
-        .nodes()
-        .enumerate()
-        .map(|(index, node)| (node.id(), format!("n{index}")))
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolves a node's diagram identifier.
 fn diagram_id(ids: &[(NodeId, String)], node: NodeId) -> &str {
     ids.iter()
         .find(|(id, _)| *id == node)
         .map_or("unknown", |(_, diagram_id)| diagram_id.as_str())
 }

---- tests::diagram_identifiers_are_positional_not_uuid_derived stdout ----

thread 'tests::diagram_identifiers_are_positional_not_uuid_derived' (1089585) panicked at crates/casm-renderer/src/lib.rs:481:9:
flowchart LR
  %% storefront v1.2.0
  unknown{{"gateway"}}
  unknown["orders"]
  unknown[("orders-db")]
  unknown -->|"sync / grpc / 100ms"| unknown
  unknown -->|"sync / grpc / 50ms"| unknown

failures:
    tests::diagram_identifiers_are_positional_not_uuid_derived

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
