*** crates/casm-renderer/src/lib.rs:93:5: replace diagram_id -> &str with ""

*** mutation diff:
--- crates/casm-renderer/src/lib.rs
+++ replace diagram_id -> &str with ""
@@ -85,19 +85,17 @@
         .nodes()
         .enumerate()
         .map(|(index, node)| (node.id(), format!("n{index}")))
         .collect()
 }
 
 /// Resolves a node's diagram identifier.
 fn diagram_id(ids: &[(NodeId, String)], node: NodeId) -> &str {
-    ids.iter()
-        .find(|(id, _)| *id == node)
-        .map_or("unknown", |(_, diagram_id)| diagram_id.as_str())
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Escapes a free-form label for embedding in a quoted diagram string.
 ///
 /// Node *names* never need this — the CASIMIR name alphabet has no metacharacters — but
 /// descriptions are arbitrary text supplied by the author.
 #[must_use]
 pub fn escape_label(raw: &str) -> String {

---- tests::diagram_identifiers_are_positional_not_uuid_derived stdout ----

thread 'tests::diagram_identifiers_are_positional_not_uuid_derived' (1089632) panicked at crates/casm-renderer/src/lib.rs:483:9:
flowchart LR
  %% storefront v1.2.0
  {{"gateway"}}
  ["orders"]
  [("orders-db")]
   -->|"sync / grpc / 100ms"| 
   -->|"sync / grpc / 50ms"|

failures:
    tests::diagram_identifiers_are_positional_not_uuid_derived

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
