*** crates/casm-validator/src/config.rs:81:9: replace ValidatorConfig::allowing -> Self with Default::default()

*** mutation diff:
--- crates/casm-validator/src/config.rs
+++ replace ValidatorConfig::allowing -> Self with Default::default()
@@ -73,21 +73,17 @@
     pub const fn min_security_controls_per_service(mut self, minimum: usize) -> Self {
         self.min_security_controls_per_service = minimum;
         self
     }
 
     /// Suppresses a rule by its identifier.
     #[must_use]
     pub fn allowing(mut self, rule_id: impl Into<String>) -> Self {
-        let rule_id = rule_id.into();
-        if !self.allow.contains(&rule_id) {
-            self.allow.push(rule_id);
-        }
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if `rule_id` has been suppressed.
     #[must_use]
     pub fn is_allowed(&self, rule_id: &str) -> bool {
         self.allow.iter().any(|allowed| allowed == rule_id)
     }
 }

---- config::tests::suppression_is_by_exact_id stdout ----

thread 'config::tests::suppression_is_by_exact_id' (1101240) panicked at crates/casm-validator/src/config.rs:124:9:
assertion failed: config.is_allowed("no-isolated-nodes")

---- config::tests::suppressions_are_deduplicated stdout ----

thread 'config::tests::suppressions_are_deduplicated' (1101241) panicked at crates/casm-validator/src/config.rs:138:9:
assertion `left == right` failed
  left: []
 right: ["a", "b"]

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (1101313) panicked at crates/casm-validator/src/lib.rs:307:9:
still reported:
warning[stateful-nodes-require-controls]: node 'db': is a database holding persistent state but declares no controls
  help: declare controls covering encryption at rest, backup and restore, and access restriction

failures:
    config::tests::suppression_is_by_exact_id
    config::tests::suppressions_are_deduplicated
    tests::suppressed_rules_do_not_fire

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
