*** crates/casm-validator/src/config.rs:91:9: replace ValidatorConfig::is_allowed -> bool with true

*** mutation diff:
--- crates/casm-validator/src/config.rs
+++ replace ValidatorConfig::is_allowed -> bool with true
@@ -83,17 +83,17 @@
             self.allow.push(rule_id);
         }
         self
     }
 
     /// Returns `true` if `rule_id` has been suppressed.
     #[must_use]
     pub fn is_allowed(&self, rule_id: &str) -> bool {
-        self.allow.iter().any(|allowed| allowed == rule_id)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- config::tests::suppression_is_by_exact_id stdout ----

thread 'config::tests::suppression_is_by_exact_id' (1101420) panicked at crates/casm-validator/src/config.rs:129:9:
must not be a prefix match

---- rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error stdout ----

thread 'rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error' (1101473) panicked at crates/casm-validator/src/rules.rs:1054:9:
assertion `left == right` failed: []
  left: 0
 right: 1

---- rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied stdout ----

thread 'rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied' (1101472) panicked at crates/casm-validator/src/rules.rs:1075:9:
assertion `left == right` failed: []
  left: 0
 right: 1

failures:
    config::tests::suppression_is_by_exact_id
    rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied
    rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error
    rules::tests::a_decision_and_an_edit_get_different_suggestions
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::a_service_without_security_controls_warns
    rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only
    rules::tests::an_external_system_reaching_a_database_is_an_error
    rules::tests::an_isolated_node_warns_but_a_lone_node_does_not
    rules::tests::an_over_budget_critical_path_warns
    rules::tests::an_uncontrolled_boundary_crossing_warns
    rules::tests::an_uncontrolled_database_warns

test result: FAILED. 62 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
