*** crates/casm-validator/src/diagnostic.rs:159:9: replace Diagnostic::render -> String with String::new()

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Diagnostic::render -> String with String::new()
@@ -151,25 +151,17 @@
     /// Renders the finding the way a compiler would.
     ///
     /// ```text
     /// error[no-dependency-cycles]: nodes [a, b] form a blocking dependency cycle
     ///   help: break the cycle by making one edge asynchronous
     /// ```
     #[must_use]
     pub fn render(&self) -> String {
-        let mut out = format!(
-            "{}[{}]: {}: {}",
-            self.severity, self.rule, self.subject, self.message
-        );
-        if let Some(hint) = &self.suggestion {
-            out.push_str("\n  help: ");
-            out.push_str(hint);
-        }
-        out
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The complete result of a validation run.
 #[derive(Clone, Debug, Default, PartialEq, Eq, Serialize, Deserialize)]
 pub struct Report {
     /// Every finding, in rule-execution order.
     pub diagnostics: Vec<Diagnostic>,

---- diagnostic::tests::diagnostic_render_appends_a_help_line_when_present stdout ----

thread 'diagnostic::tests::diagnostic_render_appends_a_help_line_when_present' (1105624) panicked at crates/casm-validator/src/diagnostic.rs:384:9:

---- diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity stdout ----

thread 'diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity' (1105625) panicked at crates/casm-validator/src/diagnostic.rs:375:9:

---- tests::reports_render_and_serialise_to_sarif stdout ----

thread 'tests::reports_render_and_serialise_to_sarif' (1105703) panicked at crates/casm-validator/src/lib.rs:437:9:
assertion failed: !report.render().is_empty()

failures:
    diagnostic::tests::diagnostic_render_appends_a_help_line_when_present
    diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity
    tests::reports_render_and_serialise_to_sarif

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
