*** crates/casm-validator/src/diagnostic.rs:190:9: replace Report::count -> usize with 1

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::count -> usize with 1
@@ -182,20 +182,17 @@
         Self {
             diagnostics: Vec::new(),
         }
     }
 
     /// Counts findings at a given severity.
     #[must_use]
     pub fn count(&self, severity: Severity) -> usize {
-        self.diagnostics
-            .iter()
-            .filter(|d| d.severity == severity)
-            .count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if any finding is an [`Severity::Error`].
     #[must_use]
     pub fn has_errors(&self) -> bool {
         self.diagnostics
             .iter()
             .any(|d| d.severity == Severity::Error)

---- diagnostic::tests::counts_and_filters_agree stdout ----

thread 'diagnostic::tests::counts_and_filters_agree' (1105997) panicked at crates/casm-validator/src/diagnostic.rs:348:9:
assertion `left == right` failed
  left: 1
 right: 2

---- diagnostic::tests::summary_counts_each_severity stdout ----

thread 'diagnostic::tests::summary_counts_each_severity' (1106007) panicked at crates/casm-validator/src/diagnostic.rs:425:9:
assertion `left == right` failed
  left: "1 error(s), 1 warning(s), 1 info"
 right: "1 error(s), 1 warning(s), 0 info"

failures:
    diagnostic::tests::counts_and_filters_agree
    diagnostic::tests::summary_counts_each_severity

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
