*** crates/casm-validator/src/diagnostic.rs:199:9: replace Report::has_errors -> bool with false

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::has_errors -> bool with false
@@ -191,19 +191,17 @@
             .iter()
             .filter(|d| d.severity == severity)
             .count()
     }
 
     /// Returns `true` if any finding is an [`Severity::Error`].
     #[must_use]
     pub fn has_errors(&self) -> bool {
-        self.diagnostics
-            .iter()
-            .any(|d| d.severity == Severity::Error)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if any finding is a [`Severity::Warning`].
     #[must_use]
     pub fn has_warnings(&self) -> bool {
         self.diagnostics
             .iter()
             .any(|d| d.severity == Severity::Warning)

---- rules::tests::a_dependency_cycle_is_an_error stdout ----

thread 'rules::tests::a_dependency_cycle_is_an_error' (1956615) panicked at crates/casm-validator/src/rules.rs:594:9:
assertion failed: report.has_errors()

---- rules::tests::an_external_system_reaching_a_database_is_an_error stdout ----

thread 'rules::tests::an_external_system_reaching_a_database_is_an_error' (1956624) panicked at crates/casm-validator/src/rules.rs:620:9:
assertion failed: report.has_errors()

---- tests::a_custom_rule_can_be_added stdout ----

thread 'tests::a_custom_rule_can_be_added' (1956653) panicked at crates/casm-validator/src/lib.rs:355:9:
assertion failed: report.has_errors()

failures:
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::an_external_system_reaching_a_database_is_an_error
    tests::a_custom_rule_can_be_added

test result: FAILED. 78 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
