*** crates/casm-validator/src/diagnostic.rs:207:9: replace Report::has_warnings -> bool with true

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::has_warnings -> bool with true
@@ -199,19 +199,17 @@
         self.diagnostics
             .iter()
             .any(|d| d.severity == Severity::Error)
     }
 
     /// Returns `true` if any finding is a [`Severity::Warning`].
     #[must_use]
     pub fn has_warnings(&self) -> bool {
-        self.diagnostics
-            .iter()
-            .any(|d| d.severity == Severity::Warning)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if nothing at all was found.
     #[must_use]
     pub fn is_clean(&self) -> bool {
         self.diagnostics.is_empty()
     }

---- diagnostic::tests::has_warnings_distinguishes_a_warning_from_every_other_severity stdout ----

thread 'diagnostic::tests::has_warnings_distinguishes_a_warning_from_every_other_severity' (1957335) panicked at crates/casm-validator/src/diagnostic.rs:348:9:
nothing found

failures:
    diagnostic::tests::has_warnings_distinguishes_a_warning_from_every_other_severity

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
