*** crates/casm-validator/src/diagnostic.rs:215:9: replace Report::is_clean -> bool with true

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::is_clean -> bool with true
@@ -207,17 +207,17 @@
         self.diagnostics
             .iter()
             .any(|d| d.severity == Severity::Warning)
     }
 
     /// Returns `true` if nothing at all was found.
     #[must_use]
     pub fn is_clean(&self) -> bool {
-        self.diagnostics.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns only the findings at a given severity.
     #[must_use]
     pub fn at(&self, severity: Severity) -> Vec<&Diagnostic> {
         self.diagnostics
             .iter()
             .filter(|d| d.severity == severity)

---- diagnostic::tests::info_alone_still_exits_zero stdout ----

thread 'diagnostic::tests::info_alone_still_exits_zero' (1958268) panicked at crates/casm-validator/src/diagnostic.rs:320:9:
there is a finding

---- diagnostic::tests::summary_counts_each_severity stdout ----

thread 'diagnostic::tests::summary_counts_each_severity' (1958273) panicked at crates/casm-validator/src/diagnostic.rs:473:9:
assertion `left == right` failed
  left: "architecture is valid: 0 errors, 0 warnings"
 right: "1 error(s), 1 warning(s), 0 info"

failures:
    diagnostic::tests::info_alone_still_exits_zero
    diagnostic::tests::summary_counts_each_severity

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
