*** crates/casm-validator/src/diagnostic.rs:234:9: replace Report::exit_code -> i32 with 0

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::exit_code -> i32 with 0
@@ -226,21 +226,17 @@
 
     /// The process exit code this report implies.
     ///
     /// `0` clean or informational, `1` warnings, `2` errors. Every CASIMIR surface —
     /// CLI, CI, pre-commit hook — derives its exit status from here, so they cannot
     /// drift apart.
     #[must_use]
     pub fn exit_code(&self) -> i32 {
-        match self.diagnostics.iter().map(|d| d.severity).max() {
-            Some(Severity::Error) => 2,
-            Some(Severity::Warning) => 1,
-            Some(Severity::Info) | None => 0,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends a finding.
     pub fn push(&mut self, diagnostic: Diagnostic) {
         self.diagnostics.push(diagnostic);
     }
 
     /// Merges another report into this one.

---- diagnostic::tests::warnings_exit_one stdout ----

thread 'diagnostic::tests::warnings_exit_one' (1960715) panicked at crates/casm-validator/src/diagnostic.rs:328:9:
assertion `left == right` failed
  left: 0
 right: 1

---- diagnostic::tests::errors_exit_two_and_dominate_warnings stdout ----

thread 'diagnostic::tests::errors_exit_two_and_dominate_warnings' (1960706) panicked at crates/casm-validator/src/diagnostic.rs:336:9:
assertion `left == right` failed: the worst finding decides
  left: 0
 right: 2

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1960766) panicked at crates/casm-validator/src/lib.rs:419:9:
assertion `left == right` failed: an error is present
  left: 0
 right: 2

failures:
    diagnostic::tests::errors_exit_two_and_dominate_warnings
    diagnostic::tests::warnings_exit_one
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 78 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
