*** crates/casm-validator/src/diagnostic.rs:234:9: replace Report::exit_code -> i32 with -1

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::exit_code -> i32 with -1
@@ -226,21 +226,17 @@
 
     /// The process exit code this report implies.
     ///
     /// `0` clean or informational, `1` warnings, `2` errors. Every CASIMIR surface —
     /// CLI, CI, pre-commit hook — derives its exit status from here, so they cannot
     /// drift apart.
     #[must_use]
     pub fn exit_code(&self) -> i32 {
-        match self.diagnostics.iter().map(|d| d.severity).max() {
-            Some(Severity::Error) => 2,
-            Some(Severity::Warning) => 1,
-            Some(Severity::Info) | None => 0,
-        }
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends a finding.
     pub fn push(&mut self, diagnostic: Diagnostic) {
         self.diagnostics.push(diagnostic);
     }
 
     /// Merges another report into this one.

---- diagnostic::tests::an_empty_report_is_clean_and_exits_zero stdout ----

thread 'diagnostic::tests::an_empty_report_is_clean_and_exits_zero' (1112338) panicked at crates/casm-validator/src/diagnostic.rs:309:9:
assertion `left == right` failed
  left: -1
 right: 0

---- diagnostic::tests::info_alone_still_exits_zero stdout ----

thread 'diagnostic::tests::info_alone_still_exits_zero' (1112346) panicked at crates/casm-validator/src/diagnostic.rs:317:9:
assertion `left == right` failed: but nothing worth failing a build over
  left: -1
 right: 0

---- diagnostic::tests::errors_exit_two_and_dominate_warnings stdout ----

thread 'diagnostic::tests::errors_exit_two_and_dominate_warnings' (1112344) panicked at crates/casm-validator/src/diagnostic.rs:336:9:
assertion `left == right` failed: the worst finding decides
  left: -1
 right: 2

failures:
    diagnostic::tests::an_empty_report_is_clean_and_exits_zero
    diagnostic::tests::errors_exit_two_and_dominate_warnings
    diagnostic::tests::info_alone_still_exits_zero
    diagnostic::tests::warnings_exit_one
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::a_healthy_architecture_produces_a_clean_report

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
