*** crates/casm-validator/src/diagnostic.rs:243:9: replace Report::push with ()

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::push with ()
@@ -235,17 +235,17 @@
             Some(Severity::Error) => 2,
             Some(Severity::Warning) => 1,
             Some(Severity::Info) | None => 0,
         }
     }
 
     /// Appends a finding.
     pub fn push(&mut self, diagnostic: Diagnostic) {
-        self.diagnostics.push(diagnostic);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Merges another report into this one.
     pub fn extend(&mut self, other: Self) {
         self.diagnostics.extend(other.diagnostics);
     }
 
     /// Renders every finding, one per stanza.

---- diagnostic::tests::counts_and_filters_agree stdout ----

thread 'diagnostic::tests::counts_and_filters_agree' (1961084) panicked at crates/casm-validator/src/diagnostic.rs:395:9:
assertion `left == right` failed
  left: 0
 right: 1

---- diagnostic::tests::info_alone_still_exits_zero stdout ----

thread 'diagnostic::tests::info_alone_still_exits_zero' (1961090) panicked at crates/casm-validator/src/diagnostic.rs:320:9:
there is a finding

---- diagnostic::tests::a_rendered_report_names_what_it_found stdout ----

thread 'diagnostic::tests::a_rendered_report_names_what_it_found' (1961081) panicked at crates/casm-validator/src/diagnostic.rs:378:9:
the rule identifier:

failures:
    diagnostic::tests::a_rendered_report_names_what_it_found
    diagnostic::tests::counts_and_filters_agree
    diagnostic::tests::errors_exit_two_and_dominate_warnings
    diagnostic::tests::extend_merges_and_preserves_order
    diagnostic::tests::has_warnings_distinguishes_a_warning_from_every_other_severity
    diagnostic::tests::info_alone_still_exits_zero
    diagnostic::tests::summary_counts_each_severity
    diagnostic::tests::warnings_exit_one
    rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied
    rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error
    rules::tests::a_decision_and_an_edit_get_different_suggestions
    rules::tests::a_dependency_cycle_is_an_error

test result: FAILED. 51 passed; 30 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
