*** crates/casm-validator/src/diagnostic.rs:248:9: replace Report::extend with ()

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::extend with ()
@@ -240,17 +240,17 @@
 
     /// Appends a finding.
     pub fn push(&mut self, diagnostic: Diagnostic) {
         self.diagnostics.push(diagnostic);
     }
 
     /// Merges another report into this one.
     pub fn extend(&mut self, other: Self) {
-        self.diagnostics.extend(other.diagnostics);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders every finding, one per stanza.
     #[must_use]
     pub fn render(&self) -> String {
         self.diagnostics
             .iter()
             .map(Diagnostic::render)

---- diagnostic::tests::extend_merges_and_preserves_order stdout ----

thread 'diagnostic::tests::extend_merges_and_preserves_order' (1113814) panicked at crates/casm-validator/src/diagnostic.rs:375:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    diagnostic::tests::extend_merges_and_preserves_order

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
