*** crates/casm-validator/src/diagnostic.rs:264:9: replace Report::summary -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::summary -> String with "xyzzy".into()
@@ -256,25 +256,17 @@
             .map(Diagnostic::render)
             .collect::<Vec<_>>()
             .join("\n")
     }
 
     /// A one-line summary suitable for the last line of CI output.
     #[must_use]
     pub fn summary(&self) -> String {
-        if self.is_clean() {
-            return "architecture is valid: 0 errors, 0 warnings".to_owned();
-        }
-        format!(
-            "{} error(s), {} warning(s), {} info",
-            self.count(Severity::Error),
-            self.count(Severity::Warning),
-            self.count(Severity::Info)
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- diagnostic::tests::clean_summary_says_so_plainly stdout ----

thread 'diagnostic::tests::clean_summary_says_so_plainly' (1114875) panicked at crates/casm-validator/src/diagnostic.rs:409:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "architecture is valid: 0 errors, 0 warnings"

---- diagnostic::tests::summary_counts_each_severity stdout ----

thread 'diagnostic::tests::summary_counts_each_severity' (1114886) panicked at crates/casm-validator/src/diagnostic.rs:420:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "1 error(s), 1 warning(s), 0 info"

failures:
    diagnostic::tests::clean_summary_says_so_plainly
    diagnostic::tests::summary_counts_each_severity

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
