*** crates/casm-validator/src/diagnostic.rs:44:9: replace Severity::sarif_level -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Severity::sarif_level -> &'static str with "xyzzy"
@@ -36,21 +36,17 @@
             Self::Warning => "warning",
             Self::Error => "error",
         }
     }
 
     /// The SARIF 2.1.0 level string for this severity.
     #[must_use]
     pub const fn sarif_level(self) -> &'static str {
-        match self {
-            Self::Info => "note",
-            Self::Warning => "warning",
-            Self::Error => "error",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl core::fmt::Display for Severity {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
         f.write_str(self.label())
     }
 }

---- diagnostic::tests::severity_maps_onto_sarif_levels stdout ----

thread 'diagnostic::tests::severity_maps_onto_sarif_levels' (1104258) panicked at crates/casm-validator/src/diagnostic.rs:299:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "note"

---- sarif::tests::severities_map_onto_sarif_levels stdout ----

thread 'sarif::tests::severities_map_onto_sarif_levels' (1104306) panicked at crates/casm-validator/src/sarif.rs:200:13:
assertion `left == right` failed
  left: String("xyzzy")
 right: "error"

failures:
    diagnostic::tests::severity_maps_onto_sarif_levels
    sarif::tests::severities_map_onto_sarif_levels

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
