*** crates/casm-validator/src/graph.rs:108:9: replace DependencyGraph::critical_path_ms -> Option<u64> with Some(0)

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::critical_path_ms -> Option<u64> with Some(0)
@@ -100,36 +100,17 @@
     /// latency, assuming every hop consumes its whole budget. Comparing it against a
     /// target SLO answers "is this SLO achievable at all?" before anything is built.
     ///
     /// Returns `None` when the graph contains a cycle, because longest-path is undefined
     /// there — the cycle is itself the finding to report, and inventing a number would
     /// obscure it.
     #[must_use]
     pub fn critical_path_ms(&self) -> Option<u64> {
-        let order = petgraph::algo::toposort(&self.graph, None).ok()?;
-
-        // Longest path in a DAG: relax edges once, in topological order.
-        let mut longest: HashMap<NodeIndex, u64> = HashMap::with_capacity(order.len());
-
-        for index in order {
-            let arrival = longest.get(&index).copied().unwrap_or(0);
-            let mut walker = self.graph.neighbors(index).detach();
-
-            while let Some((edge, next)) = walker.next(&self.graph) {
-                let budget = self.graph.edge_weight(edge).copied().unwrap_or(0);
-                let candidate = arrival.saturating_add(budget);
-                let best = longest.entry(next).or_insert(0);
-                if candidate > *best {
-                    *best = candidate;
-                }
-            }
-        }
-
-        Some(longest.values().copied().max().unwrap_or(0))
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the nodes nothing depends on: the entry points of the architecture.
     #[must_use]
     pub fn roots(&self) -> Vec<NodeId> {
         let mut roots: Vec<NodeId> = self
             .graph
             .node_indices()

---- graph::tests::critical_path_is_undefined_for_a_cyclic_graph stdout ----

thread 'graph::tests::critical_path_is_undefined_for_a_cyclic_graph' (1119861) panicked at crates/casm-validator/src/graph.rs:375:9:
assertion `left == right` failed: the cycle is the finding; a number would obscure it
  left: Some(0)
 right: None

---- graph::tests::critical_path_picks_the_worst_branch_not_the_first stdout ----

thread 'graph::tests::critical_path_picks_the_worst_branch_not_the_first' (1119862) panicked at crates/casm-validator/src/graph.rs:332:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(510)

---- graph::tests::critical_path_sums_the_longest_chain stdout ----

thread 'graph::tests::critical_path_sums_the_longest_chain' (1119863) panicked at crates/casm-validator/src/graph.rs:313:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(350)

failures:
    graph::tests::critical_path_is_undefined_for_a_cyclic_graph
    graph::tests::critical_path_picks_the_worst_branch_not_the_first
    graph::tests::critical_path_sums_the_longest_chain
    graph::tests::critical_path_treats_a_missing_budget_as_zero
    rules::tests::an_over_budget_critical_path_warns

test result: FAILED. 74 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
