*** crates/casm-validator/src/graph.rs:121:30: replace > with == in DependencyGraph::critical_path_ms

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace > with == in DependencyGraph::critical_path_ms
@@ -113,17 +113,17 @@
         for index in order {
             let arrival = longest.get(&index).copied().unwrap_or(0);
             let mut walker = self.graph.neighbors(index).detach();
 
             while let Some((edge, next)) = walker.next(&self.graph) {
                 let budget = self.graph.edge_weight(edge).copied().unwrap_or(0);
                 let candidate = arrival.saturating_add(budget);
                 let best = longest.entry(next).or_insert(0);
-                if candidate > *best {
+                if candidate == /* ~ changed by cargo-mutants ~ */ *best {
                     *best = candidate;
                 }
             }
         }
 
         Some(longest.values().copied().max().unwrap_or(0))
     }

---- graph::tests::critical_path_treats_a_missing_budget_as_zero stdout ----

thread 'graph::tests::critical_path_treats_a_missing_budget_as_zero' (1968851) panicked at crates/casm-validator/src/graph.rs:366:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(75)

---- graph::tests::critical_path_sums_the_longest_chain stdout ----

thread 'graph::tests::critical_path_sums_the_longest_chain' (1968850) panicked at crates/casm-validator/src/graph.rs:332:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(350)

---- graph::tests::critical_path_picks_the_worst_branch_not_the_first stdout ----

thread 'graph::tests::critical_path_picks_the_worst_branch_not_the_first' (1968849) panicked at crates/casm-validator/src/graph.rs:351:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(510)

failures:
    graph::tests::critical_path_picks_the_worst_branch_not_the_first
    graph::tests::critical_path_sums_the_longest_chain
    graph::tests::critical_path_treats_a_missing_budget_as_zero
    rules::tests::an_over_budget_critical_path_warns

test result: FAILED. 77 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
