*** crates/casm-validator/src/graph.rs:152:9: replace DependencyGraph::leaves -> Vec<NodeId> with vec![]

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::leaves -> Vec<NodeId> with vec![]
@@ -144,30 +144,17 @@
             .collect();
         roots.sort_unstable();
         roots
     }
 
     /// Returns the nodes that depend on nothing: the leaves of the architecture.
     #[must_use]
     pub fn leaves(&self) -> Vec<NodeId> {
-        let mut leaves: Vec<NodeId> = self
-            .graph
-            .node_indices()
-            .filter(|index| {
-                self.graph
-                    .neighbors_directed(*index, petgraph::Direction::Outgoing)
-                    .next()
-                    .is_none()
-            })
-            .filter_map(|index| self.graph.node_weight(index))
-            .copied()
-            .collect();
-        leaves.sort_unstable();
-        leaves
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if `id` participates in the blocking dependency graph at all.
     #[must_use]
     pub fn contains(&self, id: NodeId) -> bool {
         self.index_of.contains_key(&id)
     }
 }

---- graph::tests::roots_and_leaves_are_identified stdout ----

thread 'graph::tests::roots_and_leaves_are_identified' (1971728) panicked at crates/casm-validator/src/graph.rs:418:9:
assertion `left == right` failed
  left: []
 right: ["c"]

failures:
    graph::tests::roots_and_leaves_are_identified

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
