*** crates/casm-validator/src/graph.rs:171:9: replace DependencyGraph::contains -> bool with true

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::contains -> bool with true
@@ -163,17 +163,17 @@
             .collect();
         leaves.sort_unstable();
         leaves
     }
 
     /// Returns `true` if `id` participates in the blocking dependency graph at all.
     #[must_use]
     pub fn contains(&self, id: NodeId) -> bool {
-        self.index_of.contains_key(&id)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Sums the latency budgets of every blocking relationship touching `id`.
 ///
 /// A free function rather than a method because it needs the architecture's edges, not
 /// the reduced graph.
 #[must_use]

*** result: Success
