*** crates/casm-validator/src/graph.rs:171:9: replace DependencyGraph::contains -> bool with false

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::contains -> bool with false
@@ -163,17 +163,17 @@
             .collect();
         leaves.sort_unstable();
         leaves
     }
 
     /// Returns `true` if `id` participates in the blocking dependency graph at all.
     #[must_use]
     pub fn contains(&self, id: NodeId) -> bool {
-        self.index_of.contains_key(&id)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Sums the latency budgets of every blocking relationship touching `id`.
 ///
 /// A free function rather than a method because it needs the architecture's edges, not
 /// the reduced graph.
 #[must_use]

---- graph::tests::every_node_appears_in_the_graph_even_when_isolated stdout ----

thread 'graph::tests::every_node_appears_in_the_graph_even_when_isolated' (1123521) panicked at crates/casm-validator/src/graph.rs:445:9:
assertion failed: graph.contains(orphan.id())

failures:
    graph::tests::every_node_appears_in_the_graph_even_when_isolated

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
