*** crates/casm-validator/src/graph.rs:181:5: replace blocking_budget_out_of -> u64 with 0

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace blocking_budget_out_of -> u64 with 0
@@ -173,21 +173,17 @@
 }
 
 /// Sums the latency budgets of every blocking relationship touching `id`.
 ///
 /// A free function rather than a method because it needs the architecture's edges, not
 /// the reduced graph.
 #[must_use]
 pub fn blocking_budget_out_of(architecture: &Architecture, id: NodeId) -> u64 {
-    architecture
-        .outgoing(id)
-        .filter(|edge| edge.relationship_type().is_blocking())
-        .filter_map(Relationship::latency_budget_ms)
-        .fold(0_u64, u64::saturating_add)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- graph::tests::outgoing_blocking_budget_excludes_async_edges stdout ----

thread 'graph::tests::outgoing_blocking_budget_excludes_async_edges' (1973071) panicked at crates/casm-validator/src/graph.rs:454:9:
assertion `left == right` failed
  left: 0
 right: 100

failures:
    graph::tests::outgoing_blocking_budget_excludes_async_edges

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
