*** crates/casm-validator/src/graph.rs:51:16: delete ! in DependencyGraph::build

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ delete ! in DependencyGraph::build
@@ -43,17 +43,17 @@
         let mut graph = DiGraph::new();
         let mut index_of = HashMap::with_capacity(architecture.node_count());
 
         for node in architecture.nodes() {
             index_of.insert(node.id(), graph.add_node(node.id()));
         }
 
         for edge in architecture.relationships() {
-            if !edge.relationship_type().forms_dependency_cycle() {
+            if  /* ~ changed by cargo-mutants ~ */edge.relationship_type().forms_dependency_cycle() {
                 continue;
             }
             // Both endpoints are guaranteed present: `Architecture` enforces referential
             // integrity at construction, so a missing index here is impossible.
             if let (Some(&source), Some(&target)) =
                 (index_of.get(&edge.source()), index_of.get(&edge.target()))
             {
                 graph.add_edge(source, target, edge.latency_budget_ms().unwrap_or(0));

---- graph::tests::a_blocking_cycle_is_detected stdout ----

thread 'graph::tests::a_blocking_cycle_is_detected' (1964301) panicked at crates/casm-validator/src/graph.rs:266:9:
assertion failed: !graph.is_acyclic()

---- graph::tests::critical_path_ignores_non_blocking_edges stdout ----

thread 'graph::tests::critical_path_ignores_non_blocking_edges' (1964307) panicked at crates/casm-validator/src/graph.rs:378:9:
assertion `left == right` failed: an async hop does not block the caller
  left: Some(9000)
 right: Some(0)

---- graph::tests::an_event_driven_loop_is_not_a_cycle stdout ----

thread 'graph::tests::an_event_driven_loop_is_not_a_cycle' (1964306) panicked at crates/casm-validator/src/graph.rs:281:9:
assertion failed: DependencyGraph::build(&architecture).is_acyclic()

failures:
    graph::tests::a_blocking_cycle_is_detected
    graph::tests::an_async_loop_is_not_a_cycle
    graph::tests::an_event_driven_loop_is_not_a_cycle
    graph::tests::critical_path_ignores_non_blocking_edges
    graph::tests::critical_path_is_undefined_for_a_cyclic_graph
    graph::tests::critical_path_picks_the_worst_branch_not_the_first
    graph::tests::critical_path_sums_the_longest_chain
    graph::tests::critical_path_treats_a_missing_budget_as_zero
    graph::tests::roots_and_leaves_are_identified
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::an_over_budget_critical_path_warns

test result: FAILED. 70 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
