*** crates/casm-validator/src/graph.rs:75:49: replace > with >= in DependencyGraph::cycles

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace > with >= in DependencyGraph::cycles
@@ -67,17 +67,17 @@
     ///
     /// Each returned group has at least two members and is a genuine cycle. Node order
     /// within a group is sorted by `NodeId` — which, since ids are time-ordered, means
     /// declaration order — so output is deterministic (NASA Rule 8).
     #[must_use]
     pub fn cycles(&self) -> Vec<Vec<NodeId>> {
         let mut cycles: Vec<Vec<NodeId>> = tarjan_scc(&self.graph)
             .into_iter()
-            .filter(|component| component.len() > 1)
+            .filter(|component| component.len() >= /* ~ changed by cargo-mutants ~ */ 1)
             .map(|component| {
                 let mut ids: Vec<NodeId> = component
                     .iter()
                     .filter_map(|index| self.graph.node_weight(*index))
                     .copied()
                     .collect();
                 ids.sort_unstable();
                 ids

---- graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle stdout ----

thread 'graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle' (1117933) panicked at crates/casm-validator/src/graph.rs:307:9:
assertion failed: DependencyGraph::build(&architecture).is_acyclic()

---- graph::tests::an_acyclic_graph_reports_no_cycles stdout ----

thread 'graph::tests::an_acyclic_graph_reports_no_cycles' (1117934) panicked at crates/casm-validator/src/graph.rs:251:9:
assertion failed: graph.is_acyclic()

---- graph::tests::an_async_loop_is_not_a_cycle stdout ----

thread 'graph::tests::an_async_loop_is_not_a_cycle' (1117935) panicked at crates/casm-validator/src/graph.rs:293:9:
assertion failed: DependencyGraph::build(&architecture).is_acyclic()

failures:
    graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle
    graph::tests::an_acyclic_graph_reports_no_cycles
    graph::tests::an_async_loop_is_not_a_cycle
    graph::tests::an_event_driven_loop_is_not_a_cycle
    tests::a_healthy_architecture_produces_a_clean_report
    tests::suppressed_rules_do_not_fire

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
