*** crates/casm-validator/src/graph.rs:94:9: replace DependencyGraph::is_acyclic -> bool with false

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::is_acyclic -> bool with false
@@ -86,17 +86,17 @@
 
         cycles.sort();
         cycles
     }
 
     /// Returns `true` if the blocking dependency structure is acyclic.
     #[must_use]
     pub fn is_acyclic(&self) -> bool {
-        self.cycles().is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Computes the highest total latency budget along any blocking path.
     ///
     /// This is the architecture's *critical path*: the arithmetic floor on end-to-end
     /// latency, assuming every hop consumes its whole budget. Comparing it against a
     /// target SLO answers "is this SLO achievable at all?" before anything is built.
     ///

---- graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle stdout ----

thread 'graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle' (1118216) panicked at crates/casm-validator/src/graph.rs:307:9:
assertion failed: DependencyGraph::build(&architecture).is_acyclic()

---- graph::tests::an_acyclic_graph_reports_no_cycles stdout ----

thread 'graph::tests::an_acyclic_graph_reports_no_cycles' (1118217) panicked at crates/casm-validator/src/graph.rs:251:9:
assertion failed: graph.is_acyclic()

---- graph::tests::an_async_loop_is_not_a_cycle stdout ----

thread 'graph::tests::an_async_loop_is_not_a_cycle' (1118218) panicked at crates/casm-validator/src/graph.rs:293:9:
assertion failed: DependencyGraph::build(&architecture).is_acyclic()

failures:
    graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle
    graph::tests::an_acyclic_graph_reports_no_cycles
    graph::tests::an_async_loop_is_not_a_cycle
    graph::tests::an_event_driven_loop_is_not_a_cycle

test result: FAILED. 75 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
