*** crates/casm-validator/src/lib.rs:102:9: replace Validator::empty -> Self with Default::default()

*** mutation diff:
--- crates/casm-validator/src/lib.rs
+++ replace Validator::empty -> Self with Default::default()
@@ -94,21 +94,17 @@
             rules: rules::built_in(),
             patterns: Vec::new(),
         }
     }
 
     /// A validator with no rules at all, for building a custom set.
     #[must_use]
     pub fn empty(config: ValidatorConfig) -> Self {
-        Self {
-            config,
-            rules: Vec::new(),
-            patterns: Vec::new(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Adds a rule to this validator.
     #[must_use]
     pub fn with_rule(mut self, rule: Box<dyn Rule>) -> Self {
         self.rules.push(rule);
         self
     }

---- rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error stdout ----

thread 'rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error' (1097519) panicked at crates/casm-validator/src/rules.rs:1054:9:
  left: 4
 right: 1

---- rules::tests::a_satisfied_claim_produces_no_finding stdout ----

thread 'rules::tests::a_satisfied_claim_produces_no_finding' (1097524) panicked at crates/casm-validator/src/rules.rs:1018:9:

---- rules::tests::a_decision_and_an_edit_get_different_suggestions stdout ----

thread 'rules::tests::a_decision_and_an_edit_get_different_suggestions' (1097522) panicked at crates/casm-validator/src/rules.rs:1092:9:

failures:
    rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied
    rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error
    rules::tests::a_decision_and_an_edit_get_different_suggestions
    rules::tests::a_satisfied_claim_produces_no_finding
    rules::tests::an_architecture_that_claims_nothing_is_never_touched_by_this_rule
    rules::tests::an_unsatisfied_claim_is_an_error_naming_the_pattern
    tests::an_empty_validator_reports_nothing

test result: FAILED. 72 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
