*** crates/casm-validator/src/lib.rs:130:9: replace Validator::patterns -> &[Pattern] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-validator/src/lib.rs
+++ replace Validator::patterns -> &[Pattern] with Vec::leak(Vec::new())
@@ -122,17 +122,17 @@
     pub fn with_patterns(mut self, patterns: Vec<Pattern>) -> Self {
         self.patterns = patterns;
         self
     }
 
     /// The patterns this validator will check claims against.
     #[must_use]
     pub fn patterns(&self) -> &[Pattern] {
-        &self.patterns
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The thresholds this validator is configured with.
     #[must_use]
     pub const fn config(&self) -> &ValidatorConfig {
         &self.config
     }

*** result: Success
