*** crates/casm-validator/src/lib.rs:142:9: replace Validator::rule_ids -> Vec<&'static str> with vec![]

*** mutation diff:
--- crates/casm-validator/src/lib.rs
+++ replace Validator::rule_ids -> Vec<&'static str> with vec![]
@@ -134,17 +134,17 @@
     #[must_use]
     pub const fn config(&self) -> &ValidatorConfig {
         &self.config
     }
 
     /// The identifiers of every rule this validator will run, in execution order.
     #[must_use]
     pub fn rule_ids(&self) -> Vec<&'static str> {
-        self.rules.iter().map(|rule| rule.id()).collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Validates `architecture`, returning every finding.
     ///
     /// Suppressed rules are skipped entirely rather than run-and-filtered, so silencing
     /// an expensive rule actually saves the work.
     #[must_use]
     pub fn validate(&self, architecture: &Architecture) -> Report {

---- tests::the_default_validator_exposes_its_rule_set stdout ----

thread 'tests::the_default_validator_exposes_its_rule_set' (1099517) panicked at crates/casm-validator/src/lib.rs:361:9:
assertion failed: ids.contains(&"no-dependency-cycles")

failures:
    tests::the_default_validator_exposes_its_rule_set

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
