*** crates/casm-validator/src/lib.rs:142:9: replace Validator::rule_ids -> Vec<&'static str> with vec!["xyzzy"]

*** mutation diff:
--- crates/casm-validator/src/lib.rs
+++ replace Validator::rule_ids -> Vec<&'static str> with vec!["xyzzy"]
@@ -134,17 +134,17 @@
     #[must_use]
     pub const fn config(&self) -> &ValidatorConfig {
         &self.config
     }
 
     /// The identifiers of every rule this validator will run, in execution order.
     #[must_use]
     pub fn rule_ids(&self) -> Vec<&'static str> {
-        self.rules.iter().map(|rule| rule.id()).collect()
+        vec!["xyzzy"] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Validates `architecture`, returning every finding.
     ///
     /// Suppressed rules are skipped entirely rather than run-and-filtered, so silencing
     /// an expensive rule actually saves the work.
     #[must_use]
     pub fn validate(&self, architecture: &Architecture) -> Report {

---- tests::the_default_validator_exposes_its_rule_set stdout ----

thread 'tests::the_default_validator_exposes_its_rule_set' (1946228) panicked at crates/casm-validator/src/lib.rs:361:9:
assertion failed: ids.contains(&"no-dependency-cycles")

---- tests::an_empty_validator_reports_nothing stdout ----

thread 'tests::an_empty_validator_reports_nothing' (1946225) panicked at crates/casm-validator/src/lib.rs:325:9:
assertion failed: validator.rule_ids().is_empty()

failures:
    tests::an_empty_validator_reports_nothing
    tests::the_default_validator_exposes_its_rule_set

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
