*** crates/casm-validator/src/lib.rs:151:9: replace Validator::validate -> Report with Default::default()

*** mutation diff:
--- crates/casm-validator/src/lib.rs
+++ replace Validator::validate -> Report with Default::default()
@@ -143,33 +143,17 @@
     }
 
     /// Validates `architecture`, returning every finding.
     ///
     /// Suppressed rules are skipped entirely rather than run-and-filtered, so silencing
     /// an expensive rule actually saves the work.
     #[must_use]
     pub fn validate(&self, architecture: &Architecture) -> Report {
-        let graph = DependencyGraph::build(architecture);
-        let context = RuleContext {
-            architecture,
-            graph: &graph,
-            patterns: &self.patterns,
-            config: &self.config,
-        };
-
-        let mut report = Report::new();
-        for rule in &self.rules {
-            if self.config.is_allowed(rule.id()) {
-                continue;
-            }
-            rule.check(&context, &mut report);
-        }
-
-        report
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for Validator {
     fn default() -> Self {
         Self::new()
     }
 }

---- rules::tests::a_decision_and_an_edit_get_different_suggestions stdout ----

thread 'rules::tests::a_decision_and_an_edit_get_different_suggestions' (1946761) panicked at crates/casm-validator/src/rules.rs:1093:23:
index out of bounds: the len is 0 but the index is 0

---- rules::tests::a_dependency_cycle_is_an_error stdout ----

thread 'rules::tests::a_dependency_cycle_is_an_error' (1946762) panicked at crates/casm-validator/src/rules.rs:594:9:
assertion failed: report.has_errors()

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (1946766) panicked at crates/casm-validator/src/rules.rs:659:9:
assertion failed: has(&architecture, "services-require-security-controls")

failures:
    rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied
    rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error
    rules::tests::a_decision_and_an_edit_get_different_suggestions
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::a_service_without_security_controls_warns
    rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only
    rules::tests::an_external_system_reaching_a_database_is_an_error
    rules::tests::an_isolated_node_warns_but_a_lone_node_does_not
    rules::tests::an_over_budget_critical_path_warns
    rules::tests::an_uncontrolled_boundary_crossing_warns
    rules::tests::an_uncontrolled_database_warns
    rules::tests::an_unsatisfied_claim_is_an_error_naming_the_pattern

test result: FAILED. 65 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
