*** crates/casm-validator/src/rules.rs:128:9: replace <impl Rule for NoPubliclyExposedDatastores>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoPubliclyExposedDatastores>::description -> &'static str with ""
@@ -120,17 +120,17 @@
 pub struct NoPubliclyExposedDatastores;
 
 impl Rule for NoPubliclyExposedDatastores {
     fn id(&self) -> &'static str {
         "no-publicly-exposed-datastores"
     }
 
     fn description(&self) -> &'static str {
-        "external systems and humans must not connect directly to a database, queue, or store"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for edge in context.architecture.relationships() {
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1129416) panicked at crates/casm-validator/src/rules.rs:937:13:
no-publicly-exposed-datastores has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
