*** crates/casm-validator/src/rules.rs:128:9: replace <impl Rule for NoPubliclyExposedDatastores>::description -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoPubliclyExposedDatastores>::description -> &'static str with "xyzzy"
@@ -120,17 +120,17 @@
 pub struct NoPubliclyExposedDatastores;
 
 impl Rule for NoPubliclyExposedDatastores {
     fn id(&self) -> &'static str {
         "no-publicly-exposed-datastores"
     }
 
     fn description(&self) -> &'static str {
-        "external systems and humans must not connect directly to a database, queue, or store"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for edge in context.architecture.relationships() {
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {

*** result: Success
