*** crates/casm-validator/src/rules.rs:132:9: replace <impl Rule for NoPubliclyExposedDatastores>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoPubliclyExposedDatastores>::check with ()
@@ -124,50 +124,17 @@
         "no-publicly-exposed-datastores"
     }
 
     fn description(&self) -> &'static str {
         "external systems and humans must not connect directly to a database, queue, or store"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
-        for edge in context.architecture.relationships() {
-            let (Some(source), Some(target)) = (
-                context.architecture.node(edge.source()),
-                context.architecture.node(edge.target()),
-            ) else {
-                continue;
-            };
-
-            if !source.node_type().is_external() || !target.node_type().is_stateful() {
-                continue;
-            }
-
-            report.push(
-                Diagnostic::new(
-                    self.id(),
-                    Severity::Error,
-                    Subject::Relationship {
-                        source: source.name().as_str().to_owned(),
-                        target: target.name().as_str().to_owned(),
-                    },
-                    format!(
-                        "'{}' is outside the control boundary and connects directly to the \
-                         {} '{}'",
-                        source.name(),
-                        target.node_type(),
-                        target.name()
-                    ),
-                )
-                .with_suggestion(
-                    "route the access through a service or gateway that can enforce \
-                     authentication, authorisation, and rate limiting",
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Every service must declare a minimum number of security controls.
 pub struct ServicesRequireSecurityControls;
 
 impl Rule for ServicesRequireSecurityControls {
     fn id(&self) -> &'static str {

---- rules::tests::an_external_system_reaching_a_database_is_an_error stdout ----

thread 'rules::tests::an_external_system_reaching_a_database_is_an_error' (1977908) panicked at crates/casm-validator/src/rules.rs:587:9:
assertion failed: report.has_errors()

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1977930) panicked at crates/casm-validator/src/lib.rs:406:9:
["services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

failures:
    rules::tests::an_external_system_reaching_a_database_is_an_error
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
