*** crates/casm-validator/src/rules.rs:222:9: replace <impl Rule for StatefulNodesRequireControls>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for StatefulNodesRequireControls>::id -> &'static str with ""
@@ -214,17 +214,17 @@
 /// Stateful nodes must declare at least one control.
 ///
 /// A database with no declared controls is a database nobody has thought about backing
 /// up, encrypting, or restricting.
 pub struct StatefulNodesRequireControls;
 
 impl Rule for StatefulNodesRequireControls {
     fn id(&self) -> &'static str {
-        "stateful-nodes-require-controls"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "nodes that hold state must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {

---- rules::tests::an_uncontrolled_database_warns stdout ----

thread 'rules::tests::an_uncontrolled_database_warns' (1134648) panicked at crates/casm-validator/src/rules.rs:707:9:
assertion failed: has(&architecture, "stateful-nodes-require-controls")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1134680) panicked at crates/casm-validator/src/lib.rs:410:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (1134697) panicked at crates/casm-validator/src/lib.rs:296:9:
assertion failed: noisy.diagnostics.iter().any(|d| d.rule == "stateful-nodes-require-controls")

failures:
    rules::tests::an_uncontrolled_database_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::reports_render_and_serialise_to_sarif
    tests::suppressed_rules_do_not_fire

test result: FAILED. 75 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
