*** crates/casm-validator/src/rules.rs:226:9: replace <impl Rule for StatefulNodesRequireControls>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for StatefulNodesRequireControls>::description -> &'static str with ""
@@ -218,17 +218,17 @@
 pub struct StatefulNodesRequireControls;
 
 impl Rule for StatefulNodesRequireControls {
     fn id(&self) -> &'static str {
         "stateful-nodes-require-controls"
     }
 
     fn description(&self) -> &'static str {
-        "nodes that hold state must declare at least one control"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
             if !node.node_type().is_stateful() || !node.controls().is_empty() {
                 continue;
             }

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1983756) panicked at crates/casm-validator/src/rules.rs:937:13:
stateful-nodes-require-controls has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
