*** crates/casm-validator/src/rules.rs:231:48: replace || with && in <impl Rule for StatefulNodesRequireControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace || with && in <impl Rule for StatefulNodesRequireControls>::check
@@ -223,17 +223,17 @@
     }
 
     fn description(&self) -> &'static str {
         "nodes that hold state must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
-            if !node.node_type().is_stateful() || !node.controls().is_empty() {
+            if !node.node_type().is_stateful() && /* ~ changed by cargo-mutants ~ */ !node.controls().is_empty() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,
                     RuleContext::subject(node),

---- rules::tests::a_stateless_service_does_not_trip_the_stateful_rule stdout ----

thread 'rules::tests::a_stateless_service_does_not_trip_the_stateful_rule' (1985419) panicked at crates/casm-validator/src/rules.rs:717:9:
assertion failed: !has(&architecture, "stateful-nodes-require-controls")

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (1985446) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
warning[stateful-nodes-require-controls]: node 'orders-db': is a database holding persistent state but declares no controls
  help: declare controls covering encryption at rest, backup and restore, and access restriction

failures:
    rules::tests::a_stateless_service_does_not_trip_the_stateful_rule
    tests::a_healthy_architecture_produces_a_clean_report

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
