*** crates/casm-validator/src/rules.rs:231:51: delete ! in <impl Rule for StatefulNodesRequireControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for StatefulNodesRequireControls>::check
@@ -223,17 +223,17 @@
     }
 
     fn description(&self) -> &'static str {
         "nodes that hold state must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
-            if !node.node_type().is_stateful() || !node.controls().is_empty() {
+            if !node.node_type().is_stateful() ||  /* ~ changed by cargo-mutants ~ */node.controls().is_empty() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,
                     RuleContext::subject(node),

---- rules::tests::an_uncontrolled_database_warns stdout ----

thread 'rules::tests::an_uncontrolled_database_warns' (1137646) panicked at crates/casm-validator/src/rules.rs:707:9:
assertion failed: has(&architecture, "stateful-nodes-require-controls")

---- tests::reports_render_and_serialise_to_sarif stdout ----

thread 'tests::reports_render_and_serialise_to_sarif' (1137682) panicked at crates/casm-validator/src/lib.rs:437:9:
assertion failed: !report.render().is_empty()

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (1137683) panicked at crates/casm-validator/src/lib.rs:296:9:
assertion failed: noisy.diagnostics.iter().any(|d| d.rule == "stateful-nodes-require-controls")

failures:
    rules::tests::an_uncontrolled_database_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::a_healthy_architecture_produces_a_clean_report
    tests::reports_render_and_serialise_to_sarif
    tests::suppressed_rules_do_not_fire

test result: FAILED. 74 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
