*** crates/casm-validator/src/rules.rs:259:9: replace <impl Rule for CriticalPathWithinBudget>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for CriticalPathWithinBudget>::id -> &'static str with "xyzzy"
@@ -251,17 +251,17 @@
     }
 }
 
 /// The critical path's latency budget must stay within the configured ceiling.
 pub struct CriticalPathWithinBudget;
 
 impl Rule for CriticalPathWithinBudget {
     fn id(&self) -> &'static str {
-        "critical-path-within-budget"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "the summed latency budget along the longest blocking path must stay within the SLO"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A cyclic graph has no defined longest path. `NoDependencyCycles` already

---- rules::tests::an_over_budget_critical_path_warns stdout ----

thread 'rules::tests::an_over_budget_critical_path_warns' (1987007) panicked at crates/casm-validator/src/rules.rs:741:9:
assertion failed: has(&architecture, "critical-path-within-budget")

failures:
    rules::tests::an_over_budget_critical_path_warns

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
