*** crates/casm-validator/src/rules.rs:263:9: replace <impl Rule for CriticalPathWithinBudget>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for CriticalPathWithinBudget>::description -> &'static str with ""
@@ -255,17 +255,17 @@
 pub struct CriticalPathWithinBudget;
 
 impl Rule for CriticalPathWithinBudget {
     fn id(&self) -> &'static str {
         "critical-path-within-budget"
     }
 
     fn description(&self) -> &'static str {
-        "the summed latency budget along the longest blocking path must stay within the SLO"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A cyclic graph has no defined longest path. `NoDependencyCycles` already
         // reports that, and stacking a second finding on the same cause is noise.
         let Some(critical_path) = context.graph.critical_path_ms() else {
             return;
         };

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1138624) panicked at crates/casm-validator/src/rules.rs:937:13:
critical-path-within-budget has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
