*** crates/casm-validator/src/rules.rs:269:9: replace <impl Rule for CriticalPathWithinBudget>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for CriticalPathWithinBudget>::check with ()
@@ -261,40 +261,17 @@
 
     fn description(&self) -> &'static str {
         "the summed latency budget along the longest blocking path must stay within the SLO"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A cyclic graph has no defined longest path. `NoDependencyCycles` already
         // reports that, and stacking a second finding on the same cause is noise.
-        let Some(critical_path) = context.graph.critical_path_ms() else {
-            return;
-        };
-
-        let ceiling = context.config.max_critical_path_ms;
-        if critical_path <= ceiling {
-            return;
-        }
-
-        report.push(
-            Diagnostic::new(
-                self.id(),
-                Severity::Warning,
-                Subject::Architecture,
-                format!(
-                    "the critical path budget is {critical_path}ms, exceeding the {ceiling}ms \
-                     ceiling; the end-to-end SLO is not arithmetically achievable"
-                ),
-            )
-            .with_suggestion(
-                "reduce a hop's latency budget, parallelise sequential calls, or convert a \
-                 blocking hop to 'async'",
-            ),
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Edges crossing the control boundary must declare controls.
 pub struct BoundaryCrossingsRequireControls;
 
 impl Rule for BoundaryCrossingsRequireControls {
     fn id(&self) -> &'static str {

---- rules::tests::an_over_budget_critical_path_warns stdout ----

thread 'rules::tests::an_over_budget_critical_path_warns' (1988811) panicked at crates/casm-validator/src/rules.rs:718:9:
assertion failed: has(&architecture, "critical-path-within-budget")

failures:
    rules::tests::an_over_budget_critical_path_warns

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
