*** crates/casm-validator/src/rules.rs:274:26: replace <= with > in <impl Rule for CriticalPathWithinBudget>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <= with > in <impl Rule for CriticalPathWithinBudget>::check
@@ -266,17 +266,17 @@
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A cyclic graph has no defined longest path. `NoDependencyCycles` already
         // reports that, and stacking a second finding on the same cause is noise.
         let Some(critical_path) = context.graph.critical_path_ms() else {
             return;
         };
 
         let ceiling = context.config.max_critical_path_ms;
-        if critical_path <= ceiling {
+        if critical_path > /* ~ changed by cargo-mutants ~ */ ceiling {
             return;
         }
 
         report.push(
             Diagnostic::new(
                 self.id(),
                 Severity::Warning,
                 Subject::Architecture,

---- rules::tests::an_over_budget_critical_path_warns stdout ----

thread 'rules::tests::an_over_budget_critical_path_warns' (1139991) panicked at crates/casm-validator/src/rules.rs:741:9:
assertion failed: has(&architecture, "critical-path-within-budget")

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (1140018) panicked at crates/casm-validator/src/lib.rs:307:9:
still reported:
warning[critical-path-within-budget]: architecture: the critical path budget is 0ms, exceeding the 1000ms ceiling; the end-to-end SLO is not arithmetically achievable
  help: reduce a hop's latency budget, parallelise sequential calls, or convert a blocking hop to 'async'

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (1140014) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
warning[critical-path-within-budget]: architecture: the critical path budget is 150ms, exceeding the 1000ms ceiling; the end-to-end SLO is not arithmetically achievable
  help: reduce a hop's latency budget, parallelise sequential calls, or convert a blocking hop to 'async'

failures:
    rules::tests::an_over_budget_critical_path_warns
    tests::a_healthy_architecture_produces_a_clean_report
    tests::an_empty_architecture_is_clean
    tests::suppressed_rules_do_not_fire

test result: FAILED. 75 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
