*** crates/casm-validator/src/rules.rs:301:9: replace <impl Rule for BoundaryCrossingsRequireControls>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for BoundaryCrossingsRequireControls>::id -> &'static str with "xyzzy"
@@ -293,17 +293,17 @@
     }
 }
 
 /// Edges crossing the control boundary must declare controls.
 pub struct BoundaryCrossingsRequireControls;
 
 impl Rule for BoundaryCrossingsRequireControls {
     fn id(&self) -> &'static str {
-        "boundary-crossings-require-controls"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "relationships that cross the trust boundary must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for edge in context.architecture.relationships() {

---- rules::tests::an_uncontrolled_boundary_crossing_warns stdout ----

thread 'rules::tests::an_uncontrolled_boundary_crossing_warns' (1990508) panicked at crates/casm-validator/src/rules.rs:824:9:
assertion failed: has(&architecture, "boundary-crossings-require-controls")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1990546) panicked at crates/casm-validator/src/lib.rs:414:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "stateful-nodes-require-controls", "xyzzy", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

failures:
    rules::tests::an_uncontrolled_boundary_crossing_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
