*** crates/casm-validator/src/rules.rs:305:9: replace <impl Rule for BoundaryCrossingsRequireControls>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for BoundaryCrossingsRequireControls>::description -> &'static str with ""
@@ -297,17 +297,17 @@
 pub struct BoundaryCrossingsRequireControls;
 
 impl Rule for BoundaryCrossingsRequireControls {
     fn id(&self) -> &'static str {
         "boundary-crossings-require-controls"
     }
 
     fn description(&self) -> &'static str {
-        "relationships that cross the trust boundary must declare at least one control"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for edge in context.architecture.relationships() {
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1990376) panicked at crates/casm-validator/src/rules.rs:937:13:
boundary-crossings-require-controls has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
