*** crates/casm-validator/src/rules.rs:309:9: replace <impl Rule for BoundaryCrossingsRequireControls>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for BoundaryCrossingsRequireControls>::check with ()
@@ -301,45 +301,17 @@
         "boundary-crossings-require-controls"
     }
 
     fn description(&self) -> &'static str {
         "relationships that cross the trust boundary must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
-        for edge in context.architecture.relationships() {
-            let (Some(source), Some(target)) = (
-                context.architecture.node(edge.source()),
-                context.architecture.node(edge.target()),
-            ) else {
-                continue;
-            };
-
-            let crosses = source.node_type().is_external() != target.node_type().is_external();
-            if !crosses || !edge.controls().is_empty() {
-                continue;
-            }
-
-            report.push(
-                Diagnostic::new(
-                    self.id(),
-                    Severity::Warning,
-                    Subject::Relationship {
-                        source: source.name().as_str().to_owned(),
-                        target: target.name().as_str().to_owned(),
-                    },
-                    "crosses the trust boundary but declares no controls",
-                )
-                .with_suggestion(
-                    "declare the transport and authentication controls governing this edge, \
-                     for example mutual TLS and a token audience restriction",
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Nodes with no relationships at all are probably a mistake.
 pub struct NoIsolatedNodes;
 
 impl Rule for NoIsolatedNodes {
     fn id(&self) -> &'static str {

---- rules::tests::an_uncontrolled_boundary_crossing_warns stdout ----

thread 'rules::tests::an_uncontrolled_boundary_crossing_warns' (1141679) panicked at crates/casm-validator/src/rules.rs:796:9:
assertion failed: has(&architecture, "boundary-crossings-require-controls")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1141716) panicked at crates/casm-validator/src/lib.rs:414:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "stateful-nodes-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

failures:
    rules::tests::an_uncontrolled_boundary_crossing_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
