*** crates/casm-validator/src/rules.rs:318:16: delete ! in <impl Rule for BoundaryCrossingsRequireControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for BoundaryCrossingsRequireControls>::check
@@ -310,17 +310,17 @@
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {
                 continue;
             };
 
             let crosses = source.node_type().is_external() != target.node_type().is_external();
-            if !crosses || !edge.controls().is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */crosses || !edge.controls().is_empty() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,
                     Subject::Relationship {

---- rules::tests::an_uncontrolled_boundary_crossing_warns stdout ----

thread 'rules::tests::an_uncontrolled_boundary_crossing_warns' (1143653) panicked at crates/casm-validator/src/rules.rs:824:9:
assertion failed: has(&architecture, "boundary-crossings-require-controls")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1143673) panicked at crates/casm-validator/src/lib.rs:414:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "stateful-nodes-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (1143675) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
warning[boundary-crossings-require-controls]: relationship 'gateway' -> 'orders': crosses the trust boundary but declares no controls
  help: declare the transport and authentication controls governing this edge, for example mutual TLS and a token audience restriction
warning[boundary-crossings-require-controls]: relationship 'orders' -> 'orders-db': crosses the trust boundary but declares no controls
  help: declare the transport and authentication controls governing this edge, for example mutual TLS and a token audience restriction

failures:
    rules::tests::an_uncontrolled_boundary_crossing_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::a_healthy_architecture_produces_a_clean_report

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
