*** crates/casm-validator/src/rules.rs:318:25: replace || with && in <impl Rule for BoundaryCrossingsRequireControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace || with && in <impl Rule for BoundaryCrossingsRequireControls>::check
@@ -310,17 +310,17 @@
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {
                 continue;
             };
 
             let crosses = source.node_type().is_external() != target.node_type().is_external();
-            if !crosses || !edge.controls().is_empty() {
+            if !crosses && /* ~ changed by cargo-mutants ~ */ !edge.controls().is_empty() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,
                     Subject::Relationship {

---- rules::tests::a_controlled_boundary_crossing_is_quiet stdout ----

thread 'rules::tests::a_controlled_boundary_crossing_is_quiet' (1991974) panicked at crates/casm-validator/src/rules.rs:849:9:
assertion failed: !has(&architecture, "boundary-crossings-require-controls")

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (1992009) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
warning[boundary-crossings-require-controls]: relationship 'gateway' -> 'orders': crosses the trust boundary but declares no controls
  help: declare the transport and authentication controls governing this edge, for example mutual TLS and a token audience restriction
warning[boundary-crossings-require-controls]: relationship 'orders' -> 'orders-db': crosses the trust boundary but declares no controls
  help: declare the transport and authentication controls governing this edge, for example mutual TLS and a token audience restriction

failures:
    rules::tests::a_controlled_boundary_crossing_is_quiet
    tests::a_healthy_architecture_produces_a_clean_report

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
