*** crates/casm-validator/src/rules.rs:346:9: replace <impl Rule for NoIsolatedNodes>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoIsolatedNodes>::id -> &'static str with "xyzzy"
@@ -338,17 +338,17 @@
     }
 }
 
 /// Nodes with no relationships at all are probably a mistake.
 pub struct NoIsolatedNodes;
 
 impl Rule for NoIsolatedNodes {
     fn id(&self) -> &'static str {
-        "no-isolated-nodes"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "every node should participate in at least one relationship"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A single-node architecture is a legitimate starting point, not an error.

---- rules::tests::an_isolated_node_warns_but_a_lone_node_does_not stdout ----

thread 'rules::tests::an_isolated_node_warns_but_a_lone_node_does_not' (1993752) panicked at crates/casm-validator/src/rules.rs:800:9:
assertion failed: has(&with_orphan, "no-isolated-nodes")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1993774) panicked at crates/casm-validator/src/lib.rs:418:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "xyzzy", "sync-targets-should-declare-interfaces"]

failures:
    rules::tests::an_isolated_node_warns_but_a_lone_node_does_not
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
