*** crates/casm-validator/src/rules.rs:350:9: replace <impl Rule for NoIsolatedNodes>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoIsolatedNodes>::description -> &'static str with ""
@@ -342,17 +342,17 @@
 pub struct NoIsolatedNodes;
 
 impl Rule for NoIsolatedNodes {
     fn id(&self) -> &'static str {
         "no-isolated-nodes"
     }
 
     fn description(&self) -> &'static str {
-        "every node should participate in at least one relationship"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A single-node architecture is a legitimate starting point, not an error.
         if context.architecture.node_count() < 2 {
             return;
         }

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1993966) panicked at crates/casm-validator/src/rules.rs:937:13:
no-isolated-nodes has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
