*** crates/casm-validator/src/rules.rs:350:9: replace <impl Rule for NoIsolatedNodes>::description -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoIsolatedNodes>::description -> &'static str with "xyzzy"
@@ -342,17 +342,17 @@
 pub struct NoIsolatedNodes;
 
 impl Rule for NoIsolatedNodes {
     fn id(&self) -> &'static str {
         "no-isolated-nodes"
     }
 
     fn description(&self) -> &'static str {
-        "every node should participate in at least one relationship"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A single-node architecture is a legitimate starting point, not an error.
         if context.architecture.node_count() < 2 {
             return;
         }

*** result: Success
