*** crates/casm-validator/src/rules.rs:355:46: replace < with == in <impl Rule for NoIsolatedNodes>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace < with == in <impl Rule for NoIsolatedNodes>::check
@@ -347,17 +347,17 @@
     }
 
     fn description(&self) -> &'static str {
         "every node should participate in at least one relationship"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A single-node architecture is a legitimate starting point, not an error.
-        if context.architecture.node_count() < 2 {
+        if context.architecture.node_count() == /* ~ changed by cargo-mutants ~ */ 2 {
             return;
         }
 
         for node in context.architecture.isolated_nodes() {
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,

---- rules::tests::an_isolated_node_warns_but_a_lone_node_does_not stdout ----

thread 'rules::tests::an_isolated_node_warns_but_a_lone_node_does_not' (1995160) panicked at crates/casm-validator/src/rules.rs:778:9:
one node is a valid start

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (1995187) panicked at crates/casm-validator/src/lib.rs:307:9:
still reported:
warning[no-isolated-nodes]: node 'db': participates in no relationships
  help: connect it to the rest of the architecture, or remove it if it is no longer part of the system

failures:
    rules::tests::an_isolated_node_warns_but_a_lone_node_does_not
    tests::suppressed_rules_do_not_fire

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
