*** crates/casm-validator/src/rules.rs:355:46: replace < with <= in <impl Rule for NoIsolatedNodes>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace < with <= in <impl Rule for NoIsolatedNodes>::check
@@ -347,17 +347,17 @@
     }
 
     fn description(&self) -> &'static str {
         "every node should participate in at least one relationship"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A single-node architecture is a legitimate starting point, not an error.
-        if context.architecture.node_count() < 2 {
+        if context.architecture.node_count() <= /* ~ changed by cargo-mutants ~ */ 2 {
             return;
         }
 
         for node in context.architecture.isolated_nodes() {
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,

*** result: Success
