*** crates/casm-validator/src/rules.rs:355:9: replace <impl Rule for NoIsolatedNodes>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoIsolatedNodes>::check with ()
@@ -347,34 +347,17 @@
     }
 
     fn description(&self) -> &'static str {
         "every node should participate in at least one relationship"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A single-node architecture is a legitimate starting point, not an error.
-        if context.architecture.node_count() < 2 {
-            return;
-        }
-
-        for node in context.architecture.isolated_nodes() {
-            report.push(
-                Diagnostic::new(
-                    self.id(),
-                    Severity::Warning,
-                    RuleContext::subject(node),
-                    "participates in no relationships",
-                )
-                .with_suggestion(
-                    "connect it to the rest of the architecture, or remove it if it is no \
-                     longer part of the system",
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Targets of synchronous calls should declare the interface being called.
 pub struct SyncTargetsShouldDeclareInterfaces;
 
 impl Rule for SyncTargetsShouldDeclareInterfaces {
     fn id(&self) -> &'static str {

---- rules::tests::an_isolated_node_warns_but_a_lone_node_does_not stdout ----

thread 'rules::tests::an_isolated_node_warns_but_a_lone_node_does_not' (1995663) panicked at crates/casm-validator/src/rules.rs:783:9:
assertion failed: has(&with_orphan, "no-isolated-nodes")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (1995684) panicked at crates/casm-validator/src/lib.rs:418:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "sync-targets-should-declare-interfaces"]

failures:
    rules::tests::an_isolated_node_warns_but_a_lone_node_does_not
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
