*** crates/casm-validator/src/rules.rs:381:9: replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::id -> &'static str with ""
@@ -373,17 +373,17 @@
     }
 }
 
 /// Targets of synchronous calls should declare the interface being called.
 pub struct SyncTargetsShouldDeclareInterfaces;
 
 impl Rule for SyncTargetsShouldDeclareInterfaces {
     fn id(&self) -> &'static str {
-        "sync-targets-should-declare-interfaces"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "a node called synchronously should declare the interface that is being called"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {

---- rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only stdout ----

thread 'rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only' (1996651) panicked at crates/casm-validator/src/rules.rs:877:14:
rule should have fired

failures:
    rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
