*** crates/casm-validator/src/rules.rs:385:9: replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::description -> &'static str with ""
@@ -377,17 +377,17 @@
 pub struct SyncTargetsShouldDeclareInterfaces;
 
 impl Rule for SyncTargetsShouldDeclareInterfaces {
     fn id(&self) -> &'static str {
         "sync-targets-should-declare-interfaces"
     }
 
     fn description(&self) -> &'static str {
-        "a node called synchronously should declare the interface that is being called"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
             if !node.interfaces().is_empty() || node.node_type().is_external() {
                 continue;
             }

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1997465) panicked at crates/casm-validator/src/rules.rs:937:13:
sync-targets-should-declare-interfaces has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 80 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
