*** crates/casm-validator/src/rules.rs:385:9: replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::description -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::description -> &'static str with "xyzzy"
@@ -377,17 +377,17 @@
 pub struct SyncTargetsShouldDeclareInterfaces;
 
 impl Rule for SyncTargetsShouldDeclareInterfaces {
     fn id(&self) -> &'static str {
         "sync-targets-should-declare-interfaces"
     }
 
     fn description(&self) -> &'static str {
-        "a node called synchronously should declare the interface that is being called"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
             if !node.interfaces().is_empty() || node.node_type().is_external() {
                 continue;
             }

*** result: Success
