*** crates/casm-validator/src/rules.rs:390:16: delete ! in <impl Rule for SyncTargetsShouldDeclareInterfaces>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for SyncTargetsShouldDeclareInterfaces>::check
@@ -382,17 +382,17 @@
     }
 
     fn description(&self) -> &'static str {
         "a node called synchronously should declare the interface that is being called"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
-            if !node.interfaces().is_empty() || node.node_type().is_external() {
+            if  /* ~ changed by cargo-mutants ~ */node.interfaces().is_empty() || node.node_type().is_external() {
                 continue;
             }
 
             let called_synchronously = context
                 .architecture
                 .incoming(node.id())
                 .any(|edge| edge.relationship_type() == RelationshipType::Sync);

---- rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only stdout ----

thread 'rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only' (1998743) panicked at crates/casm-validator/src/rules.rs:877:14:
rule should have fired

---- rules::tests::declaring_an_interface_satisfies_the_sync_target_rule stdout ----

thread 'rules::tests::declaring_an_interface_satisfies_the_sync_target_rule' (1998751) panicked at crates/casm-validator/src/rules.rs:907:9:
assertion failed: !has(&architecture, "sync-targets-should-declare-interfaces")

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (1998769) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
info[sync-targets-should-declare-interfaces]: node 'orders': is called synchronously but declares no interfaces, so its contract cannot be version-checked
  help: add an 'interfaces' entry naming the protocol and semantic version callers depend on
info[sync-targets-should-declare-interfaces]: node 'orders-db': is called synchronously but declares no interfaces, so its contract cannot be version-checked
  help: add an 'interfaces' entry naming the protocol and semantic version callers depend on

failures:
    rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only
    rules::tests::declaring_an_interface_satisfies_the_sync_target_rule
    tests::a_healthy_architecture_produces_a_clean_report

test result: FAILED. 78 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
