*** crates/casm-validator/src/rules.rs:397:54: replace == with != in <impl Rule for SyncTargetsShouldDeclareInterfaces>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace == with != in <impl Rule for SyncTargetsShouldDeclareInterfaces>::check
@@ -389,17 +389,17 @@
         for node in context.architecture.nodes() {
             if !node.interfaces().is_empty() || node.node_type().is_external() {
                 continue;
             }
 
             let called_synchronously = context
                 .architecture
                 .incoming(node.id())
-                .any(|edge| edge.relationship_type() == RelationshipType::Sync);
+                .any(|edge| edge.relationship_type() != /* ~ changed by cargo-mutants ~ */ RelationshipType::Sync);
 
             if !called_synchronously {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),

---- rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only stdout ----

thread 'rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only' (1150830) panicked at crates/casm-validator/src/rules.rs:877:14:
rule should have fired

failures:
    rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
