*** crates/casm-validator/src/rules.rs:399:16: delete ! in <impl Rule for SyncTargetsShouldDeclareInterfaces>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for SyncTargetsShouldDeclareInterfaces>::check
@@ -391,17 +391,17 @@
                 continue;
             }
 
             let called_synchronously = context
                 .architecture
                 .incoming(node.id())
                 .any(|edge| edge.relationship_type() == RelationshipType::Sync);
 
-            if !called_synchronously {
+            if  /* ~ changed by cargo-mutants ~ */called_synchronously {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Info,
                     RuleContext::subject(node),

---- rules::tests::declaring_an_interface_satisfies_the_sync_target_rule stdout ----

thread 'rules::tests::declaring_an_interface_satisfies_the_sync_target_rule' (1151355) panicked at crates/casm-validator/src/rules.rs:907:9:
assertion failed: !has(&architecture, "sync-targets-should-declare-interfaces")

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (1151377) panicked at crates/casm-validator/src/lib.rs:307:9:
still reported:
info[sync-targets-should-declare-interfaces]: node 'db': is called synchronously but declares no interfaces, so its contract cannot be version-checked
  help: add an 'interfaces' entry naming the protocol and semantic version callers depend on

failures:
    rules::tests::declaring_an_interface_satisfies_the_sync_target_rule
    tests::suppressed_rules_do_not_fire

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
