*** crates/casm-validator/src/rules.rs:433:9: replace <impl Rule for PatternsAreSatisfied>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for PatternsAreSatisfied>::description -> &'static str with ""
@@ -425,17 +425,17 @@
 pub struct PatternsAreSatisfied;
 
 impl Rule for PatternsAreSatisfied {
     fn id(&self) -> &'static str {
         "patterns-are-satisfied"
     }
 
     fn description(&self) -> &'static str {
-        "every pattern the architecture claims conformance to must be satisfied"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for claim in context.architecture.conformance() {
             let reference = claim.pattern().to_string();
             let subject = Subject::Pattern {
                 reference: reference.clone(),
             };

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (1152204) panicked at crates/casm-validator/src/rules.rs:937:13:
patterns-are-satisfied has no description

failures:
    rules::tests::every_built_in_rule_documents_itself

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
