*** crates/casm-validator/src/rules.rs:437:9: replace <impl Rule for PatternsAreSatisfied>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for PatternsAreSatisfied>::check with ()
@@ -429,48 +429,17 @@
         "patterns-are-satisfied"
     }
 
     fn description(&self) -> &'static str {
         "every pattern the architecture claims conformance to must be satisfied"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
-        for claim in context.architecture.conformance() {
-            let reference = claim.pattern().to_string();
-            let subject = Subject::Pattern {
-                reference: reference.clone(),
-            };
-
-            let Some(pattern) = context
-                .patterns
-                .iter()
-                .find(|pattern| claim.pattern().matches(pattern))
-            else {
-                report.push(unavailable(
-                    self.id(),
-                    subject,
-                    &reference,
-                    context.patterns,
-                ));
-                continue;
-            };
-
-            for unmet in conformance::check(context.architecture, pattern, claim).unmet() {
-                report.push(
-                    Diagnostic::new(self.id(), Severity::Error, subject.clone(), unmet.message())
-                        .with_suggestion(if unmet.is_mechanical() {
-                            "run 'casm evolve' to see the change this needs, or drop the claim"
-                        } else {
-                            "this needs a decision rather than an edit: bind the role \
-                         explicitly, or add the node the pattern requires"
-                        }),
-                );
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Builds the finding for a claim naming a pattern nobody supplied.
 ///
 /// A warning rather than an error: the claim may be perfectly true, and the run simply
 /// had no library to check it against. Reporting it as an error would make `casm
 /// validate` fail for everyone who has not passed `--patterns`, which teaches people to

---- rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error stdout ----

thread 'rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error' (2001902) panicked at crates/casm-validator/src/rules.rs:1023:9:
assertion `left == right` failed: []
  left: 0
 right: 1

---- rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied stdout ----

thread 'rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied' (2001901) panicked at crates/casm-validator/src/rules.rs:1044:9:
assertion `left == right` failed: []
  left: 0
 right: 1

---- rules::tests::a_decision_and_an_edit_get_different_suggestions stdout ----

thread 'rules::tests::a_decision_and_an_edit_get_different_suggestions' (2001905) panicked at crates/casm-validator/src/rules.rs:1062:23:
index out of bounds: the len is 0 but the index is 0

failures:
    rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied
    rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error
    rules::tests::a_decision_and_an_edit_get_different_suggestions
    rules::tests::an_unsatisfied_claim_is_an_error_naming_the_pattern

test result: FAILED. 77 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
