*** crates/casm-validator/src/rules.rs:509:5: replace built_in -> Vec<Box<dyn Rule>> with vec![]

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace built_in -> Vec<Box<dyn Rule>> with vec![]
@@ -501,27 +501,17 @@
 }
 
 /// Returns the complete built-in rule library, in execution order.
 ///
 /// Order matters only for output readability: errors that explain other findings come
 /// first, so a reader meets the root cause before its consequences.
 #[must_use]
 pub fn built_in() -> Vec<Box<dyn Rule>> {
-    vec![
-        Box::new(NoDependencyCycles),
-        Box::new(NoPubliclyExposedDatastores),
-        Box::new(CriticalPathWithinBudget),
-        Box::new(ServicesRequireSecurityControls),
-        Box::new(StatefulNodesRequireControls),
-        Box::new(BoundaryCrossingsRequireControls),
-        Box::new(NoIsolatedNodes),
-        Box::new(SyncTargetsShouldDeclareInterfaces),
-        Box::new(PatternsAreSatisfied),
-    ]
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- rules::tests::an_external_system_reaching_a_database_is_an_error stdout ----

thread 'rules::tests::an_external_system_reaching_a_database_is_an_error' (1153244) panicked at crates/casm-validator/src/rules.rs:610:9:
assertion failed: report.has_errors()

---- rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only stdout ----

thread 'rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only' (1153242) panicked at crates/casm-validator/src/rules.rs:867:14:
rule should have fired

---- rules::tests::a_service_without_security_controls_warns stdout ----

thread 'rules::tests::a_service_without_security_controls_warns' (1153240) panicked at crates/casm-validator/src/rules.rs:649:9:
assertion failed: has(&architecture, "services-require-security-controls")

failures:
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::a_service_without_security_controls_warns
    rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only
    rules::tests::an_external_system_reaching_a_database_is_an_error
    rules::tests::an_isolated_node_warns_but_a_lone_node_does_not
    rules::tests::an_over_budget_critical_path_warns
    rules::tests::an_uncontrolled_boundary_crossing_warns
    rules::tests::an_uncontrolled_database_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::reports_render_and_serialise_to_sarif
    tests::suppressed_rules_do_not_fire
    tests::the_default_validator_exposes_its_rule_set

test result: FAILED. 67 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
