*** crates/casm-validator/src/rules.rs:84:9: replace <impl Rule for NoDependencyCycles>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoDependencyCycles>::id -> &'static str with "xyzzy"
@@ -76,17 +76,17 @@
 /// Blocking dependencies must not form a cycle.
 ///
 /// A cycle among blocking edges means no deployment order exists and a failure anywhere
 /// in the ring propagates to every member.
 pub struct NoDependencyCycles;
 
 impl Rule for NoDependencyCycles {
     fn id(&self) -> &'static str {
-        "no-dependency-cycles"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "blocking dependencies (sync, depends-on, composed, quantum-entangled) must be acyclic"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for cycle in context.graph.cycles() {

---- rules::tests::a_dependency_cycle_is_an_error stdout ----

thread 'rules::tests::a_dependency_cycle_is_an_error' (1974513) panicked at crates/casm-validator/src/rules.rs:595:9:
assertion failed: has(&architecture, "no-dependency-cycles")

---- tests::the_default_validator_exposes_its_rule_set stdout ----

thread 'tests::the_default_validator_exposes_its_rule_set' (1974550) panicked at crates/casm-validator/src/lib.rs:361:9:
assertion failed: ids.contains(&"no-dependency-cycles")

failures:
    rules::tests::a_dependency_cycle_is_an_error
    tests::the_default_validator_exposes_its_rule_set

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
