*** crates/casm-validator/src/sarif.rs:112:5: replace logical_locations -> Vec<Value> with vec![Default::default()]

*** mutation diff:
--- crates/casm-validator/src/sarif.rs
+++ replace logical_locations -> Vec<Value> with vec![Default::default()]
@@ -104,35 +104,17 @@
 }
 
 /// Maps a diagnostic subject onto SARIF logical locations.
 ///
 /// Logical locations are how SARIF expresses "this finding is about a named thing"
 /// when there is no line number to point at — exactly the case for an architecture
 /// element identified by name rather than position.
 fn logical_locations(subject: &Subject) -> Vec<Value> {
-    match subject {
-        Subject::Architecture => {
-            vec![json!({ "name": "architecture", "kind": "module" })]
-        }
-        Subject::Node { name, .. } => {
-            vec![json!({ "name": name, "kind": "resource" })]
-        }
-        Subject::Relationship { source, target } => vec![json!({
-            "name": format!("{source} -> {target}"),
-            "kind": "member",
-        })],
-        Subject::NodeSet { names } => names
-            .iter()
-            .map(|name| json!({ "name": name, "kind": "resource" }))
-            .collect(),
-        Subject::Pattern { reference } => {
-            vec![json!({ "name": reference, "kind": "namespace" })]
-        }
-    }
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- sarif::tests::a_relationship_subject_renders_as_an_arrow stdout ----

thread 'sarif::tests::a_relationship_subject_renders_as_an_arrow' (1156192) panicked at crates/casm-validator/src/sarif.rs:262:9:
assertion `left == right` failed
  left: Null
 right: "api -> db"

---- sarif::tests::a_node_set_produces_one_logical_location_per_member stdout ----

thread 'sarif::tests::a_node_set_produces_one_logical_location_per_member' (1156190) panicked at crates/casm-validator/src/sarif.rs:246:9:
assertion `left == right` failed
  left: 1
 right: 3

---- sarif::tests::a_node_subject_becomes_a_named_logical_location stdout ----

thread 'sarif::tests::a_node_subject_becomes_a_named_logical_location' (1156191) panicked at crates/casm-validator/src/sarif.rs:229:9:
assertion `left == right` failed
  left: Null
 right: "orders-db"

failures:
    sarif::tests::a_node_set_produces_one_logical_location_per_member
    sarif::tests::a_node_subject_becomes_a_named_logical_location
    sarif::tests::a_relationship_subject_renders_as_an_arrow

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
