*** crates/casm-validator/src/sarif.rs:34:5: replace to_value -> Value with Default::default()

*** mutation diff:
--- crates/casm-validator/src/sarif.rs
+++ replace to_value -> Value with Default::default()
@@ -26,24 +26,17 @@
 pub const SARIF_SCHEMA: &str = "https://json.schemastore.org/sarif-2.1.0.json";
 
 /// Renders a report as a SARIF 2.1.0 document.
 ///
 /// `artifact` is the path recorded against every result — the architecture file the run
 /// was about.
 #[must_use]
 pub fn to_value(report: &Report, artifact: &str) -> Value {
-    json!({
-        "$schema": SARIF_SCHEMA,
-        "version": SARIF_VERSION,
-        "runs": [{
-            "tool": { "driver": driver() },
-            "results": report.diagnostics.iter().map(|d| result(d, artifact)).collect::<Vec<_>>(),
-        }],
-    })
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a report as pretty-printed SARIF JSON.
 ///
 /// # Errors
 ///
 /// Returns a message if serialisation fails, which for a `Value` built here means an
 /// allocator failure rather than a data problem.

---- sarif::tests::a_node_set_produces_one_logical_location_per_member stdout ----

thread 'sarif::tests::a_node_set_produces_one_logical_location_per_member' (2003554) panicked at crates/casm-validator/src/sarif.rs:256:14:
called `Option::unwrap()` on a `None` value

---- sarif::tests::a_node_subject_becomes_a_named_logical_location stdout ----

thread 'sarif::tests::a_node_subject_becomes_a_named_logical_location' (2003555) panicked at crates/casm-validator/src/sarif.rs:240:9:
assertion `left == right` failed
  left: Null
 right: "orders-db"

---- sarif::tests::severities_map_onto_sarif_levels stdout ----

thread 'sarif::tests::severities_map_onto_sarif_levels' (2003559) panicked at crates/casm-validator/src/sarif.rs:193:13:
assertion `left == right` failed
  left: Null
 right: "error"

failures:
    sarif::tests::a_node_set_produces_one_logical_location_per_member
    sarif::tests::a_node_subject_becomes_a_named_logical_location
    sarif::tests::a_relationship_subject_renders_as_an_arrow
    sarif::tests::an_empty_report_still_produces_a_valid_run
    sarif::tests::document_declares_the_schema_and_version
    sarif::tests::severities_map_onto_sarif_levels
    sarif::tests::string_output_reparses_as_json
    sarif::tests::the_artifact_path_is_recorded_on_every_result
    sarif::tests::the_driver_catalogues_every_built_in_rule
    sarif::tests::the_driver_reports_the_crate_version
    sarif::tests::the_suggestion_is_folded_into_the_message
    tests::reports_render_and_serialise_to_sarif

test result: FAILED. 69 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
