*** crates/casm-validator/src/sarif.rs:51:5: replace to_string -> Result<String, String> with Ok(String::new())

*** mutation diff:
--- crates/casm-validator/src/sarif.rs
+++ replace to_string -> Result<String, String> with Ok(String::new())
@@ -43,22 +43,17 @@
 
 /// Renders a report as pretty-printed SARIF JSON.
 ///
 /// # Errors
 ///
 /// Returns a message if serialisation fails, which for a `Value` built here means an
 /// allocator failure rather than a data problem.
 pub fn to_string(report: &Report, artifact: &str) -> Result<String, String> {
-    serde_json::to_string_pretty(&to_value(report, artifact))
-        .map(|mut json| {
-            json.push('\n');
-            json
-        })
-        .map_err(|error| error.to_string())
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Builds the SARIF tool driver, including the full catalogue of built-in rules.
 ///
 /// The catalogue is emitted whether or not a rule fired, so a dashboard can show
 /// "0 findings for `no-dependency-cycles`" rather than staying silent about a rule it
 /// has never seen.
 fn driver() -> Value {

---- sarif::tests::string_output_is_pretty_printed_and_newline_terminated stdout ----

thread 'sarif::tests::string_output_is_pretty_printed_and_newline_terminated' (2003642) panicked at crates/casm-validator/src/sarif.rs:281:9:
assertion failed: text.contains('\n')

---- sarif::tests::string_output_reparses_as_json stdout ----

thread 'sarif::tests::string_output_reparses_as_json' (2003643) panicked at crates/casm-validator/src/sarif.rs:288:59:
called `Result::unwrap()` on an `Err` value: Error("EOF while parsing a value", line: 1, column: 0)

---- tests::reports_render_and_serialise_to_sarif stdout ----

thread 'tests::reports_render_and_serialise_to_sarif' (2003653) panicked at crates/casm-validator/src/lib.rs:440:9:

failures:
    sarif::tests::string_output_is_pretty_printed_and_newline_terminated
    sarif::tests::string_output_reparses_as_json
    tests::reports_render_and_serialise_to_sarif

test result: FAILED. 78 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
