*** crates/casm-validator/src/sarif.rs:65:5: replace driver -> Value with Default::default()

*** mutation diff:
--- crates/casm-validator/src/sarif.rs
+++ replace driver -> Value with Default::default()
@@ -57,34 +57,17 @@
 }
 
 /// Builds the SARIF tool driver, including the full catalogue of built-in rules.
 ///
 /// The catalogue is emitted whether or not a rule fired, so a dashboard can show
 /// "0 findings for `no-dependency-cycles`" rather than staying silent about a rule it
 /// has never seen.
 fn driver() -> Value {
-    let rules: Vec<Value> = rules::built_in()
-        .iter()
-        .map(|rule| {
-            json!({
-                "id": rule.id(),
-                "name": rule.id(),
-                "shortDescription": { "text": rule.description() },
-                "helpUri": format!("https://github.com/casimirex/casimir#{}", rule.id()),
-            })
-        })
-        .collect();
-
-    json!({
-        "name": "casm",
-        "version": env!("CARGO_PKG_VERSION"),
-        "informationUri": "https://github.com/casimirex/casimir",
-        "rules": rules,
-    })
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Builds a single SARIF result from a diagnostic.
 fn result(diagnostic: &Diagnostic, artifact: &str) -> Value {
     let mut message = diagnostic.message.clone();
     if let Some(hint) = &diagnostic.suggestion {
         message.push_str("\n\nSuggestion: ");
         message.push_str(hint);

---- sarif::tests::the_driver_catalogues_every_built_in_rule stdout ----

thread 'sarif::tests::the_driver_catalogues_every_built_in_rule' (2003859) panicked at crates/casm-validator/src/sarif.rs:155:14:
called `Option::unwrap()` on a `None` value

---- sarif::tests::the_driver_reports_the_crate_version stdout ----

thread 'sarif::tests::the_driver_reports_the_crate_version' (2003860) panicked at crates/casm-validator/src/sarif.rs:163:9:
assertion `left == right` failed
  left: Null
 right: "0.3.0"

failures:
    sarif::tests::the_driver_catalogues_every_built_in_rule
    sarif::tests::the_driver_reports_the_crate_version

test result: FAILED. 79 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
