*** crates/casm-validator/src/sarif.rs:87:5: replace result -> Value with Default::default()

*** mutation diff:
--- crates/casm-validator/src/sarif.rs
+++ replace result -> Value with Default::default()
@@ -79,33 +79,17 @@
         "version": env!("CARGO_PKG_VERSION"),
         "informationUri": "https://github.com/casimirex/casimir",
         "rules": rules,
     })
 }
 
 /// Builds a single SARIF result from a diagnostic.
 fn result(diagnostic: &Diagnostic, artifact: &str) -> Value {
-    let mut message = diagnostic.message.clone();
-    if let Some(hint) = &diagnostic.suggestion {
-        message.push_str("\n\nSuggestion: ");
-        message.push_str(hint);
-    }
-
-    json!({
-        "ruleId": diagnostic.rule,
-        "level": diagnostic.severity.sarif_level(),
-        "message": { "text": message },
-        "locations": [{
-            "physicalLocation": {
-                "artifactLocation": { "uri": artifact },
-            },
-            "logicalLocations": logical_locations(&diagnostic.subject),
-        }],
-    })
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps a diagnostic subject onto SARIF logical locations.
 ///
 /// Logical locations are how SARIF expresses "this finding is about a named thing"
 /// when there is no line number to point at — exactly the case for an architecture
 /// element identified by name rather than position.
 fn logical_locations(subject: &Subject) -> Vec<Value> {

---- sarif::tests::a_node_set_produces_one_logical_location_per_member stdout ----

thread 'sarif::tests::a_node_set_produces_one_logical_location_per_member' (2004925) panicked at crates/casm-validator/src/sarif.rs:247:14:
called `Option::unwrap()` on a `None` value

---- sarif::tests::a_node_subject_becomes_a_named_logical_location stdout ----

thread 'sarif::tests::a_node_subject_becomes_a_named_logical_location' (2004926) panicked at crates/casm-validator/src/sarif.rs:231:9:
assertion `left == right` failed
  left: Null
 right: "orders-db"

---- sarif::tests::a_relationship_subject_renders_as_an_arrow stdout ----

thread 'sarif::tests::a_relationship_subject_renders_as_an_arrow' (2004927) panicked at crates/casm-validator/src/sarif.rs:264:9:
assertion `left == right` failed
  left: Null
 right: "api -> db"

failures:
    sarif::tests::a_node_set_produces_one_logical_location_per_member
    sarif::tests::a_node_subject_becomes_a_named_logical_location
    sarif::tests::a_relationship_subject_renders_as_an_arrow
    sarif::tests::severities_map_onto_sarif_levels
    sarif::tests::the_artifact_path_is_recorded_on_every_result
    sarif::tests::the_suggestion_is_folded_into_the_message

test result: FAILED. 75 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
