*** crates/casm-wasm/src/api.rs:116:5: replace validate -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace validate -> String with "xyzzy".into()
@@ -108,17 +108,17 @@
 ///
 /// Never fails: a document that cannot be parsed yields `parsed: false` and a syntax
 /// diagnostic.
 ///
 /// Checks no conformance claim, because it is given no library to check one against — see
 /// [`validate_with_patterns`].
 #[must_use]
 pub fn validate(source: &str) -> String {
-    validate_with_patterns(source, "")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Validates a document against a pattern library.
 ///
 /// `patterns` is a JSON array of pattern documents, each a string in YAML, JSON, or TOML —
 /// the same text a `patterns/` directory holds on disk. An empty string means no library,
 /// which is exactly what [`validate`] passes.
 ///

---- api::tests::a_claim_is_unchecked_without_a_library stdout ----

thread 'api::tests::a_claim_is_unchecked_without_a_library' (1169379) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: expected value at line 1 column 1
xyzzy

---- api::tests::a_broken_document_yields_a_result_rather_than_an_error stdout ----

thread 'api::tests::a_broken_document_yields_a_result_rather_than_an_error' (1169377) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: expected value at line 1 column 1
xyzzy

---- api::tests::a_converted_document_still_parses stdout ----

thread 'api::tests::a_converted_document_still_parses' (1169380) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: expected value at line 1 column 1
xyzzy

failures:
    api::tests::a_broken_document_yields_a_result_rather_than_an_error
    api::tests::a_claim_is_unchecked_without_a_library
    api::tests::a_converted_document_still_parses
    api::tests::every_entry_point_returns_parseable_json
    api::tests::exit_codes_match_the_command_line
    api::tests::supplying_no_library_matches_the_older_entry_points_exactly
    api::tests::validating_a_good_document_reports_its_shape_and_fingerprint
    api::tests::validating_reports_findings_with_positions

test result: FAILED. 39 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.85s

*** result: Failure(101)
