*** crates/casm-wasm/src/api.rs:129:5: replace validate_with_patterns -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace validate_with_patterns -> String with String::new()
@@ -121,71 +121,17 @@
 /// `patterns` is a JSON array of pattern documents, each a string in YAML, JSON, or TOML —
 /// the same text a `patterns/` directory holds on disk. An empty string means no library,
 /// which is exactly what [`validate`] passes.
 ///
 /// A browser has no filesystem to discover a library in, so the caller supplies one. That
 /// is the whole difference between this and the language server, which finds its own.
 #[must_use]
 pub fn validate_with_patterns(source: &str, patterns: &str) -> String {
-    let library = Library::read(patterns);
-    let index = DocumentIndex::build(source);
-    let analysis = casm_lsp::diagnostics::analyse(
-        source,
-        Path::new(VIRTUAL_PATH),
-        &index,
-        &ValidatorConfig::default(),
-        &library.patterns,
-    );
-
-    let diagnostics: Vec<WasmDiagnostic> = analysis
-        .diagnostics
-        .iter()
-        .map(|diagnostic| WasmDiagnostic {
-            severity: match diagnostic.severity {
-                Severity::Error => "error",
-                Severity::Warning => "warning",
-                Severity::Info => "info",
-            },
-            rule: diagnostic.code.clone(),
-            message: diagnostic.message.clone(),
-            line: diagnostic.span.line,
-            start: diagnostic.span.start,
-            end: diagnostic.span.end,
-        })
-        .collect();
-
-    let errors = diagnostics.iter().filter(|d| d.severity == "error").count();
-    let warnings = diagnostics
-        .iter()
-        .filter(|d| d.severity == "warning")
-        .count();
-
-    // The same mapping `Report::exit_code` makes, so a page and a pipeline never
-    // disagree about whether a document passed.
-    let exit_code = match (errors, warnings) {
-        (0, 0) => 0,
-        (0, _) => 1,
-        _ => 2,
-    };
-
-    let architecture = analysis.architecture.as_ref();
-
-    to_json(&ValidationResult {
-        valid: errors == 0 && architecture.is_some(),
-        parsed: architecture.is_some(),
-        exit_code,
-        summary: format!("{errors} error(s), {warnings} warning(s)"),
-        fingerprint: architecture.map(|arch| merkle::fingerprint(arch).to_hex()),
-        node_count: architecture.map_or(0, casm_core::Architecture::node_count),
-        relationship_count: architecture.map_or(0, casm_core::Architecture::relationship_count),
-        diagnostics,
-        patterns_loaded: library.patterns.len(),
-        pattern_errors: library.errors,
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A pattern library supplied across the ABI, and whatever failed to load.
 ///
 /// Reading is total. A malformed source becomes an entry in `errors` and the rest of the
 /// library still loads — a page that stopped validating because one pattern had a typo
 /// would be worse than one that says which pattern.
 struct Library {

---- api::tests::a_broken_document_yields_a_result_rather_than_an_error stdout ----

thread 'api::tests::a_broken_document_yields_a_result_rather_than_an_error' (1169989) panicked at crates/casm-wasm/src/api.rs:728:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::a_claim_is_checked_once_a_library_is_supplied stdout ----

thread 'api::tests::a_claim_is_checked_once_a_library_is_supplied' (1169990) panicked at crates/casm-wasm/src/api.rs:728:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::a_claim_is_unchecked_without_a_library stdout ----

thread 'api::tests::a_claim_is_unchecked_without_a_library' (1169991) panicked at crates/casm-wasm/src/api.rs:728:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::a_broken_document_yields_a_result_rather_than_an_error
    api::tests::a_claim_is_checked_once_a_library_is_supplied
    api::tests::a_claim_is_unchecked_without_a_library
    api::tests::a_converted_document_still_parses
    api::tests::a_malformed_library_is_reported_as_a_value_not_a_trap
    api::tests::an_empty_library_is_not_an_error
    api::tests::an_unmet_requirement_is_an_error_across_the_boundary
    api::tests::every_entry_point_returns_parseable_json
    api::tests::exit_codes_match_the_command_line
    api::tests::one_broken_pattern_does_not_discard_the_rest
    api::tests::validating_a_good_document_reports_its_shape_and_fingerprint
    api::tests::validating_reports_findings_with_positions

test result: FAILED. 35 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.73s

*** result: Failure(101)
