*** crates/casm-wasm/src/api.rs:156:59: replace == with != in validate_with_patterns

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace == with != in validate_with_patterns
@@ -148,17 +148,17 @@
             rule: diagnostic.code.clone(),
             message: diagnostic.message.clone(),
             line: diagnostic.span.line,
             start: diagnostic.span.start,
             end: diagnostic.span.end,
         })
         .collect();
 
-    let errors = diagnostics.iter().filter(|d| d.severity == "error").count();
+    let errors = diagnostics.iter().filter(|d| d.severity != /* ~ changed by cargo-mutants ~ */ "error").count();
     let warnings = diagnostics
         .iter()
         .filter(|d| d.severity == "warning")
         .count();
 
     // The same mapping `Report::exit_code` makes, so a page and a pipeline never
     // disagree about whether a document passed.
     let exit_code = match (errors, warnings) {

---- api::tests::a_broken_document_yields_a_result_rather_than_an_error stdout ----

thread 'api::tests::a_broken_document_yields_a_result_rather_than_an_error' (1170040) panicked at crates/casm-wasm/src/api.rs:838:9:
assertion `left == right` failed
  left: Number(0)
 right: 2

---- api::tests::a_claim_is_checked_once_a_library_is_supplied stdout ----

thread 'api::tests::a_claim_is_checked_once_a_library_is_supplied' (1170041) panicked at crates/casm-wasm/src/api.rs:1193:9:
assertion `left == right` failed
  left: Bool(false)
 right: true

---- api::tests::exit_codes_match_the_command_line stdout ----

thread 'api::tests::exit_codes_match_the_command_line' (1170076) panicked at crates/casm-wasm/src/api.rs:862:9:
assertion `left == right` failed: warnings only
  left: Number(2)
 right: 1

failures:
    api::tests::a_broken_document_yields_a_result_rather_than_an_error
    api::tests::a_claim_is_checked_once_a_library_is_supplied
    api::tests::exit_codes_match_the_command_line

test result: FAILED. 44 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.75s

*** result: Failure(101)
