*** crates/casm-wasm/src/api.rs:165:9: delete match arm (0, 0) in validate_with_patterns

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ delete match arm (0, 0) in validate_with_patterns
@@ -157,17 +157,17 @@
     let warnings = diagnostics
         .iter()
         .filter(|d| d.severity == "warning")
         .count();
 
     // The same mapping `Report::exit_code` makes, so a page and a pipeline never
     // disagree about whether a document passed.
     let exit_code = match (errors, warnings) {
-        (0, 0) => 0,
+         /* ~ changed by cargo-mutants ~ */
         (0, _) => 1,
         _ => 2,
     };
 
     let architecture = analysis.architecture.as_ref();
 
     to_json(&ValidationResult {
         valid: errors == 0 && architecture.is_some(),

---- api::tests::exit_codes_match_the_command_line stdout ----

thread 'api::tests::exit_codes_match_the_command_line' (1171028) panicked at crates/casm-wasm/src/api.rs:861:9:
assertion `left == right` failed
  left: Number(1)
 right: 0

failures:
    api::tests::exit_codes_match_the_command_line

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.21s

*** result: Failure(101)
