*** crates/casm-wasm/src/api.rs:166:9: delete match arm (0, _) in validate_with_patterns

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ delete match arm (0, _) in validate_with_patterns
@@ -158,17 +158,17 @@
         .iter()
         .filter(|d| d.severity == "warning")
         .count();
 
     // The same mapping `Report::exit_code` makes, so a page and a pipeline never
     // disagree about whether a document passed.
     let exit_code = match (errors, warnings) {
         (0, 0) => 0,
-        (0, _) => 1,
+         /* ~ changed by cargo-mutants ~ */
         _ => 2,
     };
 
     let architecture = analysis.architecture.as_ref();
 
     to_json(&ValidationResult {
         valid: errors == 0 && architecture.is_some(),
         parsed: architecture.is_some(),

---- api::tests::exit_codes_match_the_command_line stdout ----

thread 'api::tests::exit_codes_match_the_command_line' (1171081) panicked at crates/casm-wasm/src/api.rs:862:9:
assertion `left == right` failed: warnings only
  left: Number(2)
 right: 1

failures:
    api::tests::exit_codes_match_the_command_line

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.30s

*** result: Failure(101)
