*** crates/casm-wasm/src/api.rs:173:28: replace && with || in validate_with_patterns

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace && with || in validate_with_patterns
@@ -165,17 +165,17 @@
         (0, 0) => 0,
         (0, _) => 1,
         _ => 2,
     };
 
     let architecture = analysis.architecture.as_ref();
 
     to_json(&ValidationResult {
-        valid: errors == 0 && architecture.is_some(),
+        valid: errors == 0 || /* ~ changed by cargo-mutants ~ */ architecture.is_some(),
         parsed: architecture.is_some(),
         exit_code,
         summary: format!("{errors} error(s), {warnings} warning(s)"),
         fingerprint: architecture.map(|arch| merkle::fingerprint(arch).to_hex()),
         node_count: architecture.map_or(0, casm_core::Architecture::node_count),
         relationship_count: architecture.map_or(0, casm_core::Architecture::relationship_count),
         diagnostics,
         patterns_loaded: library.patterns.len(),

---- api::tests::an_unmet_requirement_is_an_error_across_the_boundary stdout ----

thread 'api::tests::an_unmet_requirement_is_an_error_across_the_boundary' (1171117) panicked at crates/casm-wasm/src/api.rs:1212:9:
assertion `left == right` failed
  left: Bool(true)
 right: false

failures:
    api::tests::an_unmet_requirement_is_an_error_across_the_boundary

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.10s

*** result: Failure(101)
