*** crates/casm-wasm/src/api.rs:250:5: replace render -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace render -> String with String::new()
@@ -242,40 +242,17 @@
     pub diagram: String,
     /// Why rendering failed, when it did.
     pub error: Option<String>,
 }
 
 /// Renders a document with the named backend: `mermaid`, `dot`, or `ascii`.
 #[must_use]
 pub fn render(source: &str, backend: &str) -> String {
-    let Some(renderer) = casm_renderer::by_id(backend) else {
-        let available: Vec<&str> = casm_renderer::built_in().iter().map(|b| b.id()).collect();
-        return to_json(&RenderResult {
-            ok: false,
-            diagram: String::new(),
-            error: Some(format!(
-                "unknown backend '{backend}'; available: {}",
-                available.join(", ")
-            )),
-        });
-    };
-
-    match casm_parser::parse_str(source, Path::new(VIRTUAL_PATH)) {
-        Ok(architecture) => to_json(&RenderResult {
-            ok: true,
-            diagram: renderer.render(&architecture),
-            error: None,
-        }),
-        Err(error) => to_json(&RenderResult {
-            ok: false,
-            diagram: String::new(),
-            error: Some(error.render()),
-        }),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A document's semantic identity.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct FingerprintResult {
     /// `true` if the document parsed.
     pub ok: bool,

---- api::tests::an_unknown_backend_is_reported_with_the_ones_that_exist stdout ----

thread 'api::tests::an_unknown_backend_is_reported_with_the_ones_that_exist' (1172023) panicked at crates/casm-wasm/src/api.rs:759:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::rendering_produces_a_diagram_for_each_backend stdout ----

thread 'api::tests::rendering_produces_a_diagram_for_each_backend' (1172052) panicked at crates/casm-wasm/src/api.rs:759:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::rendering_a_broken_document_reports_the_parse_error stdout ----

thread 'api::tests::rendering_a_broken_document_reports_the_parse_error' (1172051) panicked at crates/casm-wasm/src/api.rs:759:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::an_unknown_backend_is_reported_with_the_ones_that_exist
    api::tests::every_entry_point_returns_parseable_json
    api::tests::rendering_a_broken_document_reports_the_parse_error
    api::tests::rendering_produces_a_diagram_for_each_backend

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.40s

*** result: Failure(101)
