*** crates/casm-wasm/src/api.rs:295:5: replace fingerprint -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace fingerprint -> String with String::new()
@@ -287,39 +287,17 @@
     pub nodes: std::collections::BTreeMap<String, String>,
     /// Why fingerprinting failed, when it did.
     pub error: Option<String>,
 }
 
 /// Computes a document's semantic fingerprint and per-node digests.
 #[must_use]
 pub fn fingerprint(source: &str) -> String {
-    match casm_parser::parse_str(source, Path::new(VIRTUAL_PATH)) {
-        Ok(architecture) => {
-            let tree = merkle::MerkleTree::of(&architecture);
-            to_json(&FingerprintResult {
-                ok: true,
-                fingerprint: Some(tree.root().to_hex()),
-                short: Some(tree.root().abbreviated(12)),
-                nodes: tree
-                    .nodes()
-                    .iter()
-                    .map(|(name, digest)| (name.clone(), digest.to_hex()))
-                    .collect(),
-                error: None,
-            })
-        }
-        Err(error) => to_json(&FingerprintResult {
-            ok: false,
-            fingerprint: None,
-            short: None,
-            nodes: std::collections::BTreeMap::new(),
-            error: Some(error.render()),
-        }),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The semantic difference between two documents.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct DiffResult {
     /// `true` if both documents parsed.
     pub ok: bool,

---- api::tests::fingerprinting_exposes_per_node_digests stdout ----

thread 'api::tests::fingerprinting_exposes_per_node_digests' (1172123) panicked at crates/casm-wasm/src/api.rs:760:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::every_entry_point_returns_parseable_json stdout ----

thread 'api::tests::every_entry_point_returns_parseable_json' (1172120) panicked at crates/casm-wasm/src/api.rs:760:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::every_entry_point_returns_parseable_json
    api::tests::fingerprinting_exposes_per_node_digests

test result: FAILED. 45 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.34s

*** result: Failure(101)
