*** crates/casm-wasm/src/api.rs:339:5: replace diff -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace diff -> String with String::new()
@@ -331,46 +331,17 @@
     pub changes: Vec<String>,
     /// Why the comparison failed, when it did.
     pub error: Option<String>,
 }
 
 /// Compares two documents semantically.
 #[must_use]
 pub fn diff(before: &str, after: &str) -> String {
-    let parse = |source: &str, label: &str| {
-        casm_parser::parse_str(source, Path::new(VIRTUAL_PATH))
-            .map_err(|error| format!("{label}: {}", error.render()))
-    };
-
-    let (old, new) = match (parse(before, "before"), parse(after, "after")) {
-        (Ok(old), Ok(new)) => (old, new),
-        (Err(error), _) | (_, Err(error)) => {
-            return to_json(&DiffResult {
-                ok: false,
-                identical: false,
-                breaking: false,
-                changes: Vec::new(),
-                error: Some(error),
-            });
-        }
-    };
-
-    let difference = Diff::compute(&old, &new);
-    to_json(&DiffResult {
-        ok: true,
-        identical: difference.is_empty(),
-        breaking: difference.has_breaking_changes(),
-        changes: difference
-            .changes
-            .iter()
-            .map(|change| format!("{} {change}", change.marker()))
-            .collect(),
-        error: None,
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A reformatted document.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct FormatResult {
     /// `true` if the conversion succeeded.
     pub ok: bool,

---- api::tests::diffing_a_document_against_itself_is_empty stdout ----

thread 'api::tests::diffing_a_document_against_itself_is_empty' (1173077) panicked at crates/casm-wasm/src/api.rs:753:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::diffing_names_which_side_failed_to_parse stdout ----

thread 'api::tests::diffing_names_which_side_failed_to_parse' (1173078) panicked at crates/casm-wasm/src/api.rs:753:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::diffing_reports_a_breaking_removal stdout ----

thread 'api::tests::diffing_reports_a_breaking_removal' (1173079) panicked at crates/casm-wasm/src/api.rs:753:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::diffing_a_document_against_itself_is_empty
    api::tests::diffing_names_which_side_failed_to_parse
    api::tests::diffing_reports_a_breaking_removal
    api::tests::every_entry_point_returns_parseable_json

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.27s

*** result: Failure(101)
