*** crates/casm-wasm/src/api.rs:386:5: replace format -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace format -> String with String::new()
@@ -378,45 +378,17 @@
     pub output: String,
     /// Why the conversion failed, when it did.
     pub error: Option<String>,
 }
 
 /// Converts a document between `yaml`, `json`, and `toml`.
 #[must_use]
 pub fn format(source: &str, target: &str) -> String {
-    let format = match target {
-        "yaml" | "yml" => Format::Yaml,
-        "json" => Format::Json,
-        "toml" => Format::Toml,
-        other => {
-            return to_json(&FormatResult {
-                ok: false,
-                output: String::new(),
-                error: Some(format!(
-                    "unknown format '{other}'; expected yaml, json, or toml"
-                )),
-            });
-        }
-    };
-
-    match casm_parser::parse_str(source, Path::new(VIRTUAL_PATH))
-        .and_then(|architecture| casm_parser::emit_str(&architecture, format))
-    {
-        Ok(output) => to_json(&FormatResult {
-            ok: true,
-            output,
-            error: None,
-        }),
-        Err(error) => to_json(&FormatResult {
-            ok: false,
-            output: String::new(),
-            error: Some(error.render()),
-        }),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// One completion suggestion.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct WasmCompletion {
     /// The text shown in the list.
     pub label: String,

---- api::tests::a_converted_document_still_parses stdout ----

thread 'api::tests::a_converted_document_still_parses' (1173010) panicked at crates/casm-wasm/src/api.rs:754:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::an_unknown_format_is_rejected_as_a_value stdout ----

thread 'api::tests::an_unknown_format_is_rejected_as_a_value' (1173016) panicked at crates/casm-wasm/src/api.rs:754:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::formatting_converts_between_the_three_formats stdout ----

thread 'api::tests::formatting_converts_between_the_three_formats' (1173036) panicked at crates/casm-wasm/src/api.rs:754:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::a_converted_document_still_parses
    api::tests::an_unknown_format_is_rejected_as_a_value
    api::tests::every_entry_point_returns_parseable_json
    api::tests::formatting_converts_between_the_three_formats
    api::tests::formatting_is_idempotent_once_identifiers_are_pinned
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 41 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.40s

*** result: Failure(101)
