*** crates/casm-wasm/src/api.rs:451:5: replace complete -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace complete -> String with String::new()
@@ -443,17 +443,17 @@
 /// Returns completions for a zero-based cursor position.
 ///
 /// Works on documents that do not parse, which is when an editor needs it.
 ///
 /// Offers no pattern references, having no library to draw them from — see
 /// [`complete_with_patterns`].
 #[must_use]
 pub fn complete(source: &str, line: u32, character: u32) -> String {
-    complete_with_patterns(source, "", line, character)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns completions for a cursor position, drawing pattern references from `patterns`.
 ///
 /// `patterns` is a JSON array of pattern documents, as [`validate_with_patterns`] takes.
 #[must_use]
 pub fn complete_with_patterns(source: &str, patterns: &str, line: u32, character: u32) -> String {
     let library = Library::read(patterns);

---- api::tests::completion_offers_node_types_after_a_type_key stdout ----

thread 'api::tests::completion_offers_node_types_after_a_type_key' (1174070) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::completion_offers_pattern_references_from_the_library stdout ----

thread 'api::tests::completion_offers_pattern_references_from_the_library' (1174071) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::completion_works_on_a_document_that_does_not_parse stdout ----

thread 'api::tests::completion_works_on_a_document_that_does_not_parse' (1174072) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::completion_offers_node_types_after_a_type_key
    api::tests::completion_offers_pattern_references_from_the_library
    api::tests::completion_works_on_a_document_that_does_not_parse
    api::tests::every_entry_point_returns_parseable_json
    api::tests::supplying_no_library_matches_the_older_entry_points_exactly

test result: FAILED. 42 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.16s

*** result: Failure(101)
