*** crates/casm-wasm/src/api.rs:459:5: replace complete_with_patterns -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace complete_with_patterns -> String with String::new()
@@ -451,38 +451,17 @@
     complete_with_patterns(source, "", line, character)
 }
 
 /// Returns completions for a cursor position, drawing pattern references from `patterns`.
 ///
 /// `patterns` is a JSON array of pattern documents, as [`validate_with_patterns`] takes.
 #[must_use]
 pub fn complete_with_patterns(source: &str, patterns: &str, line: u32, character: u32) -> String {
-    let library = Library::read(patterns);
-    let index = DocumentIndex::build(source);
-    let result = casm_lsp::completion::complete(
-        &index,
-        &library.patterns,
-        casm_lsp::Position::new(line, character),
-    );
-
-    to_json(&CompletionResult {
-        context: format!("{:?}", result.context),
-        prefix: result.prefix,
-        items: result
-            .items
-            .iter()
-            .map(|item| WasmCompletion {
-                label: item.label.clone(),
-                insert_text: item.insert_text.clone(),
-                detail: item.detail.clone(),
-                documentation: item.documentation.clone(),
-            })
-            .collect(),
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A hover tooltip.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct HoverResult {
     /// `true` if there is something to show.
     pub ok: bool,

---- api::tests::completion_offers_pattern_references_from_the_library stdout ----

thread 'api::tests::completion_offers_pattern_references_from_the_library' (1174120) panicked at crates/casm-wasm/src/api.rs:761:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::completion_works_on_a_document_that_does_not_parse stdout ----

thread 'api::tests::completion_works_on_a_document_that_does_not_parse' (1174121) panicked at crates/casm-wasm/src/api.rs:761:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::completion_offers_node_types_after_a_type_key stdout ----

thread 'api::tests::completion_offers_node_types_after_a_type_key' (1174119) panicked at crates/casm-wasm/src/api.rs:761:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::completion_offers_node_types_after_a_type_key
    api::tests::completion_offers_pattern_references_from_the_library
    api::tests::completion_works_on_a_document_that_does_not_parse
    api::tests::every_entry_point_returns_parseable_json

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.13s

*** result: Failure(101)
