*** crates/casm-wasm/src/api.rs:496:5: replace hover -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace hover -> String with String::new()
@@ -488,17 +488,17 @@
     pub ok: bool,
     /// The tooltip, as Markdown.
     pub markdown: String,
 }
 
 /// Returns a hover tooltip for a zero-based cursor position.
 #[must_use]
 pub fn hover(source: &str, line: u32, character: u32) -> String {
-    hover_with_patterns(source, "", line, character)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns a hover tooltip, explaining a claimed pattern from `patterns`.
 ///
 /// `patterns` is a JSON array of pattern documents, as [`validate_with_patterns`] takes.
 #[must_use]
 pub fn hover_with_patterns(source: &str, patterns: &str, line: u32, character: u32) -> String {
     let library = Library::read(patterns);

---- api::tests::hover_explains_a_node stdout ----

thread 'api::tests::hover_explains_a_node' (1174923) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::hover_over_empty_space_is_a_negative_result_not_an_error stdout ----

thread 'api::tests::hover_over_empty_space_is_a_negative_result_not_an_error' (1174943) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::every_entry_point_returns_parseable_json stdout ----

thread 'api::tests::every_entry_point_returns_parseable_json' (1174912) panicked at crates/casm-wasm/src/api.rs:782:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::every_entry_point_returns_parseable_json
    api::tests::hover_explains_a_node
    api::tests::hover_over_empty_space_is_a_negative_result_not_an_error
    api::tests::supplying_no_library_matches_the_older_entry_points_exactly

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.32s

*** result: Failure(101)
