*** crates/casm-wasm/src/api.rs:504:5: replace hover_with_patterns -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace hover_with_patterns -> String with String::new()
@@ -496,37 +496,17 @@
     hover_with_patterns(source, "", line, character)
 }
 
 /// Returns a hover tooltip, explaining a claimed pattern from `patterns`.
 ///
 /// `patterns` is a JSON array of pattern documents, as [`validate_with_patterns`] takes.
 #[must_use]
 pub fn hover_with_patterns(source: &str, patterns: &str, line: u32, character: u32) -> String {
-    let library = Library::read(patterns);
-    let index = DocumentIndex::build(source);
-    let architecture = casm_parser::parse_str(source, Path::new(VIRTUAL_PATH)).ok();
-
-    let found = casm_lsp::hover::hover(
-        &index,
-        architecture.as_ref(),
-        &library.patterns,
-        casm_lsp::Position::new(line, character),
-    );
-
-    to_json(&match found {
-        Some(hover) => HoverResult {
-            ok: true,
-            markdown: hover.markdown,
-        },
-        None => HoverResult {
-            ok: false,
-            markdown: String::new(),
-        },
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The result of a drift check.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct DriftResult {
     /// `true` if the comparison ran.
     pub ok: bool,

---- api::tests::hover_explains_a_claimed_pattern_from_the_library stdout ----

thread 'api::tests::hover_explains_a_claimed_pattern_from_the_library' (1175133) panicked at crates/casm-wasm/src/api.rs:762:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::hover_over_empty_space_is_a_negative_result_not_an_error stdout ----

thread 'api::tests::hover_over_empty_space_is_a_negative_result_not_an_error' (1175135) panicked at crates/casm-wasm/src/api.rs:762:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::hover_explains_a_node stdout ----

thread 'api::tests::hover_explains_a_node' (1175134) panicked at crates/casm-wasm/src/api.rs:762:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::every_entry_point_returns_parseable_json
    api::tests::hover_explains_a_claimed_pattern_from_the_library
    api::tests::hover_explains_a_node
    api::tests::hover_over_empty_space_is_a_negative_result_not_an_error

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.32s

*** result: Failure(101)
