*** crates/casm-wasm/src/api.rs:548:5: replace drift -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace drift -> String with String::new()
@@ -540,52 +540,17 @@
     pub error: Option<String>,
 }
 
 /// Compares a document against an inventory of real infrastructure.
 ///
 /// `inventory_kind` is `native` or `terraform`.
 #[must_use]
 pub fn drift(source: &str, inventory_json: &str, inventory_kind: &str) -> String {
-    let failure = |error: String| {
-        to_json(&DriftResult {
-            ok: false,
-            clean: false,
-            summary: String::new(),
-            drifts: Vec::new(),
-            error: Some(error),
-        })
-    };
-
-    let architecture = match casm_parser::parse_str(source, Path::new(VIRTUAL_PATH)) {
-        Ok(architecture) => architecture,
-        Err(error) => return failure(error.render()),
-    };
-
-    let inventory = match inventory_kind {
-        "native" => Inventory::from_json(inventory_json),
-        "terraform" => Inventory::from_terraform_state(inventory_json),
-        other => Err(format!(
-            "unknown inventory kind '{other}'; expected native or terraform"
-        )),
-    };
-
-    let inventory = match inventory {
-        Ok(inventory) => inventory,
-        Err(error) => return failure(error),
-    };
-
-    let report = casm_diff::drift::detect(&architecture, &inventory);
-    to_json(&DriftResult {
-        ok: true,
-        clean: report.is_clean(),
-        summary: report.summary(),
-        drifts: report.drifts.iter().map(ToString::to_string).collect(),
-        error: None,
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// What one conformance claim came to.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct ClaimReport {
     /// The `name@version` the document claims.
     pub pattern: String,

---- api::tests::an_unknown_inventory_kind_is_rejected_as_a_value stdout ----

thread 'api::tests::an_unknown_inventory_kind_is_rejected_as_a_value' (1176051) panicked at crates/casm-wasm/src/api.rs:747:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::drift_compares_against_terraform_state stdout ----

thread 'api::tests::drift_compares_against_terraform_state' (1176088) panicked at crates/casm-wasm/src/api.rs:747:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::drift_compares_against_a_native_inventory stdout ----

thread 'api::tests::drift_compares_against_a_native_inventory' (1176083) panicked at crates/casm-wasm/src/api.rs:747:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::an_unknown_inventory_kind_is_rejected_as_a_value
    api::tests::drift_compares_against_a_native_inventory
    api::tests::drift_compares_against_terraform_state
    api::tests::every_entry_point_returns_parseable_json

test result: FAILED. 43 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.49s

*** result: Failure(101)
