*** crates/casm-wasm/src/api.rs:54:5: replace to_json -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace to_json -> String with "xyzzy".into()
@@ -46,19 +46,17 @@
 const VIRTUAL_PATH: &str = "<editor>";
 
 /// Serialises a result, falling back to a JSON error object.
 ///
 /// Serialisation of these types cannot fail, but `unwrap` is denied and a panic in
 /// WebAssembly is fatal, so the impossible branch still returns something a caller can
 /// parse rather than trapping.
 fn to_json<T: Serialize>(value: &T) -> String {
-    serde_json::to_string(value).unwrap_or_else(|error| {
-        format!(r#"{{"ok":false,"error":"internal serialisation failure: {error}"}}"#)
-    })
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A diagnostic, flattened for JavaScript.
 #[derive(Debug, Serialize)]
 #[serde(rename_all = "camelCase")]
 pub struct WasmDiagnostic {
     /// `error`, `warning`, or `info`.
     pub severity: &'static str,

---- api::tests::a_broken_document_yields_a_result_rather_than_an_error stdout ----

thread 'api::tests::a_broken_document_yields_a_result_rather_than_an_error' (1169090) panicked at crates/casm-wasm/src/api.rs:780:58:
not JSON: expected value at line 1 column 1
xyzzy

---- api::tests::a_converted_document_still_parses stdout ----

thread 'api::tests::a_converted_document_still_parses' (1169093) panicked at crates/casm-wasm/src/api.rs:780:58:
not JSON: expected value at line 1 column 1
xyzzy

---- api::tests::a_malformed_library_is_reported_as_a_value_not_a_trap stdout ----

thread 'api::tests::a_malformed_library_is_reported_as_a_value_not_a_trap' (1169095) panicked at crates/casm-wasm/src/api.rs:780:58:
not JSON: expected value at line 1 column 1
xyzzy

failures:
    api::tests::a_broken_document_yields_a_result_rather_than_an_error
    api::tests::a_claim_is_checked_once_a_library_is_supplied
    api::tests::a_claim_is_unchecked_without_a_library
    api::tests::a_converted_document_still_parses
    api::tests::a_document_claiming_nothing_conforms_vacuously
    api::tests::a_malformed_library_is_reported_as_a_value_not_a_trap
    api::tests::an_empty_library_is_not_an_error
    api::tests::an_unchecked_claim_does_not_count_as_conforming
    api::tests::an_unknown_backend_is_reported_with_the_ones_that_exist
    api::tests::an_unknown_format_is_rejected_as_a_value
    api::tests::an_unknown_inventory_kind_is_rejected_as_a_value
    api::tests::an_unmet_requirement_is_an_error_across_the_boundary

test result: FAILED. 8 passed; 39 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.19s

*** result: Failure(101)
