*** crates/casm-wasm/src/api.rs:647:5: replace conformance -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace conformance -> String with String::new()
@@ -639,45 +639,17 @@
 /// This is `casm evolve` without a filesystem. It reports rather than rewrites, for the
 /// reason ADR-0012 gives: a pattern is a shape to conform to, not a template to stamp, so
 /// migrating to a new version is a computation over two sets and never a merge that could
 /// silently corrupt the document.
 ///
 /// Never fails. A document that does not parse reports `ok: false` and the reason.
 #[must_use]
 pub fn conformance(source: &str, patterns: &str) -> String {
-    let library = Library::read(patterns);
-
-    let architecture = match casm_parser::parse_str(source, Path::new(VIRTUAL_PATH)) {
-        Ok(architecture) => architecture,
-        Err(error) => {
-            return to_json(&ConformanceResult {
-                ok: false,
-                conforms: false,
-                error: Some(error.render()),
-                patterns_loaded: library.patterns.len(),
-                pattern_errors: library.errors,
-                claims: Vec::new(),
-            });
-        }
-    };
-
-    let claims: Vec<ClaimReport> = architecture
-        .conformance()
-        .map(|claim| check_claim(&architecture, &library.patterns, claim))
-        .collect();
-
-    to_json(&ConformanceResult {
-        ok: true,
-        conforms: claims.iter().all(|claim| claim.checked && claim.conforms),
-        error: None,
-        patterns_loaded: library.patterns.len(),
-        pattern_errors: library.errors,
-        claims,
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Checks one claim against the library, reporting an unheld pattern as unchecked.
 fn check_claim(
     architecture: &casm_core::Architecture,
     patterns: &[casm_core::Pattern],
     claim: &casm_core::Conformance,
 ) -> ClaimReport {

---- api::tests::a_document_claiming_nothing_conforms_vacuously stdout ----

thread 'api::tests::a_document_claiming_nothing_conforms_vacuously' (1176134) panicked at crates/casm-wasm/src/api.rs:754:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::an_unchecked_claim_does_not_count_as_conforming stdout ----

thread 'api::tests::an_unchecked_claim_does_not_count_as_conforming' (1176137) panicked at crates/casm-wasm/src/api.rs:754:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::conformance_infers_a_binding_the_document_did_not_write stdout ----

thread 'api::tests::conformance_infers_a_binding_the_document_did_not_write' (1176145) panicked at crates/casm-wasm/src/api.rs:754:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::a_document_claiming_nothing_conforms_vacuously
    api::tests::an_unchecked_claim_does_not_count_as_conforming
    api::tests::conformance_infers_a_binding_the_document_did_not_write
    api::tests::conformance_on_a_broken_document_is_a_value
    api::tests::conformance_reports_the_bindings_it_resolved
    api::tests::conformance_separates_what_a_tool_can_fix_from_what_a_human_must_decide

test result: FAILED. 41 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.07s

*** result: Failure(101)
