*** crates/casm-wasm/src/api.rs:670:59: replace && with || in conformance

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace && with || in conformance
@@ -662,17 +662,17 @@
 
     let claims: Vec<ClaimReport> = architecture
         .conformance()
         .map(|claim| check_claim(&architecture, &library.patterns, claim))
         .collect();
 
     to_json(&ConformanceResult {
         ok: true,
-        conforms: claims.iter().all(|claim| claim.checked && claim.conforms),
+        conforms: claims.iter().all(|claim| claim.checked || /* ~ changed by cargo-mutants ~ */ claim.conforms),
         error: None,
         patterns_loaded: library.patterns.len(),
         pattern_errors: library.errors,
         claims,
     })
 }
 
 /// Checks one claim against the library, reporting an unheld pattern as unchecked.

---- api::tests::conformance_separates_what_a_tool_can_fix_from_what_a_human_must_decide stdout ----

thread 'api::tests::conformance_separates_what_a_tool_can_fix_from_what_a_human_must_decide' (1176872) panicked at crates/casm-wasm/src/api.rs:1304:9:
assertion `left == right` failed
  left: Bool(true)
 right: false

failures:
    api::tests::conformance_separates_what_a_tool_can_fix_from_what_a_human_must_decide

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.95s

*** result: Failure(101)
