*** crates/casm-wasm/src/api.rs:728:5: replace rules -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace rules -> String with String::new()
@@ -720,32 +720,17 @@
             })
             .collect(),
     }
 }
 
 /// The rule catalogue, so a playground can explain itself.
 #[must_use]
 pub fn rules() -> String {
-    #[derive(Serialize)]
-    #[serde(rename_all = "camelCase")]
-    struct Rule {
-        id: &'static str,
-        description: &'static str,
-    }
-
-    let catalogue: Vec<Rule> = casm_validator::rules::built_in()
-        .iter()
-        .map(|rule| Rule {
-            id: rule.id(),
-            description: rule.description(),
-        })
-        .collect();
-
-    to_json(&catalogue)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The crate version, so a page can show what it is running.
 #[must_use]
 pub fn version() -> String {
     env!("CARGO_PKG_VERSION").to_owned()
 }

---- api::tests::the_rule_catalogue_matches_the_validator stdout ----

thread 'api::tests::the_rule_catalogue_matches_the_validator' (1177124) panicked at crates/casm-wasm/src/api.rs:767:58:
not JSON: EOF while parsing a value at line 1 column 0

---- api::tests::every_entry_point_returns_parseable_json stdout ----

thread 'api::tests::every_entry_point_returns_parseable_json' (1177108) panicked at crates/casm-wasm/src/api.rs:767:58:
not JSON: EOF while parsing a value at line 1 column 0

failures:
    api::tests::every_entry_point_returns_parseable_json
    api::tests::the_rule_catalogue_matches_the_validator

test result: FAILED. 45 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.64s

*** result: Failure(101)
