*** crates/casm-wasm/src/api.rs:749:5: replace version -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/api.rs
+++ replace version -> String with String::new()
@@ -741,17 +741,17 @@
         .collect();
 
     to_json(&catalogue)
 }
 
 /// The crate version, so a page can show what it is running.
 #[must_use]
 pub fn version() -> String {
-    env!("CARGO_PKG_VERSION").to_owned()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- api::tests::the_version_is_reported stdout ----

thread 'api::tests::the_version_is_reported' (1177431) panicked at crates/casm-wasm/src/api.rs:1082:9:
assertion `left == right` failed
  left: ""
 right: "0.3.0"

failures:
    api::tests::the_version_is_reported

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.49s

*** result: Failure(101)
