*** crates/casm-wasm/src/lib.rs:106:5: replace conformance -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace conformance -> String with "xyzzy".into()
@@ -98,17 +98,17 @@
 
 /// Reports what an architecture must change to satisfy the patterns it claims.
 ///
 /// `casm evolve` without a filesystem: it reports rather than rewrites, because a pattern
 /// is a shape to conform to and not a template to stamp (ADR-0012).
 #[wasm_bindgen]
 #[must_use]
 pub fn conformance(source: &str, patterns: &str) -> String {
-    api::conformance(source, patterns)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders an architecture as a diagram.
 ///
 /// `backend` is `mermaid`, `dot`, or `ascii`.
 #[wasm_bindgen]
 #[must_use]
 pub fn render(source: &str, backend: &str) -> String {

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.08s

*** result: Failure(101)
