*** crates/casm-wasm/src/lib.rs:115:5: replace render -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace render -> String with String::new()
@@ -107,17 +107,17 @@
 }
 
 /// Renders an architecture as a diagram.
 ///
 /// `backend` is `mermaid`, `dot`, or `ascii`.
 #[wasm_bindgen]
 #[must_use]
 pub fn render(source: &str, backend: &str) -> String {
-    api::render(source, backend)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Computes an architecture's semantic fingerprint and per-node digests.
 #[wasm_bindgen]
 #[must_use]
 pub fn fingerprint(source: &str) -> String {
     api::fingerprint(source)
 }

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.03s

*** result: Failure(101)
