*** crates/casm-wasm/src/lib.rs:122:5: replace fingerprint -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace fingerprint -> String with String::new()
@@ -114,17 +114,17 @@
 pub fn render(source: &str, backend: &str) -> String {
     api::render(source, backend)
 }
 
 /// Computes an architecture's semantic fingerprint and per-node digests.
 #[wasm_bindgen]
 #[must_use]
 pub fn fingerprint(source: &str) -> String {
-    api::fingerprint(source)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Compares two architectures semantically.
 #[wasm_bindgen]
 #[must_use]
 pub fn diff(before: &str, after: &str) -> String {
     api::diff(before, after)
 }

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.33s

*** result: Failure(101)
