*** crates/casm-wasm/src/lib.rs:129:5: replace diff -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace diff -> String with "xyzzy".into()
@@ -121,17 +121,17 @@
 pub fn fingerprint(source: &str) -> String {
     api::fingerprint(source)
 }
 
 /// Compares two architectures semantically.
 #[wasm_bindgen]
 #[must_use]
 pub fn diff(before: &str, after: &str) -> String {
-    api::diff(before, after)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts an architecture between `yaml`, `json`, and `toml`.
 #[wasm_bindgen]
 #[must_use]
 pub fn format(source: &str, target: &str) -> String {
     api::format(source, target)
 }

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.26s

*** result: Failure(101)
