*** crates/casm-wasm/src/lib.rs:136:5: replace format -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace format -> String with "xyzzy".into()
@@ -128,17 +128,17 @@
 pub fn diff(before: &str, after: &str) -> String {
     api::diff(before, after)
 }
 
 /// Converts an architecture between `yaml`, `json`, and `toml`.
 #[wasm_bindgen]
 #[must_use]
 pub fn format(source: &str, target: &str) -> String {
-    api::format(source, target)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns completions for a zero-based cursor position.
 #[wasm_bindgen]
 #[must_use]
 pub fn complete(source: &str, line: u32, character: u32) -> String {
     api::complete(source, line, character)
 }

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.15s

*** result: Failure(101)
