*** crates/casm-wasm/src/lib.rs:143:5: replace complete -> String with String::new()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace complete -> String with String::new()
@@ -135,17 +135,17 @@
 pub fn format(source: &str, target: &str) -> String {
     api::format(source, target)
 }
 
 /// Returns completions for a zero-based cursor position.
 #[wasm_bindgen]
 #[must_use]
 pub fn complete(source: &str, line: u32, character: u32) -> String {
-    api::complete(source, line, character)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns completions, offering pattern references from the supplied library.
 #[wasm_bindgen]
 #[must_use]
 pub fn complete_with_patterns(source: &str, patterns: &str, line: u32, character: u32) -> String {
     api::complete_with_patterns(source, patterns, line, character)
 }

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.31s

*** result: Failure(101)
