*** crates/casm-wasm/src/lib.rs:164:5: replace hover_with_patterns -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace hover_with_patterns -> String with "xyzzy".into()
@@ -156,17 +156,17 @@
 pub fn hover(source: &str, line: u32, character: u32) -> String {
     api::hover(source, line, character)
 }
 
 /// Returns a hover tooltip, explaining a claimed pattern from the supplied library.
 #[wasm_bindgen]
 #[must_use]
 pub fn hover_with_patterns(source: &str, patterns: &str, line: u32, character: u32) -> String {
-    api::hover_with_patterns(source, patterns, line, character)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Compares an architecture against an inventory of real infrastructure.
 ///
 /// `inventory_kind` is `native` or `terraform`.
 #[wasm_bindgen]
 #[must_use]
 pub fn drift(source: &str, inventory: &str, inventory_kind: &str) -> String {

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.27s

*** result: Failure(101)
