*** crates/casm-wasm/src/lib.rs:180:5: replace rules -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace rules -> String with "xyzzy".into()
@@ -172,17 +172,17 @@
 pub fn drift(source: &str, inventory: &str, inventory_kind: &str) -> String {
     api::drift(source, inventory, inventory_kind)
 }
 
 /// Returns the built-in validation rules and their descriptions.
 #[wasm_bindgen]
 #[must_use]
 pub fn rules() -> String {
-    api::rules()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns the CASIMIR version this module was built from.
 #[wasm_bindgen]
 #[must_use]
 pub fn version() -> String {
     api::version()
 }

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.61s

*** result: Failure(101)
