*** crates/casm-wasm/src/lib.rs:187:5: replace version -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace version -> String with "xyzzy".into()
@@ -179,17 +179,17 @@
 pub fn rules() -> String {
     api::rules()
 }
 
 /// Returns the CASIMIR version this module was built from.
 #[wasm_bindgen]
 #[must_use]
 pub fn version() -> String {
-    api::version()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.79s

*** result: Failure(101)
