*** crates/casm-wasm/src/lib.rs:72:5: replace start with ()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace start with ()
@@ -64,17 +64,17 @@
 use wasm_bindgen::prelude::wasm_bindgen;
 
 /// Installs the panic hook when the module is instantiated.
 ///
 /// `#[wasm_bindgen(start)]` runs this automatically. Without it a panic aborts with no
 /// message at all, leaving a page that simply stops working.
 #[wasm_bindgen(start)]
 pub fn start() {
-    console_error_panic_hook::set_once();
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Validates an architecture, returning findings with line and column positions.
 ///
 /// Never fails. A document that cannot be parsed reports `parsed: false` and a syntax
 /// diagnostic.
 ///
 /// Reports every conformance claim as unchecked, having no library to check it against.

*** result: Success
