*** crates/casm-wasm/src/lib.rs:85:5: replace validate -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-wasm/src/lib.rs
+++ replace validate -> String with "xyzzy".into()
@@ -77,17 +77,17 @@
 /// Never fails. A document that cannot be parsed reports `parsed: false` and a syntax
 /// diagnostic.
 ///
 /// Reports every conformance claim as unchecked, having no library to check it against.
 /// Use [`validate_with_patterns`] to supply one.
 #[wasm_bindgen]
 #[must_use]
 pub fn validate(source: &str) -> String {
-    api::validate(source)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Validates an architecture against a pattern library.
 ///
 /// `patterns` is a JSON array of pattern documents — the text of the files a `patterns/`
 /// directory holds. A browser has no filesystem to find them in, so the caller supplies
 /// them; everything else is identical to [`validate`].
 #[wasm_bindgen]

failures:
    tests::the_bindings_delegate_to_the_api_unchanged

test result: FAILED. 46 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.06s

*** result: Failure(101)
