*** crates/casm-cli/src/commands.rs:102:24: replace && with || in init

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace && with || in init
@@ -94,17 +94,17 @@
     }
 }
 
 /// The result of running a subcommand.
 pub(crate) type CommandResult = Result<ExitCode, CommandError>;
 
 /// Scaffolds a new architecture file.
 pub(crate) fn init(name: &str, output: &Path, force: bool) -> CommandResult {
-    if output.exists() && !force {
+    if output.exists() || /* ~ changed by cargo-mutants ~ */ !force {
         return Err(CommandError(format!(
             "'{}' already exists; pass --force to overwrite it",
             output.display()
         )));
     }
 
     let contents = TEMPLATE.replace("{{NAME}}", name);
     std::fs::write(output, &contents)

---- commands::tests::init_writes_a_file_and_refuses_to_clobber_it stdout ----

thread 'commands::tests::init_writes_a_file_and_refuses_to_clobber_it' (1192206) panicked at crates/casm-cli/src/commands.rs:956:9:
assertion failed: init("demo", &target, false).is_ok()

failures:
    commands::tests::init_writes_a_file_and_refuses_to_clobber_it

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
