*** crates/casm-cli/src/commands.rs:182:15: replace && with || in exit_code_for

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace && with || in exit_code_for
@@ -174,17 +174,17 @@
         }
     }
 
     Ok(exit_code_for(&report, strict))
 }
 
 /// Maps a report onto an exit code, honouring `--strict`.
 fn exit_code_for(report: &Report, strict: bool) -> ExitCode {
-    if strict && report.has_warnings() {
+    if strict || /* ~ changed by cargo-mutants ~ */ report.has_warnings() {
         return ExitCode::ValidationErrors;
     }
     ExitCode::from_report_code(report.exit_code())
 }
 
 /// Prints a validation report as prose.
 fn print_human(file: &Path, architecture: &Architecture, report: &Report) {
     println!(

---- commands::tests::strict_mode_promotes_warnings_to_a_failing_exit_code stdout ----

thread 'commands::tests::strict_mode_promotes_warnings_to_a_failing_exit_code' (1194086) panicked at crates/casm-cli/src/commands.rs:979:9:
assertion `left == right` failed
  left: ValidationErrors
 right: Warnings

---- commands::tests::strict_mode_does_not_promote_a_clean_report stdout ----

thread 'commands::tests::strict_mode_does_not_promote_a_clean_report' (1194085) panicked at crates/casm-cli/src/commands.rs:985:9:
assertion `left == right` failed
  left: ValidationErrors
 right: Success

failures:
    commands::tests::strict_mode_does_not_promote_a_clean_report
    commands::tests::strict_mode_promotes_warnings_to_a_failing_exit_code

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
