*** crates/casm-cli/src/commands.rs:190:5: replace print_human with ()

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace print_human with ()
@@ -182,35 +182,17 @@
     if strict && report.has_warnings() {
         return ExitCode::ValidationErrors;
     }
     ExitCode::from_report_code(report.exit_code())
 }
 
 /// Prints a validation report as prose.
 fn print_human(file: &Path, architecture: &Architecture, report: &Report) {
-    println!(
-        "{}: {} v{} — {} node(s), {} relationship(s)",
-        file.display(),
-        architecture.name(),
-        architecture.version(),
-        architecture.node_count(),
-        architecture.relationship_count()
-    );
-
-    if report.is_clean() {
-        println!("\n{}", report.summary());
-        return;
-    }
-
-    println!();
-    for diagnostic in &report.diagnostics {
-        println!("{}\n", diagnostic.render());
-    }
-    println!("{}", report.summary());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders an architecture as a diagram.
 pub(crate) fn generate(file: &Path, format: DiagramFormat, output: Option<&Path>) -> CommandResult {
     let architecture = parse_file(file)?;
 
     let backend = casm_renderer::by_id(format.renderer_id())
         .ok_or_else(|| CommandError(format!("no renderer named '{}'", format.renderer_id())))?;

*** result: Success
