*** crates/casm-cli/src/commands.rs:483:16: delete ! in drift

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ delete ! in drift
@@ -475,17 +475,17 @@
             println!("{json}");
         }
         OutputFormat::Human => {
             println!(
                 "{}: {} node(s) declared",
                 file.display(),
                 architecture.node_count()
             );
-            if !report.is_clean() {
+            if  /* ~ changed by cargo-mutants ~ */report.is_clean() {
                 println!();
                 print!("{}", report.render());
             }
             println!("\n{}", report.summary());
         }
     }
 
     if fail_on_drift && !report.is_clean() {

*** result: Success
