*** crates/casm-cli/src/commands.rs:491:25: delete ! in drift

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ delete ! in drift
@@ -483,17 +483,17 @@
             if !report.is_clean() {
                 println!();
                 print!("{}", report.render());
             }
             println!("\n{}", report.summary());
         }
     }
 
-    if fail_on_drift && !report.is_clean() {
+    if fail_on_drift &&  /* ~ changed by cargo-mutants ~ */report.is_clean() {
         return Ok(ExitCode::ValidationErrors);
     }
     Ok(ExitCode::Success)
 }
 
 /// Loads a pattern library, or none if the caller supplied no directory.
 ///
 /// A missing directory is an error rather than an empty library: an author who typed

*** result: Success
