*** crates/casm-cli/src/commands.rs:592:54: replace == with != in evolve_targets

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace == with != in evolve_targets
@@ -584,17 +584,17 @@
     // are reported rather than dropped, which is the honest outcome — a binding that no
     // longer means anything is a thing the author should be told about.
     let inherited = architecture
         .conformance()
         .find(|claim| claim.pattern() == &reference)
         .or_else(|| {
             architecture
                 .conformance()
-                .find(|claim| claim.pattern().name() == reference.name())
+                .find(|claim| claim.pattern().name() != /* ~ changed by cargo-mutants ~ */ reference.name())
         });
 
     let Some(existing) = inherited else {
         return Ok(vec![casm_core::Conformance::new(reference)]);
     };
 
     let mut claim = casm_core::Conformance::new(reference);
     for (role, node) in existing.bindings() {

---- commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one stdout ----
/tmp/casm-cli-evolve-migrate-019fd1f4-287b-7410-986f-7616095b2cca/architecture.yaml: 1 pattern(s)

shape@2.0.0: 1 unmet
  decide: role 'application' requires a 'service' and 2 could fill it: orders, payments

1 requirement(s) unmet
/tmp/casm-cli-evolve-migrate-019fd1f4-287b-7410-986f-7616095b2cca/architecture.yaml: 1 pattern(s)

shape@2.0.0: 1 unmet
  decide: role 'application' requires a 'service' and 2 could fill it: orders, payments

1 requirement(s) unmet

failures:
    commands::tests::evolve_to_a_new_version_reuses_the_bindings_written_for_the_old_one

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
