*** crates/casm-cli/src/commands.rs:614:5: replace print_conformance with ()

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace print_conformance with ()
@@ -606,43 +606,17 @@
 }
 
 /// Prints one conformance report.
 fn print_conformance(
     reference: &str,
     report: &casm_core::ConformanceReport,
     architecture: &Architecture,
 ) {
-    if report.conforms() {
-        println!("{reference}: conforms");
-        return;
-    }
-
-    println!("{reference}: {} unmet", report.unmet().len());
-
-    for (role, id) in report.bindings() {
-        let node = architecture
-            .node(*id)
-            .map_or_else(|| id.to_string(), |node| node.name().as_str().to_owned());
-        println!("  {role} -> {node}");
-    }
-
-    // Mechanical failures first: they are the ones an author can act on immediately.
-    let (mechanical, decisions): (Vec<_>, Vec<_>) = report
-        .unmet()
-        .iter()
-        .partition(|unmet| unmet.is_mechanical());
-
-    for unmet in mechanical {
-        println!("  add: {}", unmet.message());
-    }
-    for unmet in decisions {
-        println!("  decide: {}", unmet.message());
-    }
-    println!();
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Opens the repository containing `file`, reporting failures in the user's terms.
 fn repository_for(file: &Path) -> Result<casm_git::Repository, CommandError> {
     let search_from = file
         .parent()
         .filter(|parent| !parent.as_os_str().is_empty());
     casm_git::Repository::discover(search_from.unwrap_or(Path::new(".")))

*** result: Success
