*** crates/casm-cli/src/commands.rs:647:26: delete ! in repository_for

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ delete ! in repository_for
@@ -639,17 +639,17 @@
     }
     println!();
 }
 
 /// Opens the repository containing `file`, reporting failures in the user's terms.
 fn repository_for(file: &Path) -> Result<casm_git::Repository, CommandError> {
     let search_from = file
         .parent()
-        .filter(|parent| !parent.as_os_str().is_empty());
+        .filter(|parent|  /* ~ changed by cargo-mutants ~ */parent.as_os_str().is_empty());
     casm_git::Repository::discover(search_from.unwrap_or(Path::new(".")))
         .map_err(|error| CommandError(error.to_string()))
 }
 
 /// Assembles a register of the control claims an architecture makes.
 ///
 /// Reports claims, never satisfaction. A control flagged `evidence-required` is listed as
 /// outstanding, because CASIMIR does not hold the artefact behind it and saying otherwise

*** result: Success
