*** crates/casm-cli/src/commands.rs:693:37: replace > with == in evidence

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace > with == in evidence
@@ -685,17 +685,17 @@
         }
         EvidenceFormat::Json => {
             let json = serde_json::to_string_pretty(&pack)
                 .map_err(|error| CommandError(format!("cannot serialise the register: {error}")))?;
             println!("{json}");
         }
     }
 
-    if strict && pack.outstanding() > 0 {
+    if strict && pack.outstanding() == /* ~ changed by cargo-mutants ~ */ 0 {
         return Ok(ExitCode::ValidationErrors);
     }
     Ok(ExitCode::Success)
 }
 
 /// Reads whatever Git can tell us about where an architecture came from.
 ///
 /// A file outside a repository, or one Git cannot read, yields

---- commands::tests::strict_evidence_fails_when_a_claim_is_outstanding stdout ----
{
  "architecture": "audited",
  "version": "1.0.0",
  "fingerprint": "57f55bc212764f9c1807fe3f4f480cd849c3bd7caa6a43904029fc231b46e273",
  "provenance": {
    "source": "/tmp/casm-cli-evidence-strict-019fd1f4-38f2-7122-aea5-01d6e386a55d/architecture.yaml"
  },
  "standards": [
    {
      "standard": "ISO27001-A.10.1",
      "claims": [
        {
          "node": "orders-db",

---- commands::tests::strict_evidence_passes_when_nothing_is_flagged stdout ----
Control claims register — audited v1.0.0

This is a register of the controls this architecture CLAIMS, assembled from the file and its history. CASIMIR verified the structure, not the reality: nothing here is evidence that a control is implemented.

  fingerprint  c8256969f32f9919288ac35df5000085749d910a84d14d7ccf51af0cf50b2eaf
  provenance   not under version control, or history was not read

ISO27001-A.10.1  (1 claim(s), 0 outstanding)
    orders-db            compliance       Encrypted at rest

PITR-35D  (1 claim(s), 0 outstanding)
    orders-db            operational      Point-in-time recovery for 35 days

failures:
    commands::tests::strict_evidence_fails_when_a_claim_is_outstanding
    commands::tests::strict_evidence_passes_when_nothing_is_flagged

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
