*** crates/casm-cli/src/commands.rs:705:5: replace provenance_of -> Provenance with Default::default()

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace provenance_of -> Provenance with Default::default()
@@ -697,35 +697,17 @@
 }
 
 /// Reads whatever Git can tell us about where an architecture came from.
 ///
 /// A file outside a repository, or one Git cannot read, yields
 /// [`Provenance::unknown`] rather than an error: a register without attribution is still
 /// worth having, and refusing to produce one would be the wrong trade.
 fn provenance_of(file: &Path) -> Provenance {
-    let base = Provenance::unknown().from_source(file.display().to_string());
-
-    let Ok(repository) = repository_for(file) else {
-        return base;
-    };
-    let Ok(revisions) = repository.semantic_history(file, casm_git::HistoryOptions::default())
-    else {
-        return base;
-    };
-
-    let base = base.with_semantic_revisions(revisions.len());
-    let latest = revisions.first().map(attribution_of);
-    let first = revisions.last().map(attribution_of);
-
-    match (latest, first) {
-        (Some(latest), Some(first)) => base.at(latest).introduced_by(first),
-        (Some(latest), None) => base.at(latest),
-        (None, _) => base,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Projects a revision onto the attribution an evidence register carries.
 fn attribution_of(revision: &casm_git::Revision) -> Attribution {
     Attribution {
         commit: revision.commit.clone(),
         author: revision.author.clone(),
         email: revision.email.clone(),

---- commands::tests::an_architecture_outside_a_repository_still_produces_a_register stdout ----

thread 'commands::tests::an_architecture_outside_a_repository_still_produces_a_register' (1202373) panicked at crates/casm-cli/src/commands.rs:1387:9:
assertion `left == right` failed
  left: None
 right: Some("/tmp/casm-cli-evidence-nogit-019fd1f4-4131-71a0-bd83-5a3a58ad0b55/architecture.yaml")

failures:
    commands::tests::an_architecture_outside_a_repository_still_produces_a_register

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
