*** crates/casm-cli/src/commands.rs:823:8: delete ! in checkout

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ delete ! in checkout
@@ -815,17 +815,17 @@
 
 /// Prints an architecture as it was at a past revision.
 pub(crate) fn checkout(revision: &str, file: &Path, validate_it: bool) -> CommandResult {
     let repository = repository_for(file)?;
     let source = repository
         .read_at(revision, file)
         .map_err(|error| CommandError(error.to_string()))?;
 
-    if !validate_it {
+    if  /* ~ changed by cargo-mutants ~ */validate_it {
         print!("{source}");
         return Ok(ExitCode::Success);
     }
 
     let architecture = casm_parser::parse_str(&source, file)?;
     let report = Validator::new().validate(&architecture);
     print_human(file, &architecture, &report);
     Ok(exit_code_for(&report, false))

*** result: Success
