*** crates/casm-cli/src/commands.rs:862:5: replace discover -> Result<Vec<PathBuf>, CommandError> with Ok(vec![])

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace discover -> Result<Vec<PathBuf>, CommandError> with Ok(vec![])
@@ -854,20 +854,17 @@
     Ok(ExitCode::Success)
 }
 
 /// Finds every plausible architecture file under `directory`.
 ///
 /// The walk is depth-bounded and skips `target/`, `node_modules/`, and dot-directories,
 /// because sweeping a build directory finds nothing and takes forever.
 fn discover(directory: &Path) -> Result<Vec<PathBuf>, CommandError> {
-    let mut found = Vec::new();
-    walk(directory, 0, &mut found)?;
-    found.sort();
-    Ok(found)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The maximum directory depth `check` will descend.
 ///
 /// NASA Rule 4: the recursion needs a statically provable bound. Eight levels reaches
 /// any sanely-organised repository and cannot be driven into a symlink loop.
 const MAX_WALK_DEPTH: usize = 8;

---- commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span stdout ----
no architecture files found under '/tmp/casm-cli-check-telemetry-broken-019fd1f4-5b4f-7222-95a3-88f94defeeb4'

thread 'commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span' (1204117) panicked at crates/casm-cli/src/commands.rs:1615:9:
assertion `left == right` failed
  left: 0
 right: 1

---- commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml stdout ----

thread 'commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml' (1204139) panicked at crates/casm-cli/src/commands.rs:1031:9:
assertion `left == right` failed: found []
  left: 0
 right: 1

---- commands::tests::check_reports_a_failure_for_an_unparseable_file stdout ----
no architecture files found under '/tmp/casm-cli-broken-019fd1f4-5b52-7950-bb10-5fc4ca0a369d'

thread 'commands::tests::check_reports_a_failure_for_an_unparseable_file' (1204134) panicked at crates/casm-cli/src/commands.rs:1111:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span
    commands::tests::a_sweep_reports_the_worst_exit_code_it_found
    commands::tests::check_reports_a_failure_for_an_unparseable_file
    commands::tests::discovery_descends_into_subdirectories
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml
    commands::tests::discovery_reports_an_unreadable_directory
    commands::tests::the_check_sweep_records_a_span_for_every_file
    commands::tests::the_walk_stops_at_its_depth_bound

test result: FAILED. 71 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
