*** crates/casm-cli/src/commands.rs:862:5: replace discover -> Result<Vec<PathBuf>, CommandError> with Ok(vec![Default::default()])

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace discover -> Result<Vec<PathBuf>, CommandError> with Ok(vec![Default::default()])
@@ -854,20 +854,17 @@
     Ok(ExitCode::Success)
 }
 
 /// Finds every plausible architecture file under `directory`.
 ///
 /// The walk is depth-bounded and skips `target/`, `node_modules/`, and dot-directories,
 /// because sweeping a build directory finds nothing and takes forever.
 fn discover(directory: &Path) -> Result<Vec<PathBuf>, CommandError> {
-    let mut found = Vec::new();
-    walk(directory, 0, &mut found)?;
-    found.sort();
-    Ok(found)
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The maximum directory depth `check` will descend.
 ///
 /// NASA Rule 4: the recursion needs a statically provable bound. Eight levels reaches
 /// any sanely-organised repository and cannot be driven into a symlink loop.
 const MAX_WALK_DEPTH: usize = 8;

---- commands::tests::a_sweep_of_only_clean_files_succeeds stdout ----
: FAILED TO PARSE
  cannot read '': No such file or directory (os error 2)

checked 0 of 1 file(s)

thread 'commands::tests::a_sweep_of_only_clean_files_succeeds' (1204250) panicked at crates/casm-cli/src/commands.rs:1493:9:
assertion `left == right` failed
  left: Failure
 right: Success

---- commands::tests::a_sweep_reports_the_worst_exit_code_it_found stdout ----
: FAILED TO PARSE
  cannot read '': No such file or directory (os error 2)

checked 0 of 1 file(s)

thread 'commands::tests::a_sweep_reports_the_worst_exit_code_it_found' (1204251) panicked at crates/casm-cli/src/commands.rs:1475:9:
assertion `left == right` failed: the worst finding across the directory decides the exit code
  left: Failure
 right: ValidationErrors

---- commands::tests::check_returns_success_when_nothing_is_found stdout ----
: FAILED TO PARSE
  cannot read '': No such file or directory (os error 2)

checked 0 of 1 file(s)

thread 'commands::tests::check_returns_success_when_nothing_is_found' (1204255) panicked at crates/casm-cli/src/commands.rs:1093:9:
assertion `left == right` failed
  left: 3
 right: 0

failures:
    commands::tests::a_sweep_of_only_clean_files_succeeds
    commands::tests::a_sweep_reports_the_worst_exit_code_it_found
    commands::tests::check_returns_success_when_nothing_is_found
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml
    commands::tests::discovery_reports_an_unreadable_directory
    commands::tests::discovery_skips_build_and_dot_directories
    commands::tests::the_check_sweep_records_a_span_for_every_file
    commands::tests::the_walk_stops_at_its_depth_bound

test result: FAILED. 71 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
