*** crates/casm-cli/src/commands.rs:876:14: replace > with == in walk

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace > with == in walk
@@ -868,17 +868,17 @@
 /// The maximum directory depth `check` will descend.
 ///
 /// NASA Rule 4: the recursion needs a statically provable bound. Eight levels reaches
 /// any sanely-organised repository and cannot be driven into a symlink loop.
 const MAX_WALK_DEPTH: usize = 8;
 
 /// Recursively collects architecture files, bounded by [`MAX_WALK_DEPTH`].
 fn walk(directory: &Path, depth: usize, found: &mut Vec<PathBuf>) -> Result<(), CommandError> {
-    if depth > MAX_WALK_DEPTH {
+    if depth == /* ~ changed by cargo-mutants ~ */ MAX_WALK_DEPTH {
         return Ok(());
     }
 
     let entries = std::fs::read_dir(directory)
         .map_err(|error| CommandError(format!("cannot read '{}': {error}", directory.display())))?;
 
     for entry in entries.flatten() {
         let path = entry.path();

---- commands::tests::the_walk_stops_at_its_depth_bound stdout ----

thread 'commands::tests::the_walk_stops_at_its_depth_bound' (1204154) panicked at crates/casm-cli/src/commands.rs:1518:9:
  left: 7
 right: 8

failures:
    commands::tests::the_walk_stops_at_its_depth_bound

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
