*** crates/casm-cli/src/commands.rs:876:14: replace > with < in walk

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace > with < in walk
@@ -868,17 +868,17 @@
 /// The maximum directory depth `check` will descend.
 ///
 /// NASA Rule 4: the recursion needs a statically provable bound. Eight levels reaches
 /// any sanely-organised repository and cannot be driven into a symlink loop.
 const MAX_WALK_DEPTH: usize = 8;
 
 /// Recursively collects architecture files, bounded by [`MAX_WALK_DEPTH`].
 fn walk(directory: &Path, depth: usize, found: &mut Vec<PathBuf>) -> Result<(), CommandError> {
-    if depth > MAX_WALK_DEPTH {
+    if depth < /* ~ changed by cargo-mutants ~ */ MAX_WALK_DEPTH {
         return Ok(());
     }
 
     let entries = std::fs::read_dir(directory)
         .map_err(|error| CommandError(format!("cannot read '{}': {error}", directory.display())))?;
 
     for entry in entries.flatten() {
         let path = entry.path();

---- commands::tests::a_sweep_reports_the_worst_exit_code_it_found stdout ----
no architecture files found under '/tmp/casm-cli-check-worst-019fd1f4-6610-7aa3-86f9-7c555d58d21e'

thread 'commands::tests::a_sweep_reports_the_worst_exit_code_it_found' (1205136) panicked at crates/casm-cli/src/commands.rs:1478:9:
assertion `left == right` failed: the worst finding across the directory decides the exit code
  left: Success
 right: ValidationErrors

---- commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span stdout ----
no architecture files found under '/tmp/casm-cli-check-telemetry-broken-019fd1f4-6612-7703-ae6f-cfdc39d922af'

thread 'commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span' (1205133) panicked at crates/casm-cli/src/commands.rs:1618:9:
assertion `left == right` failed
  left: 0
 right: 1

---- commands::tests::check_reports_a_failure_for_an_unparseable_file stdout ----
no architecture files found under '/tmp/casm-cli-broken-019fd1f4-6614-7130-b0a8-d234c6ea7738'

thread 'commands::tests::check_reports_a_failure_for_an_unparseable_file' (1205139) panicked at crates/casm-cli/src/commands.rs:1114:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span
    commands::tests::a_sweep_reports_the_worst_exit_code_it_found
    commands::tests::check_reports_a_failure_for_an_unparseable_file
    commands::tests::discovery_descends_into_subdirectories
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml
    commands::tests::discovery_reports_an_unreadable_directory
    commands::tests::the_check_sweep_records_a_span_for_every_file
    commands::tests::the_walk_stops_at_its_depth_bound

test result: FAILED. 71 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
