*** crates/casm-cli/src/commands.rs:887:42: replace == with != in walk

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace == with != in walk
@@ -879,17 +879,17 @@
 
     let entries = std::fs::read_dir(directory)
         .map_err(|error| CommandError(format!("cannot read '{}': {error}", directory.display())))?;
 
     for entry in entries.flatten() {
         let path = entry.path();
         let name = entry.file_name().to_string_lossy().to_string();
 
-        if name.starts_with('.') || name == "target" || name == "node_modules" {
+        if name.starts_with('.') || name != /* ~ changed by cargo-mutants ~ */ "target" || name == "node_modules" {
             continue;
         }
 
         if path.is_dir() {
             walk(&path, depth.saturating_add(1), found)?;
         } else if Format::from_path(&path).is_some() && is_architecture_file(&path) {
             found.push(path);
         }

---- commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span stdout ----
no architecture files found under '/tmp/casm-cli-check-telemetry-broken-019fd1f4-6f09-7fc1-9565-eb5c5266f6bb'

thread 'commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span' (1205680) panicked at crates/casm-cli/src/commands.rs:1618:9:
assertion `left == right` failed
  left: 0
 right: 1

---- commands::tests::a_sweep_reports_the_worst_exit_code_it_found stdout ----
no architecture files found under '/tmp/casm-cli-check-worst-019fd1f4-6f0a-7a30-b023-102cf31d32e1'

thread 'commands::tests::a_sweep_reports_the_worst_exit_code_it_found' (1205683) panicked at crates/casm-cli/src/commands.rs:1478:9:
assertion `left == right` failed: the worst finding across the directory decides the exit code
  left: Success
 right: ValidationErrors

---- commands::tests::check_reports_a_failure_for_an_unparseable_file stdout ----
no architecture files found under '/tmp/casm-cli-broken-019fd1f4-6f0a-7a30-b023-103764722054'

thread 'commands::tests::check_reports_a_failure_for_an_unparseable_file' (1205686) panicked at crates/casm-cli/src/commands.rs:1114:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span
    commands::tests::a_sweep_reports_the_worst_exit_code_it_found
    commands::tests::check_reports_a_failure_for_an_unparseable_file
    commands::tests::discovery_descends_into_subdirectories
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml
    commands::tests::the_check_sweep_records_a_span_for_every_file
    commands::tests::the_walk_stops_at_its_depth_bound

test result: FAILED. 72 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
