*** crates/casm-cli/src/commands.rs:907:5: replace is_architecture_file -> bool with true

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace is_architecture_file -> bool with true
@@ -899,20 +899,17 @@
 }
 
 /// Returns `true` if `path` looks like a CASIMIR architecture rather than any old YAML.
 ///
 /// Checked by content, not by filename: a repository is full of YAML that is not an
 /// architecture, and `check` reporting parse failures for every CI workflow file would
 /// make it useless.
 fn is_architecture_file(path: &Path) -> bool {
-    let Ok(source) = std::fs::read_to_string(path) else {
-        return false;
-    };
-    source.contains("nodes") && (source.contains("relationships") || source.contains("name"))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture stdout ----

thread 'commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture' (1206637) panicked at crates/casm-cli/src/commands.rs:1564:13:
assertion `left == right` failed: no-nodes.yaml should not be treated as an architecture
  left: true
 right: false

---- commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml stdout ----

thread 'commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml' (1206648) panicked at crates/casm-cli/src/commands.rs:1031:9:
assertion `left == right` failed: found ["/tmp/casm-cli-discover-019fd1f4-7913-7811-b81b-6f1aff8546fd/architecture.yaml", "/tmp/casm-cli-discover-019fd1f4-7913-7811-b81b-6f1aff8546fd/ci.yaml"]
  left: 2
 right: 1

failures:
    commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture
    commands::tests::discovery_finds_architecture_files_and_ignores_unrelated_yaml

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
