*** crates/casm-cli/src/commands.rs:910:30: replace && with || in is_architecture_file

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace && with || in is_architecture_file
@@ -902,17 +902,17 @@
 ///
 /// Checked by content, not by filename: a repository is full of YAML that is not an
 /// architecture, and `check` reporting parse failures for every CI workflow file would
 /// make it useless.
 fn is_architecture_file(path: &Path) -> bool {
     let Ok(source) = std::fs::read_to_string(path) else {
         return false;
     };
-    source.contains("nodes") && (source.contains("relationships") || source.contains("name"))
+    source.contains("nodes") || /* ~ changed by cargo-mutants ~ */ (source.contains("relationships") || source.contains("name"))
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture stdout ----

thread 'commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture' (1207637) panicked at crates/casm-cli/src/commands.rs:1567:13:
assertion `left == right` failed: no-nodes.yaml should not be treated as an architecture
  left: true
 right: false

failures:
    commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
