*** crates/casm-cli/src/commands.rs:910:67: replace || with && in is_architecture_file

*** mutation diff:
--- crates/casm-cli/src/commands.rs
+++ replace || with && in is_architecture_file
@@ -902,17 +902,17 @@
 ///
 /// Checked by content, not by filename: a repository is full of YAML that is not an
 /// architecture, and `check` reporting parse failures for every CI workflow file would
 /// make it useless.
 fn is_architecture_file(path: &Path) -> bool {
     let Ok(source) = std::fs::read_to_string(path) else {
         return false;
     };
-    source.contains("nodes") && (source.contains("relationships") || source.contains("name"))
+    source.contains("nodes") && (source.contains("relationships") && /* ~ changed by cargo-mutants ~ */ source.contains("name"))
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span stdout ----
no architecture files found under '/tmp/casm-cli-check-telemetry-broken-019fd1f4-9323-7f91-ad44-96b40ee44b4b'

thread 'commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span' (1207717) panicked at crates/casm-cli/src/commands.rs:1618:9:
assertion `left == right` failed
  left: 0
 right: 1

---- commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture stdout ----

thread 'commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture' (1207715) panicked at crates/casm-cli/src/commands.rs:1567:13:
assertion `left == right` failed: architecture.yaml should be treated as an architecture
  left: false
 right: true

---- commands::tests::check_reports_a_failure_for_an_unparseable_file stdout ----
no architecture files found under '/tmp/casm-cli-broken-019fd1f4-932a-7d02-8a39-5b005c07feee'

thread 'commands::tests::check_reports_a_failure_for_an_unparseable_file' (1207725) panicked at crates/casm-cli/src/commands.rs:1114:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    commands::tests::a_file_needs_nodes_and_something_else_to_look_like_an_architecture
    commands::tests::a_file_that_does_not_parse_is_an_error_outcome_on_its_span
    commands::tests::check_reports_a_failure_for_an_unparseable_file
    commands::tests::the_check_sweep_records_a_span_for_every_file
    commands::tests::the_walk_stops_at_its_depth_bound

test result: FAILED. 74 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
