*** crates/casm-core/src/architecture.rs:212:9: replace Architecture::builder -> ArchitectureConfig with Default::default()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::builder -> ArchitectureConfig with Default::default()
@@ -204,17 +204,17 @@
     #[serde(default, skip_serializing_if = "BTreeMap::is_empty")]
     metadata: BTreeMap<String, String>,
 }
 
 impl Architecture {
     /// Begins two-phase construction. Equivalent to [`ArchitectureConfig::new`].
     #[must_use]
     pub fn builder() -> ArchitectureConfig {
-        ArchitectureConfig::new()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The architecture's name.
     #[inline]
     #[must_use]
     pub const fn name(&self) -> &Name {
         &self.name
     }

*** result: Success
