*** crates/casm-core/src/architecture.rs:233:9: replace Architecture::description -> Option<&str> with None

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::description -> Option<&str> with None
@@ -225,17 +225,17 @@
     pub const fn version(&self) -> &Version {
         &self.version
     }
 
     /// The human-readable description, if any.
     #[inline]
     #[must_use]
     pub fn description(&self) -> Option<&str> {
-        self.description.as_deref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The architecture's annotations, in deterministic key order.
     #[inline]
     #[must_use]
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }

*** result: Success
