*** crates/casm-core/src/architecture.rs:254:9: replace Architecture::relationship_count -> usize with 0

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::relationship_count -> usize with 0
@@ -246,17 +246,17 @@
     pub fn node_count(&self) -> usize {
         self.nodes.len()
     }
 
     /// How many relationships this architecture contains.
     #[inline]
     #[must_use]
     pub fn relationship_count(&self) -> usize {
-        self.relationships.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the architecture contains no nodes.
     #[inline]
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.nodes.is_empty()
     }

---- architecture::tests::consuming_builders_compose stdout ----

thread 'architecture::tests::consuming_builders_compose' (1745068) panicked at crates/casm-core/src/architecture.rs:957:9:
assertion `left == right` failed
  left: 0
 right: 1

---- architecture::tests::the_same_pair_may_be_connected_with_different_semantics stdout ----

thread 'architecture::tests::the_same_pair_may_be_connected_with_different_semantics' (1745081) panicked at crates/casm-core/src/architecture.rs:767:9:
assertion `left == right` failed
  left: 0
 right: 2

---- architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one stdout ----

thread 'architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one' (1745087) panicked at crates/casm-core/src/architecture.rs:1086:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    architecture::tests::consuming_builders_compose
    architecture::tests::the_same_pair_may_be_connected_with_different_semantics
    architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
