*** crates/casm-core/src/architecture.rs:261:9: replace Architecture::is_empty -> bool with true

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::is_empty -> bool with true
@@ -253,17 +253,17 @@
     pub fn relationship_count(&self) -> usize {
         self.relationships.len()
     }
 
     /// Returns `true` if the architecture contains no nodes.
     #[inline]
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.nodes.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterates the nodes in insertion order.
     pub fn nodes(&self) -> impl Iterator<Item = &Node> {
         self.nodes.values()
     }
 
     /// Iterates the relationships in insertion order.

*** result: Success
