*** crates/casm-core/src/architecture.rs:261:9: replace Architecture::is_empty -> bool with false

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::is_empty -> bool with false
@@ -253,17 +253,17 @@
     pub fn relationship_count(&self) -> usize {
         self.relationships.len()
     }
 
     /// Returns `true` if the architecture contains no nodes.
     #[inline]
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.nodes.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterates the nodes in insertion order.
     pub fn nodes(&self) -> impl Iterator<Item = &Node> {
         self.nodes.values()
     }
 
     /// Iterates the relationships in insertion order.

---- architecture::tests::build_applies_sensible_defaults stdout ----

thread 'architecture::tests::build_applies_sensible_defaults' (1220231) panicked at crates/casm-core/src/architecture.rs:633:9:
assertion failed: architecture.is_empty()

failures:
    architecture::tests::build_applies_sensible_defaults

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
