*** crates/casm-core/src/architecture.rs:276:9: replace Architecture::conformance -> impl Iterator<Item =&Conformance> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::conformance -> impl Iterator<Item =&Conformance> with ::std::iter::empty()
@@ -268,17 +268,17 @@
 
     /// Iterates the relationships in insertion order.
     pub fn relationships(&self) -> impl Iterator<Item = &Relationship> {
         self.relationships.iter()
     }
 
     /// Iterates the pattern-conformance claims, in declaration order.
     pub fn conformance(&self) -> impl Iterator<Item = &Conformance> {
-        self.conformance.iter()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many patterns this architecture claims to conform to.
     #[inline]
     #[must_use]
     pub fn conformance_count(&self) -> usize {
         self.conformance.len()
     }

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1750148) panicked at crates/casm-core/src/architecture.rs:970:58:
called `Option::unwrap()` on a `None` value

---- merkle::tests::declaring_conformance_changes_the_fingerprint stdout ----

thread 'merkle::tests::declaring_conformance_changes_the_fingerprint' (1750271) panicked at crates/casm-core/src/merkle.rs:1180:9:
assertion `left != right` failed
  left: Fingerprint(1283e4cbe264…)
 right: Fingerprint(1283e4cbe264…)

---- merkle::tests::rebinding_a_role_changes_the_fingerprint stdout ----

thread 'merkle::tests::rebinding_a_role_changes_the_fingerprint' (1750279) panicked at crates/casm-core/src/merkle.rs:1220:9:
assertion `left != right` failed
  left: Fingerprint(1283e4cbe264…)
 right: Fingerprint(1283e4cbe264…)

failures:
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::rebinding_a_role_changes_the_fingerprint

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
