*** crates/casm-core/src/architecture.rs:283:9: replace Architecture::conformance_count -> usize with 0

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::conformance_count -> usize with 0
@@ -275,17 +275,17 @@
     pub fn conformance(&self) -> impl Iterator<Item = &Conformance> {
         self.conformance.iter()
     }
 
     /// How many patterns this architecture claims to conform to.
     #[inline]
     #[must_use]
     pub fn conformance_count(&self) -> usize {
-        self.conformance.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Looks up a node by identifier.
     #[must_use]
     pub fn node(&self, id: NodeId) -> Option<&Node> {
         self.nodes.get(&id)
     }

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1223678) panicked at crates/casm-core/src/architecture.rs:929:9:
assertion `left == right` failed
  left: 0
 right: 1

---- architecture::tests::two_versions_of_one_pattern_may_both_be_claimed stdout ----

thread 'architecture::tests::two_versions_of_one_pattern_may_both_be_claimed' (1223699) panicked at crates/casm-core/src/architecture.rs:983:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::two_versions_of_one_pattern_may_both_be_claimed

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
