*** crates/casm-core/src/architecture.rs:289:9: replace Architecture::node -> Option<&Node> with None

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::node -> Option<&Node> with None
@@ -281,17 +281,17 @@
     #[must_use]
     pub fn conformance_count(&self) -> usize {
         self.conformance.len()
     }
 
     /// Looks up a node by identifier.
     #[must_use]
     pub fn node(&self, id: NodeId) -> Option<&Node> {
-        self.nodes.get(&id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Looks up a node by its unique name.
     ///
     /// Unique-name enforcement is what makes this lookup unambiguous, which in turn is
     /// what lets authors write `source: payment-service` instead of a raw UUID.
     #[must_use]
     pub fn node_by_name(&self, name: &str) -> Option<&Node> {

---- architecture::tests::lookup_works_by_id_and_by_name stdout ----

thread 'architecture::tests::lookup_works_by_id_and_by_name' (1751723) panicked at crates/casm-core/src/architecture.rs:773:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1751735) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1751740) panicked at crates/casm-core/src/conformance.rs:719:17:
assertion `left == right` failed
  left: "019fd254-6017-7803-b563-591dd98edbea"
 right: "edge"

failures:
    architecture::tests::lookup_works_by_id_and_by_name
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint
    merkle::tests::every_relationship_gets_its_own_entry_keyed_by_what_it_connects
    merkle::tests::rebinding_a_role_changes_the_fingerprint

test result: FAILED. 198 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
