*** crates/casm-core/src/architecture.rs:298:9: replace Architecture::node_by_name -> Option<&Node> with None

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::node_by_name -> Option<&Node> with None
@@ -290,19 +290,17 @@
     }
 
     /// Looks up a node by its unique name.
     ///
     /// Unique-name enforcement is what makes this lookup unambiguous, which in turn is
     /// what lets authors write `source: payment-service` instead of a raw UUID.
     #[must_use]
     pub fn node_by_name(&self, name: &str) -> Option<&Node> {
-        self.nodes
-            .values()
-            .find(|node| node.name().as_str() == name)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if a node with this identifier is present.
     #[must_use]
     pub fn contains(&self, id: NodeId) -> bool {
         self.nodes.contains_key(&id)
     }

---- architecture::tests::lookup_works_by_id_and_by_name stdout ----

thread 'architecture::tests::lookup_works_by_id_and_by_name' (1225817) panicked at crates/casm-core/src/architecture.rs:775:9:
assertion failed: architecture.node_by_name("orders-db").is_some()

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1225828) panicked at crates/casm-core/src/conformance.rs:605:58:
called `Option::unwrap()` on a `None` value

---- architecture::tests::duplicate_node_names_are_rejected stdout ----

thread 'architecture::tests::duplicate_node_names_are_rejected' (1225814) panicked at crates/casm-core/src/architecture.rs:668:14:

failures:
    architecture::tests::duplicate_node_names_are_rejected
    architecture::tests::lookup_works_by_id_and_by_name
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::roles_bind_automatically_when_exactly_one_node_fits
    merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them
    merkle::tests::identical_architectures_fingerprint_identically
    merkle::tests::rebinding_a_role_changes_the_fingerprint

test result: FAILED. 180 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
