*** crates/casm-core/src/architecture.rs:300:47: replace == with != in Architecture::node_by_name

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::node_by_name
@@ -292,17 +292,17 @@
     /// Looks up a node by its unique name.
     ///
     /// Unique-name enforcement is what makes this lookup unambiguous, which in turn is
     /// what lets authors write `source: payment-service` instead of a raw UUID.
     #[must_use]
     pub fn node_by_name(&self, name: &str) -> Option<&Node> {
         self.nodes
             .values()
-            .find(|node| node.name().as_str() == name)
+            .find(|node| node.name().as_str() != /* ~ changed by cargo-mutants ~ */ name)
     }
 
     /// Returns `true` if a node with this identifier is present.
     #[must_use]
     pub fn contains(&self, id: NodeId) -> bool {
         self.nodes.contains_key(&id)
     }

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1226219) panicked at crates/casm-core/src/architecture.rs:623:14:
sample architecture is valid: DuplicateName { name: "orders-db", architecture: "checkout" }

---- architecture::tests::a_binding_to_an_absent_node_is_rejected stdout ----

thread 'architecture::tests::a_binding_to_an_absent_node_is_rejected' (1226217) panicked at crates/casm-core/src/architecture.rs:623:14:
sample architecture is valid: DuplicateName { name: "orders-db", architecture: "checkout" }

---- architecture::tests::an_identical_relationship_is_rejected stdout ----

thread 'architecture::tests::an_identical_relationship_is_rejected' (1226222) panicked at crates/casm-core/src/architecture.rs:623:14:
sample architecture is valid: DuplicateName { name: "orders-db", architecture: "checkout" }

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::build_resolves_edges_declared_before_their_nodes
    architecture::tests::consuming_builders_compose
    architecture::tests::degree_counts_both_directions
    architecture::tests::duplicate_node_names_are_rejected
    architecture::tests::incoming_and_outgoing_partition_the_edges
    architecture::tests::isolated_nodes_are_identified
    architecture::tests::lookup_works_by_id_and_by_name
    architecture::tests::node_iteration_order_is_stable_across_runs

test result: FAILED. 132 passed; 56 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
