*** crates/casm-core/src/architecture.rs:306:9: replace Architecture::contains -> bool with false

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::contains -> bool with false
@@ -298,17 +298,17 @@
         self.nodes
             .values()
             .find(|node| node.name().as_str() == name)
     }
 
     /// Returns `true` if a node with this identifier is present.
     #[must_use]
     pub fn contains(&self, id: NodeId) -> bool {
-        self.nodes.contains_key(&id)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterates the relationships originating at `id`.
     pub fn outgoing(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
         self.relationships
             .iter()
             .filter(move |edge| edge.source() == id)
     }

*** result: Success
