*** crates/casm-core/src/architecture.rs:311:9: replace Architecture::outgoing -> impl Iterator<Item =&Relationship> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::outgoing -> impl Iterator<Item =&Relationship> with ::std::iter::empty()
@@ -303,19 +303,17 @@
     /// Returns `true` if a node with this identifier is present.
     #[must_use]
     pub fn contains(&self, id: NodeId) -> bool {
         self.nodes.contains_key(&id)
     }
 
     /// Iterates the relationships originating at `id`.
     pub fn outgoing(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
-        self.relationships
-            .iter()
-            .filter(move |edge| edge.source() == id)
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterates the relationships terminating at `id`.
     pub fn incoming(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
         self.relationships
             .iter()
             .filter(move |edge| edge.target() == id)
     }

---- architecture::tests::incoming_and_outgoing_partition_the_edges stdout ----

thread 'architecture::tests::incoming_and_outgoing_partition_the_edges' (1227586) panicked at crates/casm-core/src/architecture.rs:783:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    architecture::tests::incoming_and_outgoing_partition_the_edges

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
