*** crates/casm-core/src/architecture.rs:313:47: replace == with != in Architecture::outgoing

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::outgoing
@@ -305,17 +305,17 @@
     pub fn contains(&self, id: NodeId) -> bool {
         self.nodes.contains_key(&id)
     }
 
     /// Iterates the relationships originating at `id`.
     pub fn outgoing(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
         self.relationships
             .iter()
-            .filter(move |edge| edge.source() == id)
+            .filter(move |edge| edge.source() != /* ~ changed by cargo-mutants ~ */ id)
     }
 
     /// Iterates the relationships terminating at `id`.
     pub fn incoming(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
         self.relationships
             .iter()
             .filter(move |edge| edge.target() == id)
     }

---- architecture::tests::incoming_and_outgoing_partition_the_edges stdout ----

thread 'architecture::tests::incoming_and_outgoing_partition_the_edges' (1756052) panicked at crates/casm-core/src/architecture.rs:785:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    architecture::tests::incoming_and_outgoing_partition_the_edges

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
