*** crates/casm-core/src/architecture.rs:318:9: replace Architecture::incoming -> impl Iterator<Item =&Relationship> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::incoming -> impl Iterator<Item =&Relationship> with ::std::iter::empty()
@@ -310,19 +310,17 @@
     pub fn outgoing(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
         self.relationships
             .iter()
             .filter(move |edge| edge.source() == id)
     }
 
     /// Iterates the relationships terminating at `id`.
     pub fn incoming(&self, id: NodeId) -> impl Iterator<Item = &Relationship> {
-        self.relationships
-            .iter()
-            .filter(move |edge| edge.target() == id)
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Counts every relationship touching `id` in either direction.
     #[must_use]
     pub fn degree(&self, id: NodeId) -> usize {
         self.relationships
             .iter()
             .filter(|edge| edge.source() == id || edge.target() == id)

---- architecture::tests::incoming_and_outgoing_partition_the_edges stdout ----

thread 'architecture::tests::incoming_and_outgoing_partition_the_edges' (1756310) panicked at crates/casm-core/src/architecture.rs:786:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    architecture::tests::incoming_and_outgoing_partition_the_edges

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
