*** crates/casm-core/src/architecture.rs:326:9: replace Architecture::degree -> usize with 0

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::degree -> usize with 0
@@ -318,20 +318,17 @@
         self.relationships
             .iter()
             .filter(move |edge| edge.target() == id)
     }
 
     /// Counts every relationship touching `id` in either direction.
     #[must_use]
     pub fn degree(&self, id: NodeId) -> usize {
-        self.relationships
-            .iter()
-            .filter(|edge| edge.source() == id || edge.target() == id)
-            .count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the nodes with no relationships at all.
     ///
     /// An isolated node is usually either a modelling mistake or a component nobody
     /// remembers owning — both worth surfacing.
     #[must_use]
     pub fn isolated_nodes(&self) -> Vec<&Node> {

---- architecture::tests::degree_counts_both_directions stdout ----

thread 'architecture::tests::degree_counts_both_directions' (1758188) panicked at crates/casm-core/src/architecture.rs:791:9:
assertion `left == right` failed
  left: 0
 right: 1

---- architecture::tests::removing_a_referenced_node_is_refused_with_a_count stdout ----

thread 'architecture::tests::removing_a_referenced_node_is_refused_with_a_count' (1758195) panicked at crates/casm-core/src/architecture.rs:813:22:
expected NodeStillReferenced, got Ok(Some(Node { id: NodeId(019fd254-7897-7181-b1a9-d3d23821e155), name: Name("api"), node_type: Service, description: None, interfaces: [], controls: [], metadata: {} }))

---- architecture::tests::isolated_nodes_are_identified stdout ----

thread 'architecture::tests::isolated_nodes_are_identified' (1758192) panicked at crates/casm-core/src/architecture.rs:798:9:
assertion failed: architecture.isolated_nodes().is_empty()

failures:
    architecture::tests::degree_counts_both_directions
    architecture::tests::isolated_nodes_are_identified
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
