*** crates/casm-core/src/architecture.rs:338:9: replace Architecture::isolated_nodes -> Vec<&Node> with vec![]

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::isolated_nodes -> Vec<&Node> with vec![]
@@ -330,20 +330,17 @@
     }
 
     /// Returns the nodes with no relationships at all.
     ///
     /// An isolated node is usually either a modelling mistake or a component nobody
     /// remembers owning — both worth surfacing.
     #[must_use]
     pub fn isolated_nodes(&self) -> Vec<&Node> {
-        self.nodes
-            .values()
-            .filter(|node| self.degree(node.id()) == 0)
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Inserts a node, enforcing name and identifier uniqueness.
     ///
     /// # Errors
     ///
     /// - [`ArchitectureError::DuplicateId`] if the identifier is already present.
     /// - [`ArchitectureError::DuplicateName`] if the name is already taken.

---- architecture::tests::isolated_nodes_are_identified stdout ----

thread 'architecture::tests::isolated_nodes_are_identified' (1760653) panicked at crates/casm-core/src/architecture.rs:804:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    architecture::tests::isolated_nodes_are_identified

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
