*** crates/casm-core/src/architecture.rs:340:51: replace == with != in Architecture::isolated_nodes

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::isolated_nodes
@@ -332,17 +332,17 @@
     /// Returns the nodes with no relationships at all.
     ///
     /// An isolated node is usually either a modelling mistake or a component nobody
     /// remembers owning — both worth surfacing.
     #[must_use]
     pub fn isolated_nodes(&self) -> Vec<&Node> {
         self.nodes
             .values()
-            .filter(|node| self.degree(node.id()) == 0)
+            .filter(|node| self.degree(node.id()) != /* ~ changed by cargo-mutants ~ */ 0)
             .collect()
     }
 
     /// Inserts a node, enforcing name and identifier uniqueness.
     ///
     /// # Errors
     ///
     /// - [`ArchitectureError::DuplicateId`] if the identifier is already present.

---- architecture::tests::isolated_nodes_are_identified stdout ----

thread 'architecture::tests::isolated_nodes_are_identified' (1234374) panicked at crates/casm-core/src/architecture.rs:801:9:
assertion failed: architecture.isolated_nodes().is_empty()

failures:
    architecture::tests::isolated_nodes_are_identified

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
