*** crates/casm-core/src/architecture.rs:380:9: replace Architecture::add_relationship -> Result<(), ArchitectureError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::add_relationship -> Result<(), ArchitectureError> with Ok(())
@@ -372,35 +372,17 @@
     ///
     /// - [`ArchitectureError::DanglingReference`] if either endpoint is absent. The
     ///   `endpoint` field names which end failed, so the caller can point at it.
     /// - [`ArchitectureError::DuplicateRelationship`] if an identical edge exists.
     pub fn add_relationship(
         &mut self,
         relationship: Relationship,
     ) -> Result<(), ArchitectureError> {
-        self.require_node(relationship.source(), "source")?;
-        self.require_node(relationship.target(), "target")?;
-
-        let identity = relationship.identity();
-        if self
-            .relationships
-            .iter()
-            .any(|existing| existing.identity() == identity)
-        {
-            return Err(ArchitectureError::DuplicateRelationship {
-                source_id: relationship.source().to_string(),
-                target_id: relationship.target().to_string(),
-                kind: relationship.relationship_type().to_string(),
-                architecture: self.name.as_str().to_owned(),
-            });
-        }
-
-        self.relationships.push(relationship);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Records a conformance claim, enforcing that its bindings resolve.
     ///
     /// A binding to a node that is not present is the same class of defect as a dangling
     /// edge, and is refused for the same reason: every consumer downstream would
     /// otherwise have to handle a case that should never have been representable.
     ///

---- architecture::tests::a_dangling_source_is_rejected_and_named_as_such stdout ----

thread 'architecture::tests::a_dangling_source_is_rejected_and_named_as_such' (1763372) panicked at crates/casm-core/src/architecture.rs:697:14:

---- architecture::tests::a_dangling_target_is_rejected_and_named_as_such stdout ----

thread 'architecture::tests::a_dangling_target_is_rejected_and_named_as_such' (1763373) panicked at crates/casm-core/src/architecture.rs:718:14:

---- architecture::tests::an_identical_relationship_is_rejected stdout ----

thread 'architecture::tests::an_identical_relationship_is_rejected' (1763375) panicked at crates/casm-core/src/architecture.rs:734:14:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    architecture::tests::a_dangling_source_is_rejected_and_named_as_such
    architecture::tests::a_dangling_target_is_rejected_and_named_as_such
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::consuming_builders_compose
    architecture::tests::degree_counts_both_directions
    architecture::tests::incoming_and_outgoing_partition_the_edges
    architecture::tests::isolated_nodes_are_identified
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count
    architecture::tests::the_same_pair_may_be_connected_with_different_semantics
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde
    architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one
    conformance::tests::a_conforming_architecture_reports_nothing_unmet

test result: FAILED. 189 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
