*** crates/casm-core/src/architecture.rs:452:46: replace == with != in Architecture::check_conformance

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::check_conformance
@@ -444,17 +444,17 @@
                 });
             }
         }
 
         let claimed_twice = self
             .conformance
             .iter()
             .take(preceding)
-            .any(|earlier| earlier.pattern() == claim.pattern());
+            .any(|earlier| earlier.pattern() != /* ~ changed by cargo-mutants ~ */ claim.pattern());
         if claimed_twice {
             return Err(ArchitectureError::DuplicateConformance {
                 pattern: claim.pattern().to_string(),
                 architecture: self.name.as_str().to_owned(),
             });
         }
 
         Ok(())

---- architecture::tests::the_same_pattern_cannot_be_claimed_twice stdout ----

thread 'architecture::tests::the_same_pattern_cannot_be_claimed_twice' (1766237) panicked at crates/casm-core/src/architecture.rs:1004:14:

---- architecture::tests::two_versions_of_one_pattern_may_both_be_claimed stdout ----

thread 'architecture::tests::two_versions_of_one_pattern_may_both_be_claimed' (1766238) panicked at crates/casm-core/src/architecture.rs:1021:14:
called `Result::unwrap()` on an `Err` value: DuplicateConformance { pattern: "p@2.0.0", architecture: "checkout" }

failures:
    architecture::tests::the_same_pattern_cannot_be_claimed_twice
    architecture::tests::two_versions_of_one_pattern_may_both_be_claimed

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
