*** crates/casm-core/src/architecture.rs:474:9: replace Architecture::remove_node -> Result<Option<Node>, ArchitectureError> with Ok(None)

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::remove_node -> Result<Option<Node>, ArchitectureError> with Ok(None)
@@ -466,32 +466,17 @@
     /// quietly sever edges the author never inspected. A conformance binding counts as a
     /// reference for the same reason — removing the node a pattern role is bound to
     /// should make the author revisit the claim, not silently invalidate it.
     ///
     /// # Errors
     ///
     /// Returns [`ArchitectureError::NodeStillReferenced`] with the reference count.
     pub fn remove_node(&mut self, id: NodeId) -> Result<Option<Node>, ArchitectureError> {
-        let bound = self
-            .conformance
-            .iter()
-            .flat_map(|claim| claim.bindings().values())
-            .filter(|bound| **bound == id)
-            .count();
-
-        let references = self.degree(id) + bound;
-        if references > 0 {
-            return Err(ArchitectureError::NodeStillReferenced {
-                id: id.to_string(),
-                count: references,
-            });
-        }
-
-        Ok(self.nodes.shift_remove(&id))
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Consuming variant of [`Architecture::add_node`], for pipeline-style construction.
     ///
     /// # Errors
     ///
     /// As [`Architecture::add_node`].
     pub fn with_node(mut self, node: Node) -> Result<Self, ArchitectureError> {

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1239379) panicked at crates/casm-core/src/architecture.rs:987:56:
called `Result::unwrap_err()` on an `Ok` value: None

---- architecture::tests::removing_a_referenced_node_is_refused_with_a_count stdout ----

thread 'architecture::tests::removing_a_referenced_node_is_refused_with_a_count' (1239407) panicked at crates/casm-core/src/architecture.rs:801:22:
expected NodeStillReferenced, got Ok(None)

---- architecture::tests::removing_an_unreferenced_node_succeeds stdout ----

thread 'architecture::tests::removing_an_unreferenced_node_succeeds' (1239409) panicked at crates/casm-core/src/architecture.rs:818:9:
assertion failed: removed.is_some()

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count
    architecture::tests::removing_an_unreferenced_node_succeeds

test result: FAILED. 185 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
