*** crates/casm-core/src/architecture.rs:478:37: replace == with != in Architecture::remove_node

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::remove_node
@@ -470,17 +470,17 @@
     /// # Errors
     ///
     /// Returns [`ArchitectureError::NodeStillReferenced`] with the reference count.
     pub fn remove_node(&mut self, id: NodeId) -> Result<Option<Node>, ArchitectureError> {
         let bound = self
             .conformance
             .iter()
             .flat_map(|claim| claim.bindings().values())
-            .filter(|bound| **bound == id)
+            .filter(|bound| **bound != /* ~ changed by cargo-mutants ~ */ id)
             .count();
 
         let references = self.degree(id) + bound;
         if references > 0 {
             return Err(ArchitectureError::NodeStillReferenced {
                 id: id.to_string(),
                 count: references,
             });

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1239672) panicked at crates/casm-core/src/architecture.rs:1002:56:
called `Result::unwrap_err()` on an `Ok` value: Some(Node { id: NodeId(019fd1f5-ea8e-72d0-bc66-c2e9b6345fe1), name: Name("cache"), node_type: Cache, description: None, interfaces: [], controls: [], metadata: {} })

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim

test result: FAILED. 187 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
