*** crates/casm-core/src/architecture.rs:481:42: replace + with * in Architecture::remove_node

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace + with * in Architecture::remove_node
@@ -473,17 +473,17 @@
     pub fn remove_node(&mut self, id: NodeId) -> Result<Option<Node>, ArchitectureError> {
         let bound = self
             .conformance
             .iter()
             .flat_map(|claim| claim.bindings().values())
             .filter(|bound| **bound == id)
             .count();
 
-        let references = self.degree(id) + bound;
+        let references = self.degree(id) * /* ~ changed by cargo-mutants ~ */ bound;
         if references > 0 {
             return Err(ArchitectureError::NodeStillReferenced {
                 id: id.to_string(),
                 count: references,
             });
         }
 
         Ok(self.nodes.shift_remove(&id))

---- architecture::tests::removing_a_referenced_node_is_refused_with_a_count stdout ----

thread 'architecture::tests::removing_a_referenced_node_is_refused_with_a_count' (1768484) panicked at crates/casm-core/src/architecture.rs:816:22:
expected NodeStillReferenced, got Ok(Some(Node { id: NodeId(019fd254-a1ca-7a60-85f4-4d164e44307a), name: Name("api"), node_type: Service, description: None, interfaces: [], controls: [], metadata: {} }))

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1768457) panicked at crates/casm-core/src/architecture.rs:1042:56:
called `Result::unwrap_err()` on an `Ok` value: Some(Node { id: NodeId(019fd254-a1ca-7a60-85f4-4d3dbfbb7a54), name: Name("cache"), node_type: Cache, description: None, interfaces: [], controls: [], metadata: {} })

failures:
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
