*** crates/casm-core/src/architecture.rs:482:23: replace > with >= in Architecture::remove_node

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace > with >= in Architecture::remove_node
@@ -474,17 +474,17 @@
         let bound = self
             .conformance
             .iter()
             .flat_map(|claim| claim.bindings().values())
             .filter(|bound| **bound == id)
             .count();
 
         let references = self.degree(id) + bound;
-        if references > 0 {
+        if references >= /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(ArchitectureError::NodeStillReferenced {
                 id: id.to_string(),
                 count: references,
             });
         }
 
         Ok(self.nodes.shift_remove(&id))
     }

---- architecture::tests::removing_an_unreferenced_node_succeeds stdout ----

thread 'architecture::tests::removing_an_unreferenced_node_succeeds' (1242052) panicked at crates/casm-core/src/architecture.rs:832:59:
called `Result::unwrap()` on an `Err` value: NodeStillReferenced { id: "019fd1f5-f7c6-70f3-863f-2ed4de066bba", count: 0 }

---- architecture::tests::removing_an_absent_node_is_not_an_error stdout ----

thread 'architecture::tests::removing_an_absent_node_is_not_an_error' (1242051) panicked at crates/casm-core/src/architecture.rs:840:57:
called `Result::unwrap()` on an `Err` value: NodeStillReferenced { id: "019fd1f5-f7c6-70f3-863f-2f2faa7175a4", count: 0 }

failures:
    architecture::tests::removing_an_absent_node_is_not_an_error
    architecture::tests::removing_an_unreferenced_node_succeeds

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
