*** crates/casm-core/src/architecture.rs:526:9: replace Architecture::verify_invariants -> Result<(), ArchitectureError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::verify_invariants -> Result<(), ArchitectureError> with Ok(())
@@ -518,55 +518,17 @@
     /// as a defence-in-depth check for values that crossed a trust boundary — notably
     /// `serde` deserialisation, which bypasses [`ArchitectureConfig::build`] entirely.
     /// `casm-parser` calls it on every load.
     ///
     /// # Errors
     ///
     /// Returns the first violated invariant.
     pub fn verify_invariants(&self) -> Result<(), ArchitectureError> {
-        for (index, node) in self.nodes.values().enumerate() {
-            let name_taken = self
-                .nodes
-                .values()
-                .take(index)
-                .any(|earlier| earlier.name() == node.name());
-            if name_taken {
-                return Err(ArchitectureError::DuplicateName {
-                    name: node.name().as_str().to_owned(),
-                    architecture: self.name.as_str().to_owned(),
-                });
-            }
-        }
-
-        for (index, edge) in self.relationships.iter().enumerate() {
-            self.require_node(edge.source(), "source")?;
-            self.require_node(edge.target(), "target")?;
-
-            let identity = edge.identity();
-            let duplicated = self
-                .relationships
-                .iter()
-                .take(index)
-                .any(|earlier| earlier.identity() == identity);
-            if duplicated {
-                return Err(ArchitectureError::DuplicateRelationship {
-                    source_id: edge.source().to_string(),
-                    target_id: edge.target().to_string(),
-                    kind: edge.relationship_type().to_string(),
-                    architecture: self.name.as_str().to_owned(),
-                });
-            }
-        }
-
-        for (index, claim) in self.conformance.iter().enumerate() {
-            self.check_conformance(claim, index)?;
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Fails unless `id` names a node in this architecture.
     fn require_node(&self, id: NodeId, endpoint: &'static str) -> Result<(), ArchitectureError> {
         if self.nodes.contains_key(&id) {
             return Ok(());
         }
         Err(ArchitectureError::DanglingReference {

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (1772759) panicked at crates/casm-core/src/architecture.rs:1085:9:
assertion failed: matches!(smuggled.verify_invariants(),
    Err(ArchitectureError::DanglingBinding { .. }))

---- architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde' (1772760) panicked at crates/casm-core/src/architecture.rs:838:48:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
