*** crates/casm-core/src/architecture.rs:531:47: replace == with != in Architecture::verify_invariants

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::verify_invariants
@@ -523,17 +523,17 @@
     ///
     /// Returns the first violated invariant.
     pub fn verify_invariants(&self) -> Result<(), ArchitectureError> {
         for (index, node) in self.nodes.values().enumerate() {
             let name_taken = self
                 .nodes
                 .values()
                 .take(index)
-                .any(|earlier| earlier.name() == node.name());
+                .any(|earlier| earlier.name() != /* ~ changed by cargo-mutants ~ */ node.name());
             if name_taken {
                 return Err(ArchitectureError::DuplicateName {
                     name: node.name().as_str().to_owned(),
                     architecture: self.name.as_str().to_owned(),
                 });
             }
         }

---- architecture::tests::architecture_round_trips_through_json stdout ----

thread 'architecture::tests::architecture_round_trips_through_json' (1772529) panicked at crates/casm-core/src/architecture.rs:936:9:
assertion failed: back.verify_invariants().is_ok()

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (1772547) panicked at crates/casm-core/src/architecture.rs:1123:9:
assertion failed: matches!(smuggled.verify_invariants(),
    Err(ArchitectureError::DanglingBinding { .. }))

---- architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde' (1772548) panicked at crates/casm-core/src/architecture.rs:877:9:
got DuplicateName { name: "orders-db", architecture: "checkout" }

failures:
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde
    architecture::tests::verify_invariants_passes_on_a_constructed_architecture
    architecture::tests::verifying_invariants_tells_a_duplicate_edge_from_a_distinct_one

test result: FAILED. 200 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
