*** crates/casm-core/src/architecture.rs:549:51: replace == with != in Architecture::verify_invariants

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace == with != in Architecture::verify_invariants
@@ -541,17 +541,17 @@
             self.require_node(edge.source(), "source")?;
             self.require_node(edge.target(), "target")?;
 
             let identity = edge.identity();
             let duplicated = self
                 .relationships
                 .iter()
                 .take(index)
-                .any(|earlier| earlier.identity() == identity);
+                .any(|earlier| earlier.identity() != /* ~ changed by cargo-mutants ~ */ identity);
             if duplicated {
                 return Err(ArchitectureError::DuplicateRelationship {
                     source_id: edge.source().to_string(),
                     target_id: edge.target().to_string(),
                     kind: edge.relationship_type().to_string(),
                     architecture: self.name.as_str().to_owned(),
                 });
             }

*** result: Success
