*** crates/casm-core/src/architecture.rs:569:9: replace Architecture::require_node -> Result<(), ArchitectureError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace Architecture::require_node -> Result<(), ArchitectureError> with Ok(())
@@ -561,24 +561,17 @@
             self.check_conformance(claim, index)?;
         }
 
         Ok(())
     }
 
     /// Fails unless `id` names a node in this architecture.
     fn require_node(&self, id: NodeId, endpoint: &'static str) -> Result<(), ArchitectureError> {
-        if self.nodes.contains_key(&id) {
-            return Ok(());
-        }
-        Err(ArchitectureError::DanglingReference {
-            endpoint,
-            id: id.to_string(),
-            architecture: self.name.as_str().to_owned(),
-        })
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- architecture::tests::a_dangling_target_is_rejected_and_named_as_such stdout ----

thread 'architecture::tests::a_dangling_target_is_rejected_and_named_as_such' (1244782) panicked at crates/casm-core/src/architecture.rs:729:14:

---- architecture::tests::a_dangling_source_is_rejected_and_named_as_such stdout ----

thread 'architecture::tests::a_dangling_source_is_rejected_and_named_as_such' (1244781) panicked at crates/casm-core/src/architecture.rs:708:14:

---- architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde' (1244803) panicked at crates/casm-core/src/architecture.rs:869:48:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    architecture::tests::a_dangling_source_is_rejected_and_named_as_such
    architecture::tests::a_dangling_target_is_rejected_and_named_as_such
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde

test result: FAILED. 185 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
