*** crates/casm-core/src/architecture.rs:89:9: replace ArchitectureConfig::node -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace ArchitectureConfig::node -> Self with Default::default()
@@ -81,18 +81,17 @@
     pub fn description(mut self, description: impl Into<String>) -> Self {
         self.description = Some(description.into());
         self
     }
 
     /// Stages a node for inclusion.
     #[must_use]
     pub fn node(mut self, node: Node) -> Self {
-        self.nodes.push(node);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Stages a relationship for inclusion.
     #[must_use]
     pub fn relationship(mut self, relationship: Relationship) -> Self {
         self.relationships.push(relationship);
         self
     }

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1746430) panicked at crates/casm-core/src/architecture.rs:1038:14:
called `Result::unwrap()` on an `Err` value: DanglingBinding { pattern: "p@1.0.0", role: "store", id: "019fd254-40d9-7ae2-bdcb-2a8c9306eb53", architecture: "unnamed-architecture" }

---- architecture::tests::an_architecture_reports_what_it_was_built_with stdout ----

thread 'architecture::tests::an_architecture_reports_what_it_was_built_with' (1746434) panicked at crates/casm-core/src/architecture.rs:910:9:
assertion `left == right` failed
  left: "unnamed-architecture"
 right: "checkout"

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1746431) panicked at crates/casm-core/src/architecture.rs:622:14:
sample architecture is valid: DanglingReference { endpoint: "source", id: "019fd254-40d9-7ae2-bdcb-2aa8e937558b", architecture: "unnamed-architecture" }

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::a_dangling_target_is_rejected_and_named_as_such
    architecture::tests::an_architecture_reports_what_it_was_built_with
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::degree_counts_both_directions
    architecture::tests::duplicate_node_ids_are_rejected
    architecture::tests::duplicate_node_names_are_rejected
    architecture::tests::incoming_and_outgoing_partition_the_edges
    architecture::tests::isolated_nodes_are_identified

test result: FAILED. 143 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
