*** crates/casm-core/src/architecture.rs:96:9: replace ArchitectureConfig::relationship -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/architecture.rs
+++ replace ArchitectureConfig::relationship -> Self with Default::default()
@@ -88,18 +88,17 @@
     pub fn node(mut self, node: Node) -> Self {
         self.nodes.push(node);
         self
     }
 
     /// Stages a relationship for inclusion.
     #[must_use]
     pub fn relationship(mut self, relationship: Relationship) -> Self {
-        self.relationships.push(relationship);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Stages a claim that this architecture conforms to a pattern.
     #[must_use]
     pub fn conformance(mut self, conformance: Conformance) -> Self {
         self.conformance.push(conformance);
         self
     }

---- architecture::tests::an_identical_relationship_is_rejected stdout ----

thread 'architecture::tests::an_identical_relationship_is_rejected' (1735639) panicked at crates/casm-core/src/architecture.rs:752:9:
assertion failed: matches!(err, ArchitectureError::DuplicateRelationship { .. })

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1735635) panicked at crates/casm-core/src/architecture.rs:966:65:
called `Result::unwrap()` on an `Err` value: DanglingBinding { pattern: "secure-web-tier@1.0.0", role: "application", id: "019fd253-7de9-7111-8db2-d1d9ba9dd8e3", architecture: "unnamed-architecture" }

---- architecture::tests::a_dangling_source_is_rejected_and_named_as_such stdout ----

thread 'architecture::tests::a_dangling_source_is_rejected_and_named_as_such' (1735636) panicked at crates/casm-core/src/architecture.rs:714:14:
called `Result::unwrap_err()` on an `Ok` value: Architecture { name: Name("unnamed-architecture"), version: Version { major: 0, minor: 1, patch: 0 }, description: None, nodes: {}, relationships: [], conformance: [], metadata: {} }

failures:
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::a_dangling_source_is_rejected_and_named_as_such
    architecture::tests::a_dangling_target_is_rejected_and_named_as_such
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::degree_counts_both_directions
    architecture::tests::incoming_and_outgoing_partition_the_edges
    architecture::tests::lookup_works_by_id_and_by_name
    architecture::tests::node_iteration_order_is_stable_across_runs
    architecture::tests::removing_a_referenced_node_is_refused_with_a_count
    architecture::tests::removing_an_unreferenced_node_succeeds
    architecture::tests::the_same_pair_may_be_connected_with_different_semantics
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde

test result: FAILED. 169 passed; 36 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
