*** crates/casm-core/src/conformance.rs:248:9: replace ConformanceReport::unmet -> &[Unmet] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace ConformanceReport::unmet -> &[Unmet] with Vec::leak(Vec::new())
@@ -240,17 +240,17 @@
     pub fn bindings(&self) -> &[(String, NodeId)] {
         &self.bindings
     }
 
     /// Everything the architecture fails to satisfy.
     #[inline]
     #[must_use]
     pub fn unmet(&self) -> &[Unmet] {
-        &self.unmet
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether the architecture conforms.
     #[inline]
     #[must_use]
     pub fn conforms(&self) -> bool {
         self.unmet.is_empty()
     }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1780008) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::a_missing_protocol_is_reported stdout ----

thread 'conformance::tests::a_missing_protocol_is_reported' (1780020) panicked at crates/casm-core/src/conformance.rs:690:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingProtocol { protocol, .. }] if protocol
    == "grpc")

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (1780011) panicked at crates/casm-core/src/conformance.rs:671:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingControlType { control_type, .. }] if
    control_type == "compliance")

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::too_few_security_controls_is_reported_with_both_counts

test result: FAILED. 194 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
