*** crates/casm-core/src/conformance.rs:323:29: replace != with == in resolve_role

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace != with == in resolve_role
@@ -315,17 +315,17 @@
         // The architecture's own invariant guarantees a bound id resolves.
         let Some(node) = architecture.node(id) else {
             return Err(Unmet::NoCandidate {
                 role: role.as_str().to_owned(),
                 node_type: requirement.node_type().to_string(),
             });
         };
 
-        if node.node_type() != requirement.node_type() {
+        if node.node_type() == /* ~ changed by cargo-mutants ~ */ requirement.node_type() {
             return Err(Unmet::WrongType {
                 role: role.as_str().to_owned(),
                 node: node.name().as_str().to_owned(),
                 expected: requirement.node_type().to_string(),
                 found: node.node_type().to_string(),
             });
         }
         return Ok(node);

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1782706) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1782714) panicked at crates/casm-core/src/conformance.rs:583:9:
[WrongType { role: "application", node: "orders", expected: "service", found: "service" }]

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::an_explicit_binding_resolves_the_ambiguity

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
