*** crates/casm-core/src/conformance.rs:336:41: replace == with != in resolve_role

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace == with != in resolve_role
@@ -328,17 +328,17 @@
                 found: node.node_type().to_string(),
             });
         }
         return Ok(node);
     }
 
     let candidates: Vec<&Node> = architecture
         .nodes()
-        .filter(|node| node.node_type() == requirement.node_type())
+        .filter(|node| node.node_type() != /* ~ changed by cargo-mutants ~ */ requirement.node_type())
         .collect();
 
     match candidates.as_slice() {
         [] => Err(Unmet::NoCandidate {
             role: role.as_str().to_owned(),
             node_type: requirement.node_type().to_string(),
         }),
         [only] => Ok(only),

---- conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate stdout ----

thread 'conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate' (1783878) panicked at crates/casm-core/src/conformance.rs:595:9:
assertion failed: matches!(report.unmet(), [Unmet::NoCandidate { role, .. }] if role == "store")

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1783883) panicked at crates/casm-core/src/conformance.rs:719:17:
assertion `left == right` failed
  left: "orders"
 right: "edge"

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1783876) panicked at crates/casm-core/src/conformance.rs:519:9:
[TooFewControls { role: "edge", node: "orders", required: 2, declared: 0 }, MissingProtocol { role: "edge", node: "orders", protocol: "http2" }, MissingRelationship { source_role: "edge", source: "orders", target_role: "application", target: "edge", relationship_type: "sync" }]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_node_type_is_reported_as_having_no_candidate
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::relationship_direction_matters
    conformance::tests::roles_bind_automatically_when_exactly_one_node_fits
    conformance::tests::too_few_security_controls_is_reported_with_both_counts

test result: FAILED. 196 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
