*** crates/casm-core/src/conformance.rs:386:12: delete ! in check_node

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ delete ! in check_node
@@ -378,17 +378,17 @@
         }
     }
 
     for protocol in requirement.required_protocols() {
         let speaks = node
             .interfaces()
             .iter()
             .any(|interface| interface.protocol() == protocol);
-        if !speaks {
+        if  /* ~ changed by cargo-mutants ~ */speaks {
             unmet.push(Unmet::MissingProtocol {
                 role: role.clone(),
                 node: name.clone(),
                 protocol: protocol.label().to_owned(),
             });
         }
     }
 }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1787556) panicked at crates/casm-core/src/conformance.rs:519:9:
[MissingProtocol { role: "edge", node: "edge", protocol: "http2" }]

---- conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at stdout ----

thread 'conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at' (1787561) panicked at crates/casm-core/src/conformance.rs:561:22:
expected one Ambiguous, got [MissingProtocol { role: "edge", node: "edge", protocol: "http2" }, Ambiguous { role: "application", node_type: "service", candidates: ["orders", "payments"] }]

---- conformance::tests::a_missing_protocol_is_reported stdout ----

thread 'conformance::tests::a_missing_protocol_is_reported' (1787559) panicked at crates/casm-core/src/conformance.rs:690:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingProtocol { protocol, .. }] if protocol
    == "grpc")

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role

test result: FAILED. 200 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
