*** crates/casm-core/src/conformance.rs:410:38: replace == with != in check_relationships

*** mutation diff:
--- crates/casm-core/src/conformance.rs
+++ replace == with != in check_relationships
@@ -402,17 +402,17 @@
     architecture: &Architecture,
     pattern: &Pattern,
     bindings: &[(String, NodeId)],
     unmet: &mut Vec<Unmet>,
 ) {
     let filled = |role: &Name| {
         bindings
             .iter()
-            .find(|(bound, _)| bound == role.as_str())
+            .find(|(bound, _)| bound != /* ~ changed by cargo-mutants ~ */ role.as_str())
             .map(|(_, id)| *id)
     };
 
     for required in pattern.relationships() {
         let (Some(source), Some(target)) = (filled(required.source()), filled(required.target()))
         else {
             continue;
         };

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1789686) panicked at crates/casm-core/src/conformance.rs:519:9:
[MissingRelationship { source_role: "edge", source: "orders", target_role: "application", target: "edge", relationship_type: "sync" }]

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1789690) panicked at crates/casm-core/src/conformance.rs:719:17:
assertion `left == right` failed
  left: "orders"
 right: "edge"

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1789693) panicked at crates/casm-core/src/conformance.rs:583:9:
[MissingRelationship { source_role: "edge", source: "orders", target_role: "application", target: "edge", relationship_type: "sync" }]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::relationship_direction_matters

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
