*** crates/casm-core/src/control.rs:137:12: delete ! in Control::with_tag

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ delete ! in Control::with_tag
@@ -129,17 +129,17 @@
         self.evidence_required = true;
         self
     }
 
     /// Attaches a free-form tag used by policy rules for selection.
     #[must_use]
     pub fn with_tag(mut self, tag: impl Into<String>) -> Self {
         let tag = tag.into();
-        if !self.tags.contains(&tag) {
+        if  /* ~ changed by cargo-mutants ~ */self.tags.contains(&tag) {
             self.tags.push(tag);
         }
         self
     }
 
     /// The risk dimension this control addresses.
     #[inline]
     #[must_use]

---- control::tests::has_tag_matches_exactly stdout ----

thread 'control::tests::has_tag_matches_exactly' (1799039) panicked at crates/casm-core/src/control.rs:290:9:
assertion failed: control.has_tag("pci-dss")

---- control::tests::tags_are_deduplicated stdout ----

thread 'control::tests::tags_are_deduplicated' (1799045) panicked at crates/casm-core/src/control.rs:284:9:
assertion `left == right` failed
  left: []
 right: ["security", "pci"]

---- node::tests::has_control_tagged_searches_every_control stdout ----

thread 'node::tests::has_control_tagged_searches_every_control' (1799217) panicked at crates/casm-core/src/node.rs:512:9:
assertion failed: node.has_control_tagged("pci-dss")

failures:
    control::tests::has_tag_matches_exactly
    control::tests::tags_are_deduplicated
    node::tests::has_control_tagged_searches_every_control

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
