*** crates/casm-core/src/control.rs:154:9: replace Control::standard -> &str with ""

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace Control::standard -> &str with ""
@@ -146,17 +146,17 @@
     pub const fn control_type(&self) -> ControlType {
         self.control_type
     }
 
     /// The external standard identifier, e.g. `"ISO27001-A.12.4"`.
     #[inline]
     #[must_use]
     pub fn standard(&self) -> &str {
-        &self.standard
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// What this control actually asserts.
     #[inline]
     #[must_use]
     pub fn description(&self) -> &str {
         &self.description
     }

---- control::tests::a_control_returns_the_standard_and_description_it_was_built_with stdout ----

thread 'control::tests::a_control_returns_the_standard_and_description_it_was_built_with' (1799612) panicked at crates/casm-core/src/control.rs:228:9:
assertion `left == right` failed
  left: ""
 right: "ISO27001-A.10.1"

---- relationship::tests::a_relationship_reports_what_it_was_built_with stdout ----

thread 'relationship::tests::a_relationship_reports_what_it_was_built_with' (1799801) panicked at crates/casm-core/src/relationship.rs:533:9:
assertion `left == right` failed
  left: ""
 right: "mTLS"

failures:
    control::tests::a_control_returns_the_standard_and_description_it_was_built_with
    relationship::tests::a_relationship_reports_what_it_was_built_with

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
