*** crates/casm-core/src/control.rs:161:9: replace Control::description -> &str with "xyzzy"

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace Control::description -> &str with "xyzzy"
@@ -153,17 +153,17 @@
     pub fn standard(&self) -> &str {
         &self.standard
     }
 
     /// What this control actually asserts.
     #[inline]
     #[must_use]
     pub fn description(&self) -> &str {
-        &self.description
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether an auditor must be shown evidence for this control.
     #[inline]
     #[must_use]
     pub const fn evidence_required(&self) -> bool {
         self.evidence_required
     }

---- control::tests::a_control_returns_the_standard_and_description_it_was_built_with stdout ----

thread 'control::tests::a_control_returns_the_standard_and_description_it_was_built_with' (1801582) panicked at crates/casm-core/src/control.rs:229:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "Encrypted at rest with a customer-managed key"

failures:
    control::tests::a_control_returns_the_standard_and_description_it_was_built_with

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
