*** crates/casm-core/src/control.rs:175:9: replace Control::tags -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace Control::tags -> &[String] with Vec::leak(Vec::new())
@@ -167,17 +167,17 @@
     pub const fn evidence_required(&self) -> bool {
         self.evidence_required
     }
 
     /// The tags attached to this control.
     #[inline]
     #[must_use]
     pub fn tags(&self) -> &[String] {
-        &self.tags
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this control carries `tag`.
     #[must_use]
     pub fn has_tag(&self, tag: &str) -> bool {
         self.tags.iter().any(|candidate| candidate == tag)
     }
 }

---- control::tests::tags_are_deduplicated stdout ----

thread 'control::tests::tags_are_deduplicated' (1802516) panicked at crates/casm-core/src/control.rs:284:9:
assertion `left == right` failed
  left: []
 right: ["security", "pci"]

failures:
    control::tests::tags_are_deduplicated

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
