*** crates/casm-core/src/control.rs:181:9: replace Control::has_tag -> bool with false

*** mutation diff:
--- crates/casm-core/src/control.rs
+++ replace Control::has_tag -> bool with false
@@ -173,17 +173,17 @@
     #[must_use]
     pub fn tags(&self) -> &[String] {
         &self.tags
     }
 
     /// Returns `true` if this control carries `tag`.
     #[must_use]
     pub fn has_tag(&self, tag: &str) -> bool {
-        self.tags.iter().any(|candidate| candidate == tag)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- control::tests::has_tag_matches_exactly stdout ----

thread 'control::tests::has_tag_matches_exactly' (1805112) panicked at crates/casm-core/src/control.rs:290:9:
assertion failed: control.has_tag("pci-dss")

---- node::tests::has_control_tagged_searches_every_control stdout ----

thread 'node::tests::has_control_tagged_searches_every_control' (1805214) panicked at crates/casm-core/src/node.rs:512:9:
assertion failed: node.has_control_tagged("pci-dss")

failures:
    control::tests::has_tag_matches_exactly
    node::tests::has_control_tagged_searches_every_control

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
