*** crates/casm-core/src/hex.rs:14:5: replace encode -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-core/src/hex.rs
+++ replace encode -> String with "xyzzy".into()
@@ -6,23 +6,17 @@
 //!
 //! CASIMIR has two content digests — [`crate::SchemaHash`] for interface contracts and
 //! [`crate::Fingerprint`] for whole architectures — and both are SHA3-256 rendered as 64
 //! lowercase hexadecimal characters. Two copies of that conversion would be two places to
 //! get an off-by-one wrong, so it lives here.
 
 /// Renders `bytes` as lowercase hexadecimal.
 pub(crate) fn encode(bytes: &[u8]) -> String {
-    let mut out = String::with_capacity(bytes.len().saturating_mul(2));
-    for byte in bytes {
-        // Two hex digits per byte. `from_digit` cannot fail for a value below 16.
-        out.push(char::from_digit(u32::from(byte >> 4), 16).unwrap_or('0'));
-        out.push(char::from_digit(u32::from(byte & 0x0f), 16).unwrap_or('0'));
-    }
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parses exactly `N` bytes from a hexadecimal string.
 ///
 /// An optional `algorithm:` prefix is accepted and ignored, so `sha3-256:abcd…` and
 /// `abcd…` both parse.
 ///
 /// # Errors

---- hex::tests::decoding_round_trips_with_encoding stdout ----

thread 'hex::tests::decoding_round_trips_with_encoding' (1807513) panicked at crates/casm-core/src/hex.rs:75:59:
called `Result::unwrap()` on an `Err` value: "expected 16 hexadecimal digits, found 5"

---- hex::tests::encoding_is_lowercase stdout ----

thread 'hex::tests::encoding_is_lowercase' (1807515) panicked at crates/casm-core/src/hex.rs:68:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "abcdef"

---- hex::tests::encoding_pads_every_byte_to_two_digits stdout ----

thread 'hex::tests::encoding_pads_every_byte_to_two_digits' (1807517) panicked at crates/casm-core/src/hex.rs:61:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "000fff"

failures:
    hex::tests::decoding_round_trips_with_encoding
    hex::tests::encoding_is_lowercase
    hex::tests::encoding_pads_every_byte_to_two_digits
    interface::tests::interface_round_trips_through_json
    interface::tests::protocols_and_hashes_render_the_text_they_are_read_back_from
    interface::tests::schema_hash_accepts_an_algorithm_prefix
    interface::tests::schema_hash_matches_the_published_sha3_256_vector
    interface::tests::schema_hash_round_trips_through_hex
    merkle::tests::a_boolean_field_is_part_of_the_digest
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint
    merkle::tests::a_renamed_node_changes_the_fingerprint

test result: FAILED. 185 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
