*** crates/casm-core/src/hex.rs:17:50: replace >> with << in encode

*** mutation diff:
--- crates/casm-core/src/hex.rs
+++ replace >> with << in encode
@@ -9,17 +9,17 @@
 //! lowercase hexadecimal characters. Two copies of that conversion would be two places to
 //! get an off-by-one wrong, so it lives here.
 
 /// Renders `bytes` as lowercase hexadecimal.
 pub(crate) fn encode(bytes: &[u8]) -> String {
     let mut out = String::with_capacity(bytes.len().saturating_mul(2));
     for byte in bytes {
         // Two hex digits per byte. `from_digit` cannot fail for a value below 16.
-        out.push(char::from_digit(u32::from(byte >> 4), 16).unwrap_or('0'));
+        out.push(char::from_digit(u32::from(byte << /* ~ changed by cargo-mutants ~ */ 4), 16).unwrap_or('0'));
         out.push(char::from_digit(u32::from(byte & 0x0f), 16).unwrap_or('0'));
     }
     out
 }
 
 /// Parses exactly `N` bytes from a hexadecimal string.
 ///
 /// An optional `algorithm:` prefix is accepted and ignored, so `sha3-256:abcd…` and

---- hex::tests::decoding_round_trips_with_encoding stdout ----

thread 'hex::tests::decoding_round_trips_with_encoding' (1807542) panicked at crates/casm-core/src/hex.rs:82:9:
assertion `left == right` failed
  left: [0, 1, 15, 0, 15, 0, 0, 0]
 right: [0, 1, 127, 128, 255, 16, 32, 64]

---- hex::tests::encoding_pads_every_byte_to_two_digits stdout ----

thread 'hex::tests::encoding_pads_every_byte_to_two_digits' (1807545) panicked at crates/casm-core/src/hex.rs:67:9:
assertion `left == right` failed
  left: "000f0f"
 right: "000fff"

---- hex::tests::encoding_is_lowercase stdout ----

thread 'hex::tests::encoding_is_lowercase' (1807544) panicked at crates/casm-core/src/hex.rs:74:9:
assertion `left == right` failed
  left: "0b0d0f"
 right: "abcdef"

failures:
    hex::tests::decoding_round_trips_with_encoding
    hex::tests::encoding_is_lowercase
    hex::tests::encoding_pads_every_byte_to_two_digits
    interface::tests::interface_round_trips_through_json
    interface::tests::schema_hash_accepts_an_algorithm_prefix
    interface::tests::schema_hash_matches_the_published_sha3_256_vector
    interface::tests::schema_hash_round_trips_through_hex
    merkle::tests::fingerprints_render_and_parse_as_hex
    merkle::tests::fingerprints_round_trip_through_json

test result: FAILED. 196 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
