*** crates/casm-core/src/hex.rs:32:5: replace decode -> Result<[u8; N], String> with Ok([1; N])

*** mutation diff:
--- crates/casm-core/src/hex.rs
+++ replace decode -> Result<[u8; N], String> with Ok([1; N])
@@ -24,37 +24,17 @@
 ///
 /// An optional `algorithm:` prefix is accepted and ignored, so `sha3-256:abcd…` and
 /// `abcd…` both parse.
 ///
 /// # Errors
 ///
 /// Returns a human-readable message naming the offending length or byte.
 pub(crate) fn decode<const N: usize>(raw: &str) -> Result<[u8; N], String> {
-    let raw = raw.rsplit_once(':').map_or(raw, |(_, digits)| digits);
-    let expected = N.saturating_mul(2);
-
-    if raw.len() != expected {
-        return Err(format!(
-            "expected {expected} hexadecimal digits, found {}",
-            raw.len()
-        ));
-    }
-
-    let mut bytes = [0_u8; N];
-    for (index, slot) in bytes.iter_mut().enumerate() {
-        let start = index.saturating_mul(2);
-        let pair = raw
-            .get(start..start.saturating_add(2))
-            .ok_or_else(|| "value is not valid ASCII hexadecimal".to_owned())?;
-        *slot = u8::from_str_radix(pair, 16)
-            .map_err(|_| format!("'{pair}' at offset {start} is not a hexadecimal byte"))?;
-    }
-
-    Ok(bytes)
+    Ok([1; N]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- hex::tests::decoding_accepts_uppercase_digits stdout ----

thread 'hex::tests::decoding_accepts_uppercase_digits' (1810120) panicked at crates/casm-core/src/hex.rs:74:9:
assertion `left == right` failed
  left: [1, 1]
 right: [171, 205]

---- hex::tests::decoding_accepts_an_algorithm_prefix stdout ----

thread 'hex::tests::decoding_accepts_an_algorithm_prefix' (1810119) panicked at crates/casm-core/src/hex.rs:68:9:
assertion `left == right` failed
  left: [1, 1]
 right: [0, 255]

---- hex::tests::decoding_rejects_the_wrong_length_and_says_what_it_wanted stdout ----

thread 'hex::tests::decoding_rejects_the_wrong_length_and_says_what_it_wanted' (1810125) panicked at crates/casm-core/src/hex.rs:79:41:
called `Result::unwrap_err()` on an `Ok` value: [1, 1, 1, 1]

failures:
    hex::tests::decoding_accepts_an_algorithm_prefix
    hex::tests::decoding_accepts_uppercase_digits
    hex::tests::decoding_rejects_non_hexadecimal_input
    hex::tests::decoding_rejects_the_wrong_length_and_says_what_it_wanted
    hex::tests::decoding_round_trips_with_encoding
    interface::tests::interface_round_trips_through_json
    interface::tests::schema_hash_accepts_an_algorithm_prefix
    interface::tests::schema_hash_rejects_wrong_length_and_non_hex
    interface::tests::schema_hash_round_trips_through_hex
    merkle::tests::fingerprint_parsing_rejects_malformed_input
    merkle::tests::fingerprints_render_and_parse_as_hex
    merkle::tests::fingerprints_round_trip_through_json

test result: FAILED. 193 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
