*** crates/casm-core/src/ids.rs:141:9: replace <impl TryFrom<String> for NodeId>::try_from -> Result<Self, Self::Error> with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace <impl TryFrom<String> for NodeId>::try_from -> Result<Self, Self::Error> with Ok(Default::default())
@@ -133,17 +133,17 @@
         Self::parse(value)
     }
 }
 
 impl TryFrom<String> for NodeId {
     type Error = IdError;
 
     fn try_from(value: String) -> Result<Self, Self::Error> {
-        Self::parse(&value)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'de> Deserialize<'de> for NodeId {
     /// Deserialisation enforces the version-7 requirement, exactly as [`NodeId::parse`] does.
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: Deserializer<'de>,

---- ids::tests::the_delegating_conversions_validate_as_parse_does stdout ----

thread 'ids::tests::the_delegating_conversions_validate_as_parse_does' (1817300) panicked at crates/casm-core/src/ids.rs:260:9:
assertion `left == right` failed
  left: "019fd255-5212-7be2-b25a-aab362c21533"
 right: "019fd255-5212-7be2-b25a-aa77204a9ede"

failures:
    ids::tests::the_delegating_conversions_validate_as_parse_does

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
