*** crates/casm-core/src/ids.rs:77:20: replace != with == in NodeId::parse

*** mutation diff:
--- crates/casm-core/src/ids.rs
+++ replace != with == in NodeId::parse
@@ -69,17 +69,17 @@
     /// - [`IdError::Malformed`] if `raw` is not a well-formed UUID.
     /// - [`IdError::WrongVersion`] if `raw` is a valid UUID of a version other than 7.
     pub fn parse(raw: &str) -> Result<Self, IdError> {
         let uuid = Uuid::parse_str(raw).map_err(|_| IdError::Malformed {
             value: raw.to_owned(),
         })?;
 
         let version = uuid.get_version_num();
-        if version != REQUIRED_UUID_VERSION {
+        if version == /* ~ changed by cargo-mutants ~ */ REQUIRED_UUID_VERSION {
             // A UUID version is a single nibble, so this conversion cannot truncate.
             let found = u8::try_from(version).unwrap_or(u8::MAX);
             return Err(IdError::WrongVersion {
                 value: raw.to_owned(),
                 found,
             });
         }

---- architecture::tests::architecture_round_trips_through_json stdout ----

thread 'architecture::tests::architecture_round_trips_through_json' (1812506) panicked at crates/casm-core/src/architecture.rs:934:62:
called `Result::unwrap()` on an `Err` value: Error("identifier '019fd255-42e0-7d41-bce1-22f1e6a70d09' is UUID version 7, but CASIMIR requires version 7", line: 1, column: 84)

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (1812524) panicked at crates/casm-core/src/architecture.rs:1122:67:
called `Result::unwrap()` on an `Err` value: Error("identifier '019fd255-42e1-7913-bc32-e266235c5b3e' is UUID version 7, but CASIMIR requires version 7", line: 0, column: 0)

---- architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde' (1812525) panicked at crates/casm-core/src/architecture.rs:875:67:
called `Result::unwrap()` on an `Err` value: Error("identifier '019fd255-42e1-7913-bc32-e2492834308d' is UUID version 7, but CASIMIR requires version 7", line: 0, column: 0)

failures:
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    architecture::tests::verify_invariants_catches_a_dangling_edge_smuggled_in_via_serde
    ids::tests::deserialisation_rejects_wrong_version
    ids::tests::generated_ids_round_trip_through_strings
    ids::tests::parse_rejects_the_nil_uuid
    ids::tests::parse_rejects_version_four_uuids
    ids::tests::serde_round_trips_through_json
    ids::tests::the_delegating_conversions_validate_as_parse_does
    ids::tests::the_embedded_timestamp_is_milliseconds_not_some_other_unit
    node::tests::node_round_trips_through_json
    relationship::tests::relationship_round_trips_through_json

test result: FAILED. 193 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
