*** crates/casm-core/src/interface.rs:190:9: replace <impl fmt::Debug for SchemaHash>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace <impl fmt::Debug for SchemaHash>::fmt -> fmt::Result with Ok(Default::default())
@@ -182,19 +182,17 @@
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.to_hex())
     }
 }
 
 impl fmt::Debug for SchemaHash {
     /// Abbreviated for log readability; full digest available via [`SchemaHash::to_hex`].
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        let hex = self.to_hex();
-        let prefix = hex.get(..12).unwrap_or(&hex);
-        write!(f, "SchemaHash({prefix}…)")
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TryFrom<String> for SchemaHash {
     type Error = String;
 
     fn try_from(value: String) -> Result<Self, Self::Error> {
         Self::parse_hex(&value)

---- interface::tests::schema_hash_debug_is_abbreviated_not_full stdout ----

thread 'interface::tests::schema_hash_debug_is_abbreviated_not_full' (1825936) panicked at crates/casm-core/src/interface.rs:396:9:
assertion failed: !debug.is_empty()

failures:
    interface::tests::schema_hash_debug_is_abbreviated_not_full

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
