*** crates/casm-core/src/interface.rs:330:23: replace == with != in Interface::is_compatible_with

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace == with != in Interface::is_compatible_with
@@ -322,17 +322,17 @@
 
     /// Returns `true` if a consumer pinned to `self` can safely talk to `other`.
     ///
     /// Compatibility is SemVer-major equality plus a minor-version floor, on the same
     /// protocol. This is the check that turns "we upgraded the API" from a production
     /// incident into a failed validation run.
     #[must_use]
     pub fn is_compatible_with(&self, other: &Self) -> bool {
-        self.protocol == other.protocol
+        self.protocol != /* ~ changed by cargo-mutants ~ */ other.protocol
             && self.version.major == other.version.major
             && other.version.minor >= self.version.minor
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,

---- interface::tests::compatibility_allows_a_forward_minor_version stdout ----

thread 'interface::tests::compatibility_allows_a_forward_minor_version' (1833379) panicked at crates/casm-core/src/interface.rs:478:9:
assertion failed: consumer.is_compatible_with(&provider)

---- interface::tests::compatibility_requires_matching_protocol stdout ----

thread 'interface::tests::compatibility_requires_matching_protocol' (1833382) panicked at crates/casm-core/src/interface.rs:495:9:
assertion failed: !consumer.is_compatible_with(&provider)

failures:
    interface::tests::compatibility_allows_a_forward_minor_version
    interface::tests::compatibility_requires_matching_protocol

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
