*** crates/casm-core/src/interface.rs:330:9: replace Interface::is_compatible_with -> bool with false

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace Interface::is_compatible_with -> bool with false
@@ -322,19 +322,17 @@
 
     /// Returns `true` if a consumer pinned to `self` can safely talk to `other`.
     ///
     /// Compatibility is SemVer-major equality plus a minor-version floor, on the same
     /// protocol. This is the check that turns "we upgraded the API" from a production
     /// incident into a failed validation run.
     #[must_use]
     pub fn is_compatible_with(&self, other: &Self) -> bool {
-        self.protocol == other.protocol
-            && self.version.major == other.version.major
-            && other.version.minor >= self.version.minor
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- interface::tests::compatibility_allows_a_forward_minor_version stdout ----

thread 'interface::tests::compatibility_allows_a_forward_minor_version' (1831453) panicked at crates/casm-core/src/interface.rs:476:9:
assertion failed: consumer.is_compatible_with(&provider)

failures:
    interface::tests::compatibility_allows_a_forward_minor_version

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
