*** crates/casm-core/src/interface.rs:332:36: replace >= with < in Interface::is_compatible_with

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace >= with < in Interface::is_compatible_with
@@ -324,17 +324,17 @@
     ///
     /// Compatibility is SemVer-major equality plus a minor-version floor, on the same
     /// protocol. This is the check that turns "we upgraded the API" from a production
     /// incident into a failed validation run.
     #[must_use]
     pub fn is_compatible_with(&self, other: &Self) -> bool {
         self.protocol == other.protocol
             && self.version.major == other.version.major
-            && other.version.minor >= self.version.minor
+            && other.version.minor < /* ~ changed by cargo-mutants ~ */ self.version.minor
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- interface::tests::compatibility_allows_a_forward_minor_version stdout ----

thread 'interface::tests::compatibility_allows_a_forward_minor_version' (1833629) panicked at crates/casm-core/src/interface.rs:478:9:
assertion failed: consumer.is_compatible_with(&provider)

---- interface::tests::compatibility_rejects_a_backward_minor_version stdout ----

thread 'interface::tests::compatibility_rejects_a_backward_minor_version' (1833630) panicked at crates/casm-core/src/interface.rs:485:9:
provider is missing newer features

failures:
    interface::tests::compatibility_allows_a_forward_minor_version
    interface::tests::compatibility_rejects_a_backward_minor_version

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
