*** crates/casm-core/src/interface.rs:98:9: replace Protocol::is_synchronous -> bool with false

*** mutation diff:
--- crates/casm-core/src/interface.rs
+++ replace Protocol::is_synchronous -> bool with false
@@ -90,29 +90,17 @@
     ///
     /// Used by the validator to flag synchronous coupling across trust boundaries.
     #[must_use]
     // The `Custom` arm shares a body with the synchronous group, but merging them would
     // hide that "unknown protocols default to synchronous" is a deliberate, conservative
     // choice rather than an accident of grouping.
     #[allow(clippy::match_same_arms)]
     pub const fn is_synchronous(&self) -> bool {
-        match self {
-            Self::Http11
-            | Self::Http2
-            | Self::Http3
-            | Self::Grpc
-            | Self::GraphQl
-            | Self::Sql
-            | Self::Tcp => true,
-            Self::Kafka | Self::Amqp | Self::Mqtt | Self::WebSocket => false,
-            // An unmodelled protocol is assumed synchronous: the conservative choice,
-            // because it makes the validator warn rather than stay silent.
-            Self::Custom(_) => true,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Validates a [`Protocol::Custom`] label.
     ///
     /// # Errors
     ///
     /// Returns [`InterfaceError::EmptyCustomProtocol`] if a custom label is blank.
     pub fn validate(&self) -> Result<(), InterfaceError> {

---- interface::tests::protocols_are_classified_by_synchrony stdout ----

thread 'interface::tests::protocols_are_classified_by_synchrony' (1822495) panicked at crates/casm-core/src/interface.rs:488:9:
assertion failed: Protocol::Grpc.is_synchronous()

failures:
    interface::tests::protocols_are_classified_by_synchrony

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
