*** crates/casm-core/src/merkle.rs:121:9: replace Fingerprint::abbreviated -> String with String::new()

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace Fingerprint::abbreviated -> String with String::new()
@@ -113,18 +113,17 @@
     }
 
     /// Renders the leading `width` characters, for terminal output.
     ///
     /// Twelve is the conventional abbreviation and is ample: a collision within one
     /// repository's history is not a practical concern at 48 bits.
     #[must_use]
     pub fn abbreviated(&self, width: usize) -> String {
-        let hex = self.to_hex();
-        hex.get(..width.min(hex.len())).unwrap_or(&hex).to_owned()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Borrows the raw digest bytes.
     #[inline]
     #[must_use]
     pub const fn as_bytes(&self) -> &[u8; DIGEST_LEN] {
         &self.0
     }

---- merkle::tests::abbreviation_does_not_panic_on_an_over_long_width stdout ----

thread 'merkle::tests::abbreviation_does_not_panic_on_an_over_long_width' (1836263) panicked at crates/casm-core/src/merkle.rs:1137:9:
assertion `left == right` failed
  left: 0
 right: 64

---- merkle::tests::debug_output_stays_short_enough_for_a_log_line stdout ----

thread 'merkle::tests::debug_output_stays_short_enough_for_a_log_line' (1836271) panicked at crates/casm-core/src/merkle.rs:1162:9:
debug output must abbreviate the real value: Fingerprint(…) does not contain 1283e4cb

---- merkle::tests::fingerprints_render_and_parse_as_hex stdout ----

thread 'merkle::tests::fingerprints_render_and_parse_as_hex' (1836278) panicked at crates/casm-core/src/merkle.rs:1125:9:
assertion `left == right` failed
  left: 0
 right: 12

failures:
    merkle::tests::abbreviation_does_not_panic_on_an_over_long_width
    merkle::tests::debug_output_stays_short_enough_for_a_log_line
    merkle::tests::fingerprints_render_and_parse_as_hex

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
