*** crates/casm-core/src/merkle.rs:413:5: replace sorted_digests -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/casm-core/src/merkle.rs
+++ replace sorted_digests -> Vec<String> with vec![String::new()]
@@ -405,19 +405,17 @@
         })
         .collect();
 
     encoder.map(&bindings).finish("conformance")
 }
 
 /// Renders digests as hex and sorts them, making the combination order-independent.
 fn sorted_digests(digests: impl Iterator<Item = Fingerprint>) -> Vec<String> {
-    let mut rendered: Vec<String> = digests.map(|digest| digest.to_hex()).collect();
-    rendered.sort_unstable();
-    rendered
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// The Merkle tree of an architecture: a root digest plus every subtree beneath it.
 ///
 /// The per-node digests are what make `casm blame` possible — attributing a change to a
 /// single node means finding the commit where that node's subtree digest last differed.
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct MerkleTree {

---- merkle::tests::a_boolean_field_is_part_of_the_digest stdout ----

thread 'merkle::tests::a_boolean_field_is_part_of_the_digest' (1843582) panicked at crates/casm-core/src/merkle.rs:921:9:
assertion `left != right` failed: evidence-required must change the fingerprint
  left: Fingerprint(5dfdda8a97c1…)
 right: Fingerprint(5dfdda8a97c1…)

---- merkle::tests::a_renamed_node_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_renamed_node_changes_the_fingerprint' (1843587) panicked at crates/casm-core/src/merkle.rs:692:9:
assertion `left != right` failed
  left: Fingerprint(5dfdda8a97c1…)
 right: Fingerprint(5dfdda8a97c1…)

---- merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint stdout ----

thread 'merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint' (1843586) panicked at crates/casm-core/src/merkle.rs:813:9:
assertion `left != right` failed: the target is part of a relationship's identity
  left: Fingerprint(5dfdda8a97c1…)
 right: Fingerprint(5dfdda8a97c1…)

failures:
    merkle::tests::a_boolean_field_is_part_of_the_digest
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_relationships_endpoints_and_type_are_part_of_the_fingerprint
    merkle::tests::a_renamed_node_changes_the_fingerprint
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::every_relationship_gets_its_own_entry_keyed_by_what_it_connects
    merkle::tests::rebinding_a_role_changes_the_fingerprint
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_distinguishes_relationship_direction

test result: FAILED. 196 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
