*** crates/casm-core/src/names.rs:92:35: replace || with && in Name::is_legal

*** mutation diff:
--- crates/casm-core/src/names.rs
+++ replace || with && in Name::is_legal
@@ -84,17 +84,17 @@
             });
         }
 
         Ok(Self(raw))
     }
 
     /// Returns `true` if `c` is permitted anywhere within a name.
     const fn is_legal(c: char) -> bool {
-        c.is_ascii_alphanumeric() || matches!(c, '-' | '_' | '.')
+        c.is_ascii_alphanumeric() && /* ~ changed by cargo-mutants ~ */ matches!(c, '-' | '_' | '.')
     }
 
     /// Borrows the underlying string.
     #[inline]
     pub fn as_str(&self) -> &str {
         &self.0
     }

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1851191) panicked at crates/casm-core/src/architecture.rs:598:14:
valid node: Name(IllegalCharacter { name: "api", found: 'a', index: 0 })

---- architecture::tests::a_binding_to_an_absent_node_is_rejected stdout ----

thread 'architecture::tests::a_binding_to_an_absent_node_is_rejected' (1851189) panicked at crates/casm-core/src/architecture.rs:598:14:
valid node: Name(IllegalCharacter { name: "api", found: 'a', index: 0 })

---- architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim stdout ----

thread 'architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim' (1851190) panicked at crates/casm-core/src/architecture.rs:598:14:
valid node: Name(IllegalCharacter { name: "cache", found: 'c', index: 0 })

failures:
    architecture::tests::a_binding_to_an_absent_node_is_rejected
    architecture::tests::a_bound_node_cannot_be_removed_without_revisiting_the_claim
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    architecture::tests::a_dangling_source_is_rejected_and_named_as_such
    architecture::tests::a_dangling_target_is_rejected_and_named_as_such
    architecture::tests::an_architecture_reports_what_it_was_built_with
    architecture::tests::an_identical_relationship_is_rejected
    architecture::tests::architecture_round_trips_through_json
    architecture::tests::build_applies_sensible_defaults
    architecture::tests::build_rejects_a_non_semver_version
    architecture::tests::build_resolves_edges_declared_before_their_nodes
    architecture::tests::consuming_builders_compose

test result: FAILED. 77 passed; 128 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
