*** crates/casm-core/src/names.rs:92:9: replace Name::is_legal -> bool with true

*** mutation diff:
--- crates/casm-core/src/names.rs
+++ replace Name::is_legal -> bool with true
@@ -84,17 +84,17 @@
             });
         }
 
         Ok(Self(raw))
     }
 
     /// Returns `true` if `c` is permitted anywhere within a name.
     const fn is_legal(c: char) -> bool {
-        c.is_ascii_alphanumeric() || matches!(c, '-' | '_' | '.')
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Borrows the underlying string.
     #[inline]
     pub fn as_str(&self) -> &str {
         &self.0
     }

---- names::tests::deserialisation_enforces_the_same_rules_as_construction stdout ----

thread 'names::tests::deserialisation_enforces_the_same_rules_as_construction' (1851091) panicked at crates/casm-core/src/names.rs:248:9:
serde must not bypass validation

---- names::tests::rejects_diagram_and_shell_metacharacters stdout ----

thread 'names::tests::rejects_diagram_and_shell_metacharacters' (1851093) panicked at crates/casm-core/src/names.rs:235:13:
"a\"b" must be rejected

---- names::tests::reports_the_byte_offset_of_an_illegal_character stdout ----

thread 'names::tests::reports_the_byte_offset_of_an_illegal_character' (1851097) panicked at crates/casm-core/src/names.rs:221:44:
called `Result::unwrap_err()` on an `Ok` value: Name("api gateway")

failures:
    names::tests::deserialisation_enforces_the_same_rules_as_construction
    names::tests::rejects_diagram_and_shell_metacharacters
    names::tests::reports_the_byte_offset_of_an_illegal_character
    node::tests::build_rejects_an_invalid_name
    pattern::tests::malformed_references_are_rejected_with_a_reason
    pattern::tests::role_names_obey_the_casimir_alphabet

test result: FAILED. 199 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
