*** crates/casm-core/src/node.rs:105:9: replace <impl fmt::Display for NodeType>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace <impl fmt::Display for NodeType>::fmt -> fmt::Result with Ok(Default::default())
@@ -97,17 +97,17 @@
             | Self::Legacy
             | Self::Boundary => false,
         }
     }
 }
 
 impl fmt::Display for NodeType {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(self.label())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Phase 1 of node construction: mutable configuration that may still be invalid.
 ///
 /// See [`Node`] for the validated phase-2 counterpart.
 #[derive(Clone, Debug, Default)]
 pub struct NodeConfig {

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1860005) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
