*** crates/casm-core/src/node.rs:213:9: replace NodeConfig::reject_duplicate_interfaces -> Result<(), NodeError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace NodeConfig::reject_duplicate_interfaces -> Result<(), NodeError> with Ok(())
@@ -205,30 +205,17 @@
             interfaces: self.interfaces,
             controls: self.controls,
             metadata: self.metadata,
         })
     }
 
     /// Enforces the invariant that interface names are unique within a node.
     fn reject_duplicate_interfaces(node: &Name, interfaces: &[Interface]) -> Result<(), NodeError> {
-        for (index, candidate) in interfaces.iter().enumerate() {
-            let is_duplicate = interfaces
-                .iter()
-                .take(index)
-                .any(|earlier| earlier.name() == candidate.name());
-
-            if is_duplicate {
-                return Err(NodeError::DuplicateInterface {
-                    node: node.as_str().to_owned(),
-                    interface: candidate.name().as_str().to_owned(),
-                });
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Phase 2 of node construction: an immutable, fully-validated architecture participant.
 ///
 /// Every `Node` that exists satisfies its invariants. Mutation is performed by
 /// consuming `self` and returning a new value, so a `Node` can never be observed
 /// mid-update.

---- node::tests::build_rejects_duplicate_interface_names stdout ----

thread 'node::tests::build_rejects_duplicate_interface_names' (1864638) panicked at crates/casm-core/src/node.rs:439:22:

failures:
    node::tests::build_rejects_duplicate_interface_names

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
