*** crates/casm-core/src/node.rs:217:47: replace == with != in NodeConfig::reject_duplicate_interfaces

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace == with != in NodeConfig::reject_duplicate_interfaces
@@ -209,17 +209,17 @@
     }
 
     /// Enforces the invariant that interface names are unique within a node.
     fn reject_duplicate_interfaces(node: &Name, interfaces: &[Interface]) -> Result<(), NodeError> {
         for (index, candidate) in interfaces.iter().enumerate() {
             let is_duplicate = interfaces
                 .iter()
                 .take(index)
-                .any(|earlier| earlier.name() == candidate.name());
+                .any(|earlier| earlier.name() != /* ~ changed by cargo-mutants ~ */ candidate.name());
 
             if is_duplicate {
                 return Err(NodeError::DuplicateInterface {
                     node: node.as_str().to_owned(),
                     interface: candidate.name().as_str().to_owned(),
                 });
             }
         }

---- node::tests::build_accepts_distinct_interface_names stdout ----

thread 'node::tests::build_accepts_distinct_interface_names' (1864891) panicked at crates/casm-core/src/node.rs:464:14:
called `Result::unwrap()` on an `Err` value: DuplicateInterface { node: "api", interface: "grpc" }

---- node::tests::build_rejects_duplicate_interface_names stdout ----

thread 'node::tests::build_rejects_duplicate_interface_names' (1864899) panicked at crates/casm-core/src/node.rs:452:22:

failures:
    node::tests::build_accepts_distinct_interface_names
    node::tests::build_rejects_duplicate_interface_names

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
