*** crates/casm-core/src/node.rs:315:9: replace Node::controls -> &[Control] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace Node::controls -> &[Control] with Vec::leak(Vec::new())
@@ -307,17 +307,17 @@
     pub fn interfaces(&self) -> &[Interface] {
         &self.interfaces
     }
 
     /// The controls this node is asserted to satisfy.
     #[inline]
     #[must_use]
     pub fn controls(&self) -> &[Control] {
-        &self.controls
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The node's annotations, in deterministic key order.
     #[inline]
     #[must_use]
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }

---- merkle::tests::a_boolean_field_is_part_of_the_digest stdout ----

thread 'merkle::tests::a_boolean_field_is_part_of_the_digest' (1868127) panicked at crates/casm-core/src/merkle.rs:923:9:
assertion `left != right` failed: evidence-required must change the fingerprint
  left: Fingerprint(ee26c1c27593…)
 right: Fingerprint(ee26c1c27593…)

---- merkle::tests::adding_a_control_changes_the_fingerprint stdout ----

thread 'merkle::tests::adding_a_control_changes_the_fingerprint' (1868135) panicked at crates/casm-core/src/merkle.rs:888:9:
assertion `left != right` failed
  left: Fingerprint(016fc83d8d07…)
 right: Fingerprint(016fc83d8d07…)

---- merkle::tests::changed_nodes_reports_only_what_actually_differs stdout ----

thread 'merkle::tests::changed_nodes_reports_only_what_actually_differs' (1868140) panicked at crates/casm-core/src/merkle.rs:1060:9:
assertion `left == right` failed
  left: []
 right: ["db"]

failures:
    merkle::tests::a_boolean_field_is_part_of_the_digest
    merkle::tests::adding_a_control_changes_the_fingerprint
    merkle::tests::changed_nodes_reports_only_what_actually_differs

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
