*** crates/casm-core/src/node.rs:339:9: replace Node::controls_of_type -> usize with 0

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace Node::controls_of_type -> usize with 0
@@ -331,20 +331,17 @@
     }
 
     /// Counts the controls of a given type.
     ///
     /// This is the primitive behind rules such as "every service must declare at least
     /// two security controls".
     #[must_use]
     pub fn controls_of_type(&self, control_type: crate::control::ControlType) -> usize {
-        self.controls
-            .iter()
-            .filter(|c| c.control_type() == control_type)
-            .count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if any attached control carries `tag`.
     #[must_use]
     pub fn has_control_tagged(&self, tag: &str) -> bool {
         self.controls.iter().any(|control| control.has_tag(tag))
     }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1870665) panicked at crates/casm-core/src/conformance.rs:519:9:
[TooFewControls { role: "edge", node: "edge", required: 2, declared: 0 }]

---- conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at stdout ----

thread 'conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at' (1870670) panicked at crates/casm-core/src/conformance.rs:561:22:
expected one Ambiguous, got [TooFewControls { role: "edge", node: "edge", required: 2, declared: 0 }, Ambiguous { role: "application", node_type: "service", candidates: ["orders", "payments"] }]

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1870673) panicked at crates/casm-core/src/conformance.rs:583:9:
[TooFewControls { role: "edge", node: "edge", required: 2, declared: 0 }]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::too_few_security_controls_is_reported_with_both_counts
    node::tests::controls_of_type_counts_only_the_requested_dimension

test result: FAILED. 200 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
