*** crates/casm-core/src/node.rs:339:9: replace Node::controls_of_type -> usize with 1

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace Node::controls_of_type -> usize with 1
@@ -331,20 +331,17 @@
     }
 
     /// Counts the controls of a given type.
     ///
     /// This is the primitive behind rules such as "every service must declare at least
     /// two security controls".
     #[must_use]
     pub fn controls_of_type(&self, control_type: crate::control::ControlType) -> usize {
-        self.controls
-            .iter()
-            .filter(|c| c.control_type() == control_type)
-            .count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if any attached control carries `tag`.
     #[must_use]
     pub fn has_control_tagged(&self, tag: &str) -> bool {
         self.controls.iter().any(|control| control.has_tag(tag))
     }

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (1870922) panicked at crates/casm-core/src/conformance.rs:671:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingControlType { control_type, .. }] if
    control_type == "compliance")

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1870921) panicked at crates/casm-core/src/conformance.rs:519:9:
[TooFewControls { role: "edge", node: "edge", required: 2, declared: 1 }]

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1870930) panicked at crates/casm-core/src/conformance.rs:583:9:
[TooFewControls { role: "edge", node: "edge", required: 2, declared: 1 }]

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::too_few_security_controls_is_reported_with_both_counts
    node::tests::controls_of_type_counts_only_the_requested_dimension

test result: FAILED. 198 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.54s

*** result: Failure(101)
