*** crates/casm-core/src/node.rs:56:9: replace NodeType::label -> &'static str with ""

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace NodeType::label -> &'static str with ""
@@ -48,28 +48,17 @@
     /// A logical grouping of other nodes.
     Boundary,
 }
 
 impl NodeType {
     /// Returns the canonical lowercase label.
     #[must_use]
     pub const fn label(self) -> &'static str {
-        match self {
-            Self::Service => "service",
-            Self::Database => "database",
-            Self::Queue => "queue",
-            Self::Cache => "cache",
-            Self::Gateway => "gateway",
-            Self::Storage => "storage",
-            Self::ExternalSystem => "external-system",
-            Self::Legacy => "legacy",
-            Self::Human => "human",
-            Self::Boundary => "boundary",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this node type holds state that survives a restart.
     ///
     /// Stateful nodes drive validator rules about backup controls and data residency.
     #[must_use]
     pub const fn is_stateful(self) -> bool {
         match self {

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1857279) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
