*** crates/casm-core/src/node.rs:75:9: replace NodeType::is_stateful -> bool with true

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace NodeType::is_stateful -> bool with true
@@ -67,25 +67,17 @@
         }
     }
 
     /// Returns `true` if this node type holds state that survives a restart.
     ///
     /// Stateful nodes drive validator rules about backup controls and data residency.
     #[must_use]
     pub const fn is_stateful(self) -> bool {
-        match self {
-            Self::Database | Self::Queue | Self::Storage | Self::Cache => true,
-            Self::Service
-            | Self::Gateway
-            | Self::ExternalSystem
-            | Self::Legacy
-            | Self::Human
-            | Self::Boundary => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this node lies outside the architecture's control boundary.
     #[must_use]
     pub const fn is_external(self) -> bool {
         match self {
             Self::ExternalSystem | Self::Human => true,
             Self::Service

---- node::tests::node_types_are_classified_by_statefulness stdout ----

thread 'node::tests::node_types_are_classified_by_statefulness' (1858085) panicked at crates/casm-core/src/node.rs:513:9:
assertion failed: !NodeType::Service.is_stateful()

failures:
    node::tests::node_types_are_classified_by_statefulness

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
