*** crates/casm-core/src/node.rs:89:9: replace NodeType::is_external -> bool with false

*** mutation diff:
--- crates/casm-core/src/node.rs
+++ replace NodeType::is_external -> bool with false
@@ -81,27 +81,17 @@
             | Self::Human
             | Self::Boundary => false,
         }
     }
 
     /// Returns `true` if this node lies outside the architecture's control boundary.
     #[must_use]
     pub const fn is_external(self) -> bool {
-        match self {
-            Self::ExternalSystem | Self::Human => true,
-            Self::Service
-            | Self::Database
-            | Self::Queue
-            | Self::Cache
-            | Self::Gateway
-            | Self::Storage
-            | Self::Legacy
-            | Self::Boundary => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for NodeType {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.label())
     }
 }

---- node::tests::node_types_are_classified_by_control_boundary stdout ----

thread 'node::tests::node_types_are_classified_by_control_boundary' (1860362) panicked at crates/casm-core/src/node.rs:517:9:
assertion failed: NodeType::ExternalSystem.is_external()

failures:
    node::tests::node_types_are_classified_by_control_boundary

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
