*** crates/casm-core/src/pattern.rs:119:12: delete ! in Requirement::requiring_control_type

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ delete ! in Requirement::requiring_control_type
@@ -111,17 +111,17 @@
     pub const fn requiring_security_controls(mut self, count: usize) -> Self {
         self.min_security_controls = count;
         self
     }
 
     /// Requires at least one control of the given type.
     #[must_use]
     pub fn requiring_control_type(mut self, control_type: ControlType) -> Self {
-        if !self.required_control_types.contains(&control_type) {
+        if  /* ~ changed by cargo-mutants ~ */self.required_control_types.contains(&control_type) {
             self.required_control_types.push(control_type);
         }
         self
     }
 
     /// Requires an interface speaking the given protocol.
     #[must_use]
     pub fn requiring_protocol(mut self, protocol: Protocol) -> Self {

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (1875765) panicked at crates/casm-core/src/conformance.rs:671:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingControlType { control_type, .. }] if
    control_type == "compliance")

---- conformance::tests::every_unmet_variant_renders_a_message_naming_its_role stdout ----

thread 'conformance::tests::every_unmet_variant_renders_a_message_naming_its_role' (1875775) panicked at crates/casm-core/src/conformance.rs:811:9:
assertion `left == right` failed
  left: 2
 right: 3

---- pattern::tests::requirement_builders_deduplicate stdout ----

thread 'pattern::tests::requirement_builders_deduplicate' (1875918) panicked at crates/casm-core/src/pattern.rs:843:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    pattern::tests::requirement_builders_deduplicate

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
