*** crates/casm-core/src/pattern.rs:308:9: replace PatternConfig::relationship -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternConfig::relationship -> Self with Default::default()
@@ -300,18 +300,17 @@
     pub fn requirement(mut self, requirement: Requirement) -> Self {
         self.requirements.push(requirement);
         self
     }
 
     /// Adds a required relationship.
     #[must_use]
     pub fn relationship(mut self, relationship: RequiredRelationship) -> Self {
-        self.relationships.push(relationship);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Declares a standard this pattern helps satisfy, such as `SOC2-CC6.1`.
     #[must_use]
     pub fn satisfies(mut self, standard: impl Into<String>) -> Self {
         let standard = standard.into();
         if !self.satisfies.contains(&standard) {
             self.satisfies.push(standard);

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1886040) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1886041) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1886045) panicked at crates/casm-core/src/conformance.rs:707:14:
called `Result::unwrap()` on an `Err` value: MissingField { field: "name" }

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::checking_is_deterministic
    conformance::tests::relationship_direction_matters
    conformance::tests::roles_bind_automatically_when_exactly_one_node_fits
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_distinguishes_relationship_direction

test result: FAILED. 183 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
