*** crates/casm-core/src/pattern.rs:325:9: replace PatternConfig::metadata -> Self with Default::default()

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternConfig::metadata -> Self with Default::default()
@@ -317,18 +317,17 @@
             self.satisfies.push(standard);
         }
         self
     }
 
     /// Attaches an annotation.
     #[must_use]
     pub fn metadata(mut self, key: impl Into<String>, value: impl Into<String>) -> Self {
-        self.metadata.insert(key.into(), value.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Phase 2: validates every invariant and produces an immutable [`Pattern`].
     ///
     /// # Errors
     ///
     /// Returns the first violated invariant: a missing or invalid name, a non-SemVer
     /// version, a duplicated role, or a relationship naming a role the pattern does not

---- pattern::tests::a_pattern_and_its_parts_report_what_they_were_built_with stdout ----

thread 'pattern::tests::a_pattern_and_its_parts_report_what_they_were_built_with' (1887693) panicked at crates/casm-core/src/pattern.rs:946:14:
valid: MissingField { field: "name" }

failures:
    pattern::tests::a_pattern_and_its_parts_report_what_they_were_built_with

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
