*** crates/casm-core/src/pattern.rs:369:47: replace == with != in PatternConfig::reject_duplicate_roles

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace == with != in PatternConfig::reject_duplicate_roles
@@ -361,17 +361,17 @@
     }
 
     /// Enforces that role names are unique.
     fn reject_duplicate_roles(requirements: &[Requirement]) -> Result<(), PatternError> {
         for (index, candidate) in requirements.iter().enumerate() {
             let duplicated = requirements
                 .iter()
                 .take(index)
-                .any(|earlier| earlier.role() == candidate.role());
+                .any(|earlier| earlier.role() != /* ~ changed by cargo-mutants ~ */ candidate.role());
             if duplicated {
                 return Err(PatternError::DuplicateRole {
                     role: candidate.role().as_str().to_owned(),
                 });
             }
         }
         Ok(())
     }

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1890147) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: DuplicateRole { role: "application" }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1890148) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: DuplicateRole { role: "application" }

---- conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes stdout ----

thread 'conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes' (1890152) panicked at crates/casm-core/src/conformance.rs:707:14:
called `Result::unwrap()` on an `Err` value: DuplicateRole { role: "application" }

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::checking_is_deterministic
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::relationship_direction_matters
    conformance::tests::roles_bind_automatically_when_exactly_one_node_fits
    pattern::tests::a_fingerprint_changes_when_the_shape_cha

test result: FAILED. 183 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
