*** crates/casm-core/src/pattern.rs:384:9: replace PatternConfig::reject_unknown_roles -> Result<(), PatternError> with Ok(())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternConfig::reject_unknown_roles -> Result<(), PatternError> with Ok(())
@@ -376,36 +376,17 @@
         Ok(())
     }
 
     /// Enforces that every relationship references a declared role.
     fn reject_unknown_roles(
         requirements: &[Requirement],
         relationships: &[RequiredRelationship],
     ) -> Result<(), PatternError> {
-        let declares = |role: &Name| {
-            requirements
-                .iter()
-                .any(|requirement| requirement.role() == role)
-        };
-
-        for relationship in relationships {
-            for (endpoint, role) in [
-                ("source", relationship.source()),
-                ("target", relationship.target()),
-            ] {
-                if !declares(role) {
-                    return Err(PatternError::UnknownRole {
-                        endpoint,
-                        role: role.as_str().to_owned(),
-                    });
-                }
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Phase 2 of pattern construction: an immutable, internally-consistent shape.
 ///
 /// # Examples
 ///
 /// ```

---- pattern::tests::build_names_which_endpoint_was_unknown stdout ----

thread 'pattern::tests::build_names_which_endpoint_was_unknown' (1890737) panicked at crates/casm-core/src/pattern.rs:786:14:

---- pattern::tests::build_rejects_a_relationship_naming_an_undeclared_role stdout ----

thread 'pattern::tests::build_rejects_a_relationship_naming_an_undeclared_role' (1890740) panicked at crates/casm-core/src/pattern.rs:766:14:

---- pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde stdout ----

thread 'pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde' (1890748) panicked at crates/casm-core/src/pattern.rs:889:9:
assertion failed: matches!(smuggled.verify_invariants(), Err(PatternError::UnknownRole { .. }))

failures:
    pattern::tests::build_names_which_endpoint_was_unknown
    pattern::tests::build_rejects_a_relationship_naming_an_undeclared_role
    pattern::tests::verify_invariants_catches_an_unknown_role_smuggled_in_via_serde

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
