*** crates/casm-core/src/pattern.rs:395:20: delete ! in PatternConfig::reject_unknown_roles

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ delete ! in PatternConfig::reject_unknown_roles
@@ -387,17 +387,17 @@
                 .any(|requirement| requirement.role() == role)
         };
 
         for relationship in relationships {
             for (endpoint, role) in [
                 ("source", relationship.source()),
                 ("target", relationship.target()),
             ] {
-                if !declares(role) {
+                if  /* ~ changed by cargo-mutants ~ */declares(role) {
                     return Err(PatternError::UnknownRole {
                         endpoint,
                         role: role.as_str().to_owned(),
                     });
                 }
             }
         }
         Ok(())

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1891733) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: UnknownRole { endpoint: "source", role: "edge" }

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1891734) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: UnknownRole { endpoint: "source", role: "edge" }

---- conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at stdout ----

thread 'conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at' (1891739) panicked at crates/casm-core/src/conformance.rs:509:14:
called `Result::unwrap()` on an `Err` value: UnknownRole { endpoint: "source", role: "edge" }

failures:
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::binding_a_role_the_pattern_does_not_require_is_reported
    conformance::tests::checking_is_deterministic
    conformance::tests::relationship_direction_matters
    conformance::tests::roles_bind_automatically_when_exactly_one_node_fits
    pattern::tests::a_fingerprint_changes_when_the_shape_changes
    pattern::tests::a_fingerprint_distinguishes_relationship_direction

test result: FAILED. 183 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
