*** crates/casm-core/src/pattern.rs:489:9: replace Pattern::satisfies -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::satisfies -> &[String] with Vec::leak(Vec::new())
@@ -481,17 +481,17 @@
     pub fn relationships(&self) -> &[RequiredRelationship] {
         &self.relationships
     }
 
     /// The standards this pattern helps satisfy.
     #[inline]
     #[must_use]
     pub fn satisfies(&self) -> &[String] {
-        &self.satisfies
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The pattern's annotations.
     #[inline]
     #[must_use]
     pub const fn metadata(&self) -> &BTreeMap<String, String> {
         &self.metadata
     }

---- pattern::tests::a_fingerprint_distinguishes_the_compliance_claim stdout ----

thread 'pattern::tests::a_fingerprint_distinguishes_the_compliance_claim' (1896181) panicked at crates/casm-core/src/pattern.rs:1090:9:
assertion `left != right` failed
  left: Fingerprint(a31277e0263d…)
 right: Fingerprint(a31277e0263d…)

---- pattern::tests::satisfied_standards_are_deduplicated stdout ----

thread 'pattern::tests::satisfied_standards_are_deduplicated' (1896203) panicked at crates/casm-core/src/pattern.rs:1031:9:
assertion `left == right` failed
  left: []
 right: ["SOC2", "ISO27001"]

failures:
    pattern::tests::a_fingerprint_distinguishes_the_compliance_claim
    pattern::tests::satisfied_standards_are_deduplicated

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
