*** crates/casm-core/src/pattern.rs:508:9: replace Pattern::reference -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Pattern::reference -> String with "xyzzy".into()
@@ -500,17 +500,17 @@
     #[must_use]
     pub fn requirement(&self, role: &str) -> Option<&Requirement> {
         self.requirements.iter().find(|r| r.role().as_str() == role)
     }
 
     /// The `name@version` reference that identifies this pattern.
     #[must_use]
     pub fn reference(&self) -> String {
-        format!("{}@{}", self.name, self.version)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The pattern's content address.
     ///
     /// Independent of declaration order, so the same shape written in a different order
     /// has the same address. This is what a registry would key on; see ADR-0012 on why
     /// the registry is not a prerequisite for any of this.
     #[must_use]

---- conformance::tests::a_conforming_architecture_reports_nothing_unmet stdout ----

thread 'conformance::tests::a_conforming_architecture_reports_nothing_unmet' (1899158) panicked at crates/casm-core/src/conformance.rs:520:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "secure-web-tier@1.0.0"

---- pattern::tests::a_reference_is_name_at_version stdout ----

thread 'pattern::tests::a_reference_is_name_at_version' (1899307) panicked at crates/casm-core/src/pattern.rs:849:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "secure-web-tier@1.0.0"

failures:
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    pattern::tests::a_reference_is_name_at_version

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
