*** crates/casm-core/src/pattern.rs:600:9: replace PatternRef::matches -> bool with false

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace PatternRef::matches -> bool with false
@@ -592,17 +592,17 @@
     #[must_use]
     pub const fn version(&self) -> &Version {
         &self.version
     }
 
     /// Returns `true` if `pattern` is the one referenced.
     #[must_use]
     pub fn matches(&self, pattern: &Pattern) -> bool {
-        pattern.name().as_str() == self.name && pattern.version() == &self.version
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for PatternRef {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}@{}", self.name, self.version)
     }
 }

---- pattern::tests::references_parse_and_match stdout ----

thread 'pattern::tests::references_parse_and_match' (1903602) panicked at crates/casm-core/src/pattern.rs:857:9:
assertion failed: reference.matches(&web_tier())

failures:
    pattern::tests::references_parse_and_match

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
