*** crates/casm-core/src/pattern.rs:606:9: replace <impl fmt::Display for PatternRef>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace <impl fmt::Display for PatternRef>::fmt -> fmt::Result with Ok(Default::default())
@@ -598,17 +598,17 @@
     #[must_use]
     pub fn matches(&self, pattern: &Pattern) -> bool {
         pattern.name().as_str() == self.name && pattern.version() == &self.version
     }
 }
 
 impl fmt::Display for PatternRef {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        write!(f, "{}@{}", self.name, self.version)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Serialize for PatternRef {
     fn serialize<S: serde::Serializer>(&self, serializer: S) -> Result<S::Ok, S::Error> {
         serializer.serialize_str(&self.to_string())
     }
 }

---- architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde stdout ----

thread 'architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde' (1905700) panicked at crates/casm-core/src/architecture.rs:1122:67:
called `Result::unwrap()` on an `Err` value: Error("'' is not a valid pattern reference: expected 'name@version'", line: 0, column: 0)

---- pattern::tests::a_conformance_claim_renders_the_pattern_it_names stdout ----

thread 'pattern::tests::a_conformance_claim_renders_the_pattern_it_names' (1905835) panicked at crates/casm-core/src/pattern.rs:972:9:
assertion `left == right` failed
  left: ""
 right: "secure-web-tier@1.0.0"

---- pattern::tests::a_reference_round_trips_as_a_bare_string stdout ----

thread 'pattern::tests::a_reference_round_trips_as_a_bare_string' (1905846) panicked at crates/casm-core/src/pattern.rs:1008:9:
assertion `left == right` failed
  left: "\"\""
 right: "\"tier@1.2.3\""

failures:
    architecture::tests::verify_invariants_catches_a_binding_smuggled_in_via_serde
    pattern::tests::a_conformance_claim_renders_the_pattern_it_names
    pattern::tests::a_reference_round_trips_as_a_bare_string

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
