*** crates/casm-core/src/pattern.rs:679:9: replace Conformance::bound -> Option<NodeId> with None

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Conformance::bound -> Option<NodeId> with None
@@ -671,17 +671,17 @@
     #[must_use]
     pub const fn bindings(&self) -> &BTreeMap<Name, NodeId> {
         &self.bindings
     }
 
     /// The node explicitly bound to `role`, if any.
     #[must_use]
     pub fn bound(&self, role: &Name) -> Option<NodeId> {
-        self.bindings.get(role).copied()
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Conformance {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         fmt::Display::fmt(&self.pattern, f)
     }
 }

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1907690) panicked at crates/casm-core/src/architecture.rs:972:9:
assertion `left == right` failed
  left: None
 right: Some(NodeId(019fd257-40fe-7ef3-b378-024c3aff7586))

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1907840) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

---- conformance::tests::an_explicit_binding_resolves_the_ambiguity stdout ----

thread 'conformance::tests::an_explicit_binding_resolves_the_ambiguity' (1907858) panicked at crates/casm-core/src/conformance.rs:583:9:
[Ambiguous { role: "application", node_type: "service", candidates: ["orders", "payments"] }]

failures:
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::an_explicit_binding_resolves_the_ambiguity

test result: FAILED. 202 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
