*** crates/casm-core/src/pattern.rs:679:9: replace Conformance::bound -> Option<NodeId> with Some(Default::default())

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace Conformance::bound -> Option<NodeId> with Some(Default::default())
@@ -671,17 +671,17 @@
     #[must_use]
     pub const fn bindings(&self) -> &BTreeMap<Name, NodeId> {
         &self.bindings
     }
 
     /// The node explicitly bound to `role`, if any.
     #[must_use]
     pub fn bound(&self, role: &Name) -> Option<NodeId> {
-        self.bindings.get(role).copied()
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Conformance {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         fmt::Display::fmt(&self.pattern, f)
     }
 }

---- architecture::tests::a_conformance_claim_is_recorded_in_declaration_order stdout ----

thread 'architecture::tests::a_conformance_claim_is_recorded_in_declaration_order' (1907671) panicked at crates/casm-core/src/architecture.rs:972:9:
assertion `left == right` failed
  left: Some(NodeId(019fd257-40fb-7db3-b8fe-e0adbcf975b8))
 right: Some(NodeId(019fd257-40fb-7db3-b8fe-e084069d13f6))

---- conformance::tests::a_missing_control_type_is_reported stdout ----

thread 'conformance::tests::a_missing_control_type_is_reported' (1907778) panicked at crates/casm-core/src/conformance.rs:671:9:
assertion failed: matches!(report.unmet(), [Unmet::MissingControlType { control_type, .. }] if
    control_type == "compliance")

---- conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound stdout ----

thread 'conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound' (1907776) panicked at crates/casm-core/src/conformance.rs:612:9:
assertion failed: matches!(report.unmet(), [Unmet::WrongType { role, found, .. }] if role ==
    "edge" && found == "service")

failures:
    architecture::tests::a_conformance_claim_is_recorded_in_declaration_order
    conformance::tests::a_binding_to_the_wrong_type_is_reported_rather_than_rebound
    conformance::tests::a_conforming_architecture_reports_nothing_unmet
    conformance::tests::a_missing_control_type_is_reported
    conformance::tests::a_missing_protocol_is_reported
    conformance::tests::a_missing_relationship_is_reported_with_both_roles_and_both_nodes
    conformance::tests::a_role_two_nodes_could_fill_is_reported_rather_than_guessed_at
    conformance::tests::an_explicit_binding_resolves_the_ambiguity
    conformance::tests::an_unfillable_role_does_not_also_report_its_relationships
    conformance::tests::every_unmet_variant_renders_a_message_naming_its_role
    conformance::tests::mechanical_failures_are_separated_from_ones_needing_a_decision
    conformance::tests::roles_bind_automatically_wh

test result: FAILED. 192 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
