*** crates/casm-core/src/pattern.rs:82:5: replace is_zero -> bool with false

*** mutation diff:
--- crates/casm-core/src/pattern.rs
+++ replace is_zero -> bool with false
@@ -74,17 +74,17 @@
     /// Protocols the node must expose an interface for.
     #[serde(default, skip_serializing_if = "Vec::is_empty")]
     required_protocols: Vec<Protocol>,
 }
 
 /// `serde` skip helper.
 #[allow(clippy::trivially_copy_pass_by_ref)] // Required by `skip_serializing_if`.
 const fn is_zero(value: &usize) -> bool {
-    *value == 0
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 impl Requirement {
     /// Constructs a requirement.
     ///
     /// # Errors
     ///
     /// Returns [`PatternError::Name`] if the role name violates the name alphabet.

---- pattern::tests::a_requirement_omits_a_zero_control_minimum_when_serialised stdout ----

thread 'pattern::tests::a_requirement_omits_a_zero_control_minimum_when_serialised' (1874880) panicked at crates/casm-core/src/pattern.rs:985:9:
assertion `left == right` failed
  left: "{\"role\":\"edge\",\"type\":\"gateway\",\"min-security-controls\":0}"
 right: "{\"role\":\"edge\",\"type\":\"gateway\"}"

failures:
    pattern::tests::a_requirement_omits_a_zero_control_minimum_when_serialised

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
