*** crates/casm-core/src/relationship.rs:198:24: replace == with != in RelationshipConfig::build

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace == with != in RelationshipConfig::build
@@ -190,17 +190,17 @@
 
         if source == target {
             return Err(RelationshipError::SelfEdge {
                 node: source.to_string(),
             });
         }
 
         if let Some(budget) = self.latency_budget_ms
-            && (budget == 0 || budget > MAX_LATENCY_BUDGET_MS)
+            && (budget != /* ~ changed by cargo-mutants ~ */ 0 || budget > MAX_LATENCY_BUDGET_MS)
         {
             return Err(RelationshipError::LatencyOutOfRange {
                 value: budget,
                 max: MAX_LATENCY_BUDGET_MS,
                 source_id: source.to_string(),
                 target_id: target.to_string(),
             });
         }

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (1255108) panicked at crates/casm-core/src/merkle.rs:730:26:
called `Result::unwrap()` on an `Err` value: LatencyOutOfRange { value: 50, max: 86400000, source_id: "019fd1f6-4559-7f31-9aed-84e7c39dcad9", target_id: "019fd1f6-4559-7f31-9aed-84fc49fbfb70" }

---- merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them stdout ----

thread 'merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them' (1255109) panicked at crates/casm-core/src/merkle.rs:643:14:
valid: LatencyOutOfRange { value: 50, max: 86400000, source_id: "019fd1f6-455a-76a2-8ea1-7951e795850e", target_id: "019fd1f6-455a-76a2-8ea1-7972b6f20752" }

---- merkle::tests::a_renamed_node_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_renamed_node_changes_the_fingerprint' (1255111) panicked at crates/casm-core/src/merkle.rs:643:14:
valid: LatencyOutOfRange { value: 50, max: 86400000, source_id: "019fd1f6-455a-76a2-8ea1-7a0d99676608", target_id: "019fd1f6-455a-76a2-8ea1-7a23abb0705f" }

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    merkle::tests::a_conformance_digest_names_bound_nodes_rather_than_identifying_them
    merkle::tests::a_renamed_node_changes_the_fingerprint
    merkle::tests::abbreviation_does_not_panic_on_an_over_long_width
    merkle::tests::changed_nodes_includes_additions_and_removals
    merkle::tests::changed_nodes_is_empty_for_identical_trees
    merkle::tests::changed_nodes_reports_only_what_actually_differs
    merkle::tests::debug_output_stays_short_enough_for_a_log_line
    merkle::tests::declaration_order_does_not_affect_the_fingerprint
    merkle::tests::declaring_conformance_changes_the_fingerprint
    merkle::tests::fingerprinting_is_stable_across_repeated_calls
    merkle::tests::fingerprints_render_and_parse_as_hex

test result: FAILED. 167 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
