*** crates/casm-core/src/relationship.rs:198:39: replace > with >= in RelationshipConfig::build

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace > with >= in RelationshipConfig::build
@@ -190,17 +190,17 @@
 
         if source == target {
             return Err(RelationshipError::SelfEdge {
                 node: source.to_string(),
             });
         }
 
         if let Some(budget) = self.latency_budget_ms
-            && (budget == 0 || budget > MAX_LATENCY_BUDGET_MS)
+            && (budget == 0 || budget >= /* ~ changed by cargo-mutants ~ */ MAX_LATENCY_BUDGET_MS)
         {
             return Err(RelationshipError::LatencyOutOfRange {
                 value: budget,
                 max: MAX_LATENCY_BUDGET_MS,
                 source_id: source.to_string(),
                 target_id: target.to_string(),
             });
         }

---- relationship::tests::build_accepts_the_ceiling_itself stdout ----

thread 'relationship::tests::build_accepts_the_ceiling_itself' (1919844) panicked at crates/casm-core/src/relationship.rs:434:9:
the ceiling must be inclusive

failures:
    relationship::tests::build_accepts_the_ceiling_itself

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
