*** crates/casm-core/src/relationship.rs:314:9: replace Relationship::latency_budget_ms -> Option<u64> with None

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace Relationship::latency_budget_ms -> Option<u64> with None
@@ -306,17 +306,17 @@
     pub fn controls(&self) -> &[Control] {
         &self.controls
     }
 
     /// The single-hop latency budget in milliseconds, if declared.
     #[inline]
     #[must_use]
     pub const fn latency_budget_ms(&self) -> Option<u64> {
-        self.latency_budget_ms
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this edge connects `a` and `b` in either direction.
     #[must_use]
     pub fn connects(&self, a: NodeId, b: NodeId) -> bool {
         (self.source == a && self.target == b) || (self.source == b && self.target == a)
     }

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (1924361) panicked at crates/casm-core/src/merkle.rs:871:9:
assertion `left != right` failed
  left: Fingerprint(44f4d16587cb…)
 right: Fingerprint(44f4d16587cb…)

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
