*** crates/casm-core/src/relationship.rs:314:9: replace Relationship::latency_budget_ms -> Option<u64> with Some(1)

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace Relationship::latency_budget_ms -> Option<u64> with Some(1)
@@ -306,17 +306,17 @@
     pub fn controls(&self) -> &[Control] {
         &self.controls
     }
 
     /// The single-hop latency budget in milliseconds, if declared.
     #[inline]
     #[must_use]
     pub const fn latency_budget_ms(&self) -> Option<u64> {
-        self.latency_budget_ms
+        Some(1) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this edge connects `a` and `b` in either direction.
     #[must_use]
     pub fn connects(&self, a: NodeId, b: NodeId) -> bool {
         (self.source == a && self.target == b) || (self.source == b && self.target == a)
     }

---- merkle::tests::a_changed_latency_budget_changes_the_fingerprint stdout ----

thread 'merkle::tests::a_changed_latency_budget_changes_the_fingerprint' (1262556) panicked at crates/casm-core/src/merkle.rs:735:9:
assertion `left != right` failed
  left: Fingerprint(d3590d1d8e7f…)
 right: Fingerprint(d3590d1d8e7f…)

---- relationship::tests::latency_budget_is_optional stdout ----

thread 'relationship::tests::latency_budget_is_optional' (1262648) panicked at crates/casm-core/src/relationship.rs:439:9:
assertion `left == right` failed
  left: Some(1)
 right: None

failures:
    merkle::tests::a_changed_latency_budget_changes_the_fingerprint
    relationship::tests::latency_budget_is_optional

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
