*** crates/casm-core/src/relationship.rs:74:9: replace RelationshipType::is_blocking -> bool with false

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace RelationshipType::is_blocking -> bool with false
@@ -66,20 +66,17 @@
     }
 
     /// Returns `true` if the source blocks on the target.
     ///
     /// Blocking edges are the ones that propagate failure and accumulate latency, so
     /// this predicate drives both cascade analysis and budget summation.
     #[must_use]
     pub const fn is_blocking(self) -> bool {
-        match self {
-            Self::Sync | Self::DependsOn | Self::Composed | Self::QuantumEntangled => true,
-            Self::Async | Self::EventDriven | Self::DeployedOn => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if a change at either endpoint invalidates the other.
     #[must_use]
     pub const fn is_entangled(self) -> bool {
         matches!(self, Self::QuantumEntangled)
     }

---- relationship::tests::async_edges_are_excluded_from_cycle_detection stdout ----

thread 'relationship::tests::async_edges_are_excluded_from_cycle_detection' (1247935) panicked at crates/casm-core/src/relationship.rs:460:9:
assertion failed: RelationshipType::Sync.forms_dependency_cycle()

---- relationship::tests::blocking_classification_matches_failure_propagation stdout ----

thread 'relationship::tests::blocking_classification_matches_failure_propagation' (1247936) panicked at crates/casm-core/src/relationship.rs:441:9:
assertion failed: RelationshipType::Sync.is_blocking()

failures:
    relationship::tests::async_edges_are_excluded_from_cycle_detection
    relationship::tests::blocking_classification_matches_failure_propagation

test result: FAILED. 186 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
