*** crates/casm-core/src/relationship.rs:92:9: replace RelationshipType::forms_dependency_cycle -> bool with false

*** mutation diff:
--- crates/casm-core/src/relationship.rs
+++ replace RelationshipType::forms_dependency_cycle -> bool with false
@@ -84,17 +84,17 @@
     }
 
     /// Returns `true` if this edge should participate in dependency-cycle detection.
     ///
     /// Asynchronous and event-driven edges are deliberately excluded: a publish/subscribe
     /// loop is a legitimate topology, not a deadlock.
     #[must_use]
     pub const fn forms_dependency_cycle(self) -> bool {
-        self.is_blocking()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for RelationshipType {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.label())
     }
 }

---- relationship::tests::async_edges_are_excluded_from_cycle_detection stdout ----

thread 'relationship::tests::async_edges_are_excluded_from_cycle_detection' (1913471) panicked at crates/casm-core/src/relationship.rs:463:9:
assertion failed: RelationshipType::Sync.forms_dependency_cycle()

failures:
    relationship::tests::async_edges_are_excluded_from_cycle_detection

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
