*** crates/casm-git/src/time.rs:104:17: replace - with + in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace - with + in civil_from_days
@@ -96,17 +96,17 @@
 #[allow(clippy::cast_sign_loss, clippy::cast_possible_truncation)]
 const fn civil_from_days(days: i64) -> (i64, u32, u32) {
     // Shift the epoch from 1970-01-01 to 0000-03-01.
     let shifted = days + 719_468;
 
     let era = if shifted >= 0 {
         shifted
     } else {
-        shifted - 146_096
+        shifted + /* ~ changed by cargo-mutants ~ */ 146_096
     } / 146_097;
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
         (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based

---- time::tests::consecutive_days_are_consecutive_across_the_era_boundary stdout ----

thread 'time::tests::consecutive_days_are_consecutive_across_the_era_boundary' (1282335) panicked at crates/casm-git/src/time.rs:184:9:
assertion `left == right` failed: dates must increase with time: ["0000-03-4294967294", "0000-03-4294967295", "0000-03-00", "0000-03-01", "0000-03-02", "0000-03-03", "0000-03-04"]
  left: ["0000-03-4294967294", "0000-03-4294967295", "0000-03-00", "0000-03-01", "0000-03-02", "0000-03-03", "0000-03-04"]
 right: ["0000-03-00", "0000-03-01", "0000-03-02", "0000-03-03", "0000-03-04", "0000-03-4294967294", "0000-03-4294967295"]

---- time::tests::dates_before_the_algorithms_own_epoch_still_convert stdout ----

thread 'time::tests::dates_before_the_algorithms_own_epoch_still_convert' (1282338) panicked at crates/casm-git/src/time.rs:151:9:
assertion `left == right` failed
  left: "0000-03-00"
 right: "0000-02-29"

failures:
    time::tests::consecutive_days_are_consecutive_across_the_era_boundary
    time::tests::dates_before_the_algorithms_own_epoch_still_convert

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
