*** crates/casm-git/src/time.rs:105:7: replace / with % in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace / with % in civil_from_days
@@ -97,17 +97,17 @@
 const fn civil_from_days(days: i64) -> (i64, u32, u32) {
     // Shift the epoch from 1970-01-01 to 0000-03-01.
     let shifted = days + 719_468;
 
     let era = if shifted >= 0 {
         shifted
     } else {
         shifted - 146_096
-    } / 146_097;
+    } % /* ~ changed by cargo-mutants ~ */ 146_097;
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
         (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (1281339) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "2026-4294966989-4294967291"
 right: "2023-11-14"

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (1281345) panicked at crates/casm-git/src/time.rs:245:9:
assertion `left == right` failed
  left: "1995-4294962585-4294967279 00:00:00"
 right: "1969-12-31 00:00:00"

---- time::tests::consecutive_days_are_consecutive_across_the_era_boundary stdout ----

thread 'time::tests::consecutive_days_are_consecutive_across_the_era_boundary' (1281346) panicked at crates/casm-git/src/time.rs:185:9:
assertion `left == right` failed: each day must be distinct: ["0000-02-28", "0000-02-28", "0000-03-00", "0000-03-01", "0001-4294967288-4294967268", "0001-4294967288-4294967268", "0001-4294967288-4294967268"]
  left: 4
 right: 7

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::consecutive_days_are_consecutive_across_the_era_boundary
    time::tests::conversion_is_monotonic
    time::tests::dates_before_1970_convert_correctly
    time::tests::dates_before_the_algorithms_own_epoch_still_convert
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly

test result: FAILED. 11 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
