*** crates/casm-git/src/time.rs:106:36: replace * with + in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace * with + in civil_from_days
@@ -98,17 +98,17 @@
     // Shift the epoch from 1970-01-01 to 0000-03-01.
     let shifted = days + 719_468;
 
     let era = if shifted >= 0 {
         shifted
     } else {
         shifted - 146_096
     } / 146_097;
-    let day_of_era = shifted - era * 146_097; // 0..=146_096
+    let day_of_era = shifted - era + /* ~ changed by cargo-mutants ~ */ 146_097; // 0..=146_096
     let year_of_era =
         (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based
 
     let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (1283412) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "4423-11-15"
 right: "2023-11-14"

---- time::tests::dates_before_the_algorithms_own_epoch_still_convert stdout ----

thread 'time::tests::dates_before_the_algorithms_own_epoch_still_convert' (1283422) panicked at crates/casm-git/src/time.rs:150:9:
assertion `left == right` failed
  left: "0400-03-02"
 right: "0000-03-01"

---- time::tests::dates_before_1970_convert_correctly stdout ----

thread 'time::tests::dates_before_1970_convert_correctly' (1283421) panicked at crates/casm-git/src/time.rs:168:9:
assertion `left == right` failed
  left: "3970-01-01"
 right: "1969-12-31"

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::conversion_is_monotonic
    time::tests::dates_before_1970_convert_correctly
    time::tests::dates_before_the_algorithms_own_epoch_still_convert
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 13 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
