*** crates/casm-git/src/time.rs:108:42: replace + with * in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace + with * in civil_from_days
@@ -100,17 +100,17 @@
 
     let era = if shifted >= 0 {
         shifted
     } else {
         shifted - 146_096
     } / 146_097;
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
-        (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
+        (day_of_era - day_of_era / 1_460 * /* ~ changed by cargo-mutants ~ */ day_of_era / 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based
 
     let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;
     let month = if month_prime < 10 {
         month_prime + 3

---- time::tests::conversion_is_monotonic stdout ----

thread 'time::tests::conversion_is_monotonic' (1285542) panicked at crates/casm-git/src/time.rs:274:13:
went backwards at 9999991

---- time::tests::every_component_stays_in_range_across_a_wide_span stdout ----

thread 'time::tests::every_component_stays_in_range_across_a_wide_span' (1285545) panicked at crates/casm-git/src/time.rs:258:13:
day at 1362007086

---- time::tests::leap_days_are_handled stdout ----

thread 'time::tests::leap_days_are_handled' (1285548) panicked at crates/casm-git/src/time.rs:219:9:
assertion `left == right` failed
  left: "2024-03-00"
 right: "2024-02-29"

failures:
    time::tests::conversion_is_monotonic
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct

test result: FAILED. 19 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
