*** crates/casm-git/src/time.rs:108:55: replace / with % in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace / with % in civil_from_days
@@ -100,17 +100,17 @@
 
     let era = if shifted >= 0 {
         shifted
     } else {
         shifted - 146_096
     } / 146_097;
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
-        (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
+        (day_of_era - day_of_era / 1_460 + day_of_era % /* ~ changed by cargo-mutants ~ */ 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based
 
     let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;
     let month = if month_prime < 10 {
         month_prime + 3

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (1286855) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "2047-4294967021-4294967295"
 right: "2023-11-14"

---- time::tests::consecutive_days_are_consecutive_across_the_era_boundary stdout ----

thread 'time::tests::consecutive_days_are_consecutive_across_the_era_boundary' (1286863) panicked at crates/casm-git/src/time.rs:184:9:
assertion `left == right` failed: dates must increase with time: ["0100-4294966106-4294967276", "0100-4294966106-4294967277", "0000-02-29", "0000-03-01", "0000-03-02", "0000-03-03", "0000-03-04"]
  left: ["0100-4294966106-4294967276", "0100-4294966106-4294967277", "0000-02-29", "0000-03-01", "0000-03-02", "0000-03-03", "0000-03-04"]
 right: ["0000-02-29", "0000-03-01", "0000-03-02", "0000-03-03", "0000-03-04", "0100-4294966106-4294967276", "0100-4294966106-4294967277"]

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (1286862) panicked at crates/casm-git/src/time.rs:245:9:
assertion `left == right` failed
  left: "2039-4294966474-4294967280 00:00:00"
 right: "1969-12-31 00:00:00"

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::consecutive_days_are_consecutive_across_the_era_boundary
    time::tests::conversion_is_monotonic
    time::tests::dates_before_1970_convert_correctly
    time::tests::dates_before_the_algorithms_own_epoch_still_convert
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly

test result: FAILED. 11 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
