*** crates/casm-git/src/time.rs:108:64: replace - with / in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace - with / in civil_from_days
@@ -100,17 +100,17 @@
 
     let era = if shifted >= 0 {
         shifted
     } else {
         shifted - 146_096
     } / 146_097;
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
-        (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
+        (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 / /* ~ changed by cargo-mutants ~ */ day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based
 
     let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;
     let month = if month_prime < 10 {
         month_prime + 3

---- time::tests::conversion_is_monotonic stdout ----

thread 'time::tests::conversion_is_monotonic' (1285161) panicked at crates/casm-git/src/time.rs:274:13:
went backwards at 99999910

---- time::tests::consecutive_days_are_consecutive_across_the_era_boundary stdout ----

thread 'time::tests::consecutive_days_are_consecutive_across_the_era_boundary' (1285160) panicked at crates/casm-git/src/time.rs:108:44:
attempt to divide by zero

---- time::tests::dates_before_the_algorithms_own_epoch_still_convert stdout ----

thread 'time::tests::dates_before_the_algorithms_own_epoch_still_convert' (1285163) panicked at crates/casm-git/src/time.rs:108:44:
attempt to divide by zero

failures:
    time::tests::consecutive_days_are_consecutive_across_the_era_boundary
    time::tests::conversion_is_monotonic
    time::tests::dates_before_the_algorithms_own_epoch_still_convert
    time::tests::nineteen_hundred_was_not_a_leap_year

test result: FAILED. 20 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
