*** crates/casm-git/src/time.rs:114:58: replace + with - in civil_from_days

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace + with - in civil_from_days
@@ -106,17 +106,17 @@
     let day_of_era = shifted - era * 146_097; // 0..=146_096
     let year_of_era =
         (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
 
     let year = year_of_era + era * 400;
     let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
     let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based
 
-    let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;
+    let day = (day_of_year - (153 * month_prime + 2) / 5 - /* ~ changed by cargo-mutants ~ */ 1) as u32;
     let month = if month_prime < 10 {
         month_prime + 3
     } else {
         month_prime - 9
     } as u32;
 
     (if month <= 2 { year + 1 } else { year }, month, day)
 }

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (1296398) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "2023-11-12"
 right: "2023-11-14"

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (1296404) panicked at crates/casm-git/src/time.rs:245:9:
assertion `left == right` failed
  left: "1969-12-29 00:00:00"
 right: "1969-12-31 00:00:00"

---- time::tests::consecutive_days_are_consecutive_across_the_era_boundary stdout ----

thread 'time::tests::consecutive_days_are_consecutive_across_the_era_boundary' (1296405) panicked at crates/casm-git/src/time.rs:184:9:
assertion `left == right` failed: dates must increase with time: ["0000-02-25", "0000-02-26", "0000-02-27", "0000-03-4294967295", "0000-03-00", "0000-03-01", "0000-03-02"]
  left: ["0000-02-25", "0000-02-26", "0000-02-27", "0000-03-4294967295", "0000-03-00", "0000-03-01", "0000-03-02"]
 right: ["0000-02-25", "0000-02-26", "0000-02-27", "0000-03-00", "0000-03-01", "0000-03-02", "0000-03-4294967295"]

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::consecutive_days_are_consecutive_across_the_era_boundary
    time::tests::dates_before_1970_convert_correctly
    time::tests::dates_before_the_algorithms_own_epoch_still_convert
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 12 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
