*** crates/casm-git/src/time.rs:64:42: replace / with % in DateTime::from_unix

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace / with % in DateTime::from_unix
@@ -56,17 +56,17 @@
 
         let (year, month, day) = civil_from_days(days);
 
         Self {
             year,
             month,
             day,
             hour: (remainder / 3_600) as u32,
-            minute: ((remainder % 3_600) / 60) as u32,
+            minute: ((remainder % 3_600) % /* ~ changed by cargo-mutants ~ */ 60) as u32,
             second: (remainder % 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {
         format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)

---- time::tests::known_timestamps_convert_correctly stdout ----

thread 'time::tests::known_timestamps_convert_correctly' (1274690) panicked at crates/casm-git/src/time.rs:205:13:
assertion `left == right` failed: at 1000000000
  left: "2001-09-09 01:40:40"
 right: "2001-09-09 01:46:40"

failures:
    time::tests::known_timestamps_convert_correctly

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
