*** crates/casm-git/src/time.rs:64:42: replace / with * in DateTime::from_unix

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace / with * in DateTime::from_unix
@@ -56,17 +56,17 @@
 
         let (year, month, day) = civil_from_days(days);
 
         Self {
             year,
             month,
             day,
             hour: (remainder / 3_600) as u32,
-            minute: ((remainder % 3_600) / 60) as u32,
+            minute: ((remainder % 3_600) * /* ~ changed by cargo-mutants ~ */ 60) as u32,
             second: (remainder % 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {
         format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)

---- time::tests::known_timestamps_convert_correctly stdout ----

thread 'time::tests::known_timestamps_convert_correctly' (1272812) panicked at crates/casm-git/src/time.rs:205:13:
assertion `left == right` failed: at 1000000000
  left: "2001-09-09 01:168000:40"
 right: "2001-09-09 01:46:40"

---- time::tests::dates_before_1970_convert_correctly stdout ----

thread 'time::tests::dates_before_1970_convert_correctly' (1272808) panicked at crates/casm-git/src/time.rs:170:9:
assertion `left == right` failed
  left: "1969-12-31 23:215940:59"
 right: "1969-12-31 23:59:59"

---- time::tests::every_component_stays_in_range_across_a_wide_span stdout ----

thread 'time::tests::every_component_stays_in_range_across_a_wide_span' (1272810) panicked at crates/casm-git/src/time.rs:260:13:
minute at -1000000000

failures:
    time::tests::dates_before_1970_convert_correctly
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 20 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
