*** crates/casm-git/src/time.rs:65:32: replace % with + in DateTime::from_unix

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace % with + in DateTime::from_unix
@@ -57,17 +57,17 @@
         let (year, month, day) = civil_from_days(days);
 
         Self {
             year,
             month,
             day,
             hour: (remainder / 3_600) as u32,
             minute: ((remainder % 3_600) / 60) as u32,
-            second: (remainder % 60) as u32,
+            second: (remainder + /* ~ changed by cargo-mutants ~ */ 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {
         format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)
     }

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (1274652) panicked at crates/casm-git/src/time.rs:245:9:
assertion `left == right` failed
  left: "1969-12-31 00:00:60"
 right: "1969-12-31 00:00:00"

---- time::tests::dates_before_1970_convert_correctly stdout ----

thread 'time::tests::dates_before_1970_convert_correctly' (1274655) panicked at crates/casm-git/src/time.rs:170:9:
assertion `left == right` failed
  left: "1969-12-31 23:59:86459"
 right: "1969-12-31 23:59:59"

---- time::tests::every_component_stays_in_range_across_a_wide_span stdout ----

thread 'time::tests::every_component_stays_in_range_across_a_wide_span' (1274657) panicked at crates/casm-git/src/time.rs:261:13:
second at -1000000000

failures:
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::dates_before_1970_convert_correctly
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::the_epoch_itself_converts_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 18 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
