*** crates/casm-git/src/time.rs:72:9: replace DateTime::to_date -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace DateTime::to_date -> String with "xyzzy".into()
@@ -64,17 +64,17 @@
             minute: ((remainder % 3_600) / 60) as u32,
             second: (remainder % 60) as u32,
         }
     }
 
     /// Renders as `YYYY-MM-DD`.
     #[must_use]
     pub fn to_date(&self) -> String {
-        format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders as `YYYY-MM-DD HH:MM:SS`.
     #[must_use]
     pub fn to_datetime(&self) -> String {
         format!(
             "{:04}-{:02}-{:02} {:02}:{:02}:{:02}",
             self.year, self.month, self.day, self.hour, self.minute, self.second

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (1276156) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "2023-11-14"

---- time::tests::consecutive_days_are_consecutive_across_the_era_boundary stdout ----

thread 'time::tests::consecutive_days_are_consecutive_across_the_era_boundary' (1276164) panicked at crates/casm-git/src/time.rs:185:9:
assertion `left == right` failed: each day must be distinct: ["xyzzy", "xyzzy", "xyzzy", "xyzzy", "xyzzy", "xyzzy", "xyzzy"]
  left: 1
 right: 7

---- time::tests::dates_before_1970_convert_correctly stdout ----

thread 'time::tests::dates_before_1970_convert_correctly' (1276166) panicked at crates/casm-git/src/time.rs:168:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "1969-12-31"

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::consecutive_days_are_consecutive_across_the_era_boundary
    time::tests::dates_before_1970_convert_correctly
    time::tests::dates_before_the_algorithms_own_epoch_still_convert
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_date_form_is_a_prefix_of_the_datetime_form
    time::tests::the_day_before_and_after_a_leap_day_are_correct

test result: FAILED. 16 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
