*** crates/casm-git/src/time.rs:78:9: replace DateTime::to_datetime -> String with String::new()

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace DateTime::to_datetime -> String with String::new()
@@ -70,20 +70,17 @@
     #[must_use]
     pub fn to_date(&self) -> String {
         format!("{:04}-{:02}-{:02}", self.year, self.month, self.day)
     }
 
     /// Renders as `YYYY-MM-DD HH:MM:SS`.
     #[must_use]
     pub fn to_datetime(&self) -> String {
-        format!(
-            "{:04}-{:02}-{:02} {:02}:{:02}:{:02}",
-            self.year, self.month, self.day, self.hour, self.minute, self.second
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl core::fmt::Display for DateTime {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
         f.write_str(&self.to_datetime())
     }
 }

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (1276122) panicked at crates/casm-git/src/time.rs:242:9:
assertion `left == right` failed
  left: ""
 right: "1969-12-31 00:00:00"

---- time::tests::dates_before_1970_convert_correctly stdout ----

thread 'time::tests::dates_before_1970_convert_correctly' (1276125) panicked at crates/casm-git/src/time.rs:167:9:
assertion `left == right` failed
  left: ""
 right: "1969-12-31 23:59:59"

---- time::tests::the_date_form_is_a_prefix_of_the_datetime_form stdout ----

thread 'time::tests::the_date_form_is_a_prefix_of_the_datetime_form' (1276132) panicked at crates/casm-git/src/time.rs:286:9:
assertion failed: moment.to_datetime().starts_with(&moment.to_date())

failures:
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::dates_before_1970_convert_correctly
    time::tests::known_timestamps_convert_correctly
    time::tests::the_date_form_is_a_prefix_of_the_datetime_form
    time::tests::the_epoch_itself_converts_correctly
    time::tests::timestamps_before_the_epoch_do_not_produce_negative_times

test result: FAILED. 18 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
