*** crates/casm-git/src/time.rs:99:5: replace civil_from_days -> (i64, u32, u32) with (1, 0, 0)

*** mutation diff:
--- crates/casm-git/src/time.rs
+++ replace civil_from_days -> (i64, u32, u32) with (1, 0, 0)
@@ -91,39 +91,17 @@
 /// Converts days since the Unix epoch into a proleptic Gregorian date.
 ///
 /// Howard Hinnant's `civil_from_days`. The era trick shifts the calendar so that March is
 /// the first month, which makes the leap day fall at the end of a year and removes every
 /// special case for February.
 #[allow(clippy::cast_sign_loss, clippy::cast_possible_truncation)]
 const fn civil_from_days(days: i64) -> (i64, u32, u32) {
     // Shift the epoch from 1970-01-01 to 0000-03-01.
-    let shifted = days + 719_468;
-
-    let era = if shifted >= 0 {
-        shifted
-    } else {
-        shifted - 146_096
-    } / 146_097;
-    let day_of_era = shifted - era * 146_097; // 0..=146_096
-    let year_of_era =
-        (day_of_era - day_of_era / 1_460 + day_of_era / 36_524 - day_of_era / 146_096) / 365;
-
-    let year = year_of_era + era * 400;
-    let day_of_year = day_of_era - (365 * year_of_era + year_of_era / 4 - year_of_era / 100);
-    let month_prime = (5 * day_of_year + 2) / 153; // 0..=11, March-based
-
-    let day = (day_of_year - (153 * month_prime + 2) / 5 + 1) as u32;
-    let month = if month_prime < 10 {
-        month_prime + 3
-    } else {
-        month_prime - 9
-    } as u32;
-
-    (if month <= 2 { year + 1 } else { year }, month, day)
+    (1, 0, 0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- tests::a_revision_renders_its_author_time_as_utc stdout ----

thread 'tests::a_revision_renders_its_author_time_as_utc' (1278990) panicked at crates/casm-git/src/lib.rs:436:9:
assertion `left == right` failed
  left: "0001-00-00"
 right: "2023-11-14"

---- time::tests::a_full_day_before_the_epoch_converts_correctly stdout ----

thread 'time::tests::a_full_day_before_the_epoch_converts_correctly' (1278996) panicked at crates/casm-git/src/time.rs:223:9:
assertion `left == right` failed
  left: "0001-00-00 00:00:00"
 right: "1969-12-31 00:00:00"

---- time::tests::dates_before_the_algorithms_own_epoch_still_convert stdout ----

thread 'time::tests::dates_before_the_algorithms_own_epoch_still_convert' (1279000) panicked at crates/casm-git/src/time.rs:128:9:
assertion `left == right` failed
  left: "0001-00-00"
 right: "0000-03-01"

failures:
    tests::a_revision_renders_its_author_time_as_utc
    time::tests::a_full_day_before_the_epoch_converts_correctly
    time::tests::consecutive_days_are_consecutive_across_the_era_boundary
    time::tests::conversion_is_monotonic
    time::tests::dates_before_1970_convert_correctly
    time::tests::dates_before_the_algorithms_own_epoch_still_convert
    time::tests::every_component_stays_in_range_across_a_wide_span
    time::tests::known_timestamps_convert_correctly
    time::tests::leap_days_are_handled
    time::tests::nineteen_hundred_was_not_a_leap_year
    time::tests::the_day_before_and_after_a_leap_day_are_correct
    time::tests::the_epoch_itself_converts_correctly

test result: FAILED. 11 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
