*** crates/casm-parser/src/document.rs:471:9: replace NodeIndex<'a>::lookup -> Option<NodeId> with None

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace NodeIndex<'a>::lookup -> Option<NodeId> with None
@@ -463,23 +463,17 @@
         }
     }
 
     /// Looks up a reference written as either a node name or a `NodeId`.
     fn lookup(&self, reference: &str) -> Option<NodeId> {
         // Names are tried first: they are the common case, and a name that happens to
         // look like a UUID is impossible (the CASIMIR alphabet permits it, but a node so
         // named would still be found here, which is the author's evident intent).
-        if let Some((_, id)) = self.by_name.iter().find(|(name, _)| *name == reference) {
-            return Some(*id);
-        }
-
-        NodeId::parse(reference)
-            .ok()
-            .filter(|id| self.by_name.iter().any(|(_, known)| known == id))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The "did you mean" hint for an unresolvable reference, if one is close enough.
     fn hint(&self, reference: &str) -> Option<String> {
         let names = self.by_name.iter().map(|(name, _)| *name);
         suggest::closest(reference, names).map(suggest::did_you_mean)
     }

---- document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so stdout ----

thread 'document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so' (2271349) panicked at crates/casm-parser/src/document.rs:787:67:
resolves: UnresolvedReference { path: "architecture.yaml", endpoint: "source", reference: "api", suggestion: Some("did you mean `api`?") }

---- document::tests::an_identifier_resolves_only_to_the_node_that_owns_it stdout ----

thread 'document::tests::an_identifier_resolves_only_to_the_node_that_owns_it' (2271352) panicked at crates/casm-parser/src/document.rs:740:59:
resolves: UnresolvedReference { path: "architecture.yaml", endpoint: "source", reference: "019fd2ce-895e-7a63-ba5c-a6bae70535be", suggestion: None }

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (2271356) panicked at crates/casm-parser/src/document.rs:830:17:
assertion `left == right` failed
  left: "source"
 right: "target"

failures:
    document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so
    document::tests::an_identifier_resolves_only_to_the_node_that_owns_it
    document::tests::an_inline_schema_is_hashed_at_parse_time
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    document::tests::emitted_relationships_reference_nodes_by_name
    document::tests::resolves_endpoints_written_as_ids
    document::tests::resolves_endpoints_written_as_names
    document::tests::resolves_relationships_declared_before_their_nodes
    document::tests::round_trip_preserves_interfaces_and_controls
    document::tests::round_trip_preserves_node_ids
    document::tests::round_trip_preserves_the_architecture

test result: FAILED. 73 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
