*** crates/casm-parser/src/document.rs:471:9: replace NodeIndex<'a>::lookup -> Option<NodeId> with Some(Default::default())

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace NodeIndex<'a>::lookup -> Option<NodeId> with Some(Default::default())
@@ -463,23 +463,17 @@
         }
     }
 
     /// Looks up a reference written as either a node name or a `NodeId`.
     fn lookup(&self, reference: &str) -> Option<NodeId> {
         // Names are tried first: they are the common case, and a name that happens to
         // look like a UUID is impossible (the CASIMIR alphabet permits it, but a node so
         // named would still be found here, which is the author's evident intent).
-        if let Some((_, id)) = self.by_name.iter().find(|(name, _)| *name == reference) {
-            return Some(*id);
-        }
-
-        NodeId::parse(reference)
-            .ok()
-            .filter(|id| self.by_name.iter().any(|(_, known)| known == id))
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The "did you mean" hint for an unresolvable reference, if one is close enough.
     fn hint(&self, reference: &str) -> Option<String> {
         let names = self.by_name.iter().map(|(name, _)| *name);
         suggest::closest(reference, names).map(suggest::did_you_mean)
     }

---- document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so stdout ----

thread 'document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so' (2271449) panicked at crates/casm-parser/src/document.rs:787:67:
resolves: Semantic { path: "architecture.yaml", message: "relationship references source node '019fd2ce-8a1e-78e1-a587-bbd32f77a263', which does not exist in architecture 'checkout'", suggestion: None }

---- document::tests::an_identifier_resolves_only_to_the_node_that_owns_it stdout ----

thread 'document::tests::an_identifier_resolves_only_to_the_node_that_owns_it' (2271452) panicked at crates/casm-parser/src/document.rs:740:59:
resolves: Semantic { path: "architecture.yaml", message: "relationship references source node '019fd2ce-8a1e-78e1-a587-bc251c568338', which does not exist in architecture 'checkout'", suggestion: None }

---- document::tests::an_identifier_that_is_well_formed_but_undeclared_is_unresolvable stdout ----

thread 'document::tests::an_identifier_that_is_well_formed_but_undeclared_is_unresolvable' (2271453) panicked at crates/casm-parser/src/document.rs:766:9:
expected an unresolved reference, got Semantic { path: "architecture.yaml", message: "relationship references source node '019fd2ce-8a1e-78e1-a587-bc74ffb37f9c', which does not exist in architecture 'checkout'", suggestion: None }

failures:
    document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so
    document::tests::an_identifier_resolves_only_to_the_node_that_owns_it
    document::tests::an_identifier_that_is_well_formed_but_undeclared_is_unresolvable
    document::tests::an_inline_schema_is_hashed_at_parse_time
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    document::tests::emitted_relationships_reference_nodes_by_name
    document::tests::resolves_endpoints_written_as_ids
    document::tests::resolves_endpoints_written_as_names
    document::tests::resolves_relationships_declared_before_their_nodes
    document::tests::round_trip_preserves_interfaces_and_controls
    document::tests::round_trip_preserves_node_ids

test result: FAILED. 72 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
