*** crates/casm-parser/src/document.rs:59:5: replace default_version -> String with "xyzzy".into()

*** mutation diff:
--- crates/casm-parser/src/document.rs
+++ replace default_version -> String with "xyzzy".into()
@@ -51,17 +51,17 @@
 use std::collections::BTreeMap;
 use std::path::Path;
 
 use crate::error::ParseError;
 use crate::suggest;
 
 /// The default architecture version when a document omits one.
 fn default_version() -> String {
-    "0.1.0".to_owned()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// An interface as written by a human.
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(deny_unknown_fields, rename_all = "kebab-case")]
 pub struct InterfaceDoc {
     /// The interface's name, unique within its node.
     pub name: String,

---- tests::an_empty_architecture_is_valid stdout ----

thread 'tests::an_empty_architecture_is_valid' (2269382) panicked at crates/casm-parser/src/lib.rs:347:69:
called `Result::unwrap()` on an `Err` value: Semantic { path: "architecture.yaml", message: "architecture version 'xyzzy' is not valid semantic versioning: unexpected character 'x' while parsing major version number", suggestion: None }

---- tests::snake_case_field_aliases_are_accepted stdout ----

thread 'tests::snake_case_field_aliases_are_accepted' (2269402) panicked at crates/casm-parser/src/lib.rs:367:60:
called `Result::unwrap()` on an `Err` value: Semantic { path: "architecture.yaml", message: "architecture version 'xyzzy' is not valid semantic versioning: unexpected character 'x' while parsing major version number", suggestion: None }

---- tests::version_defaults_when_omitted stdout ----

thread 'tests::version_defaults_when_omitted' (2269407) panicked at crates/casm-parser/src/lib.rs:341:60:
called `Result::unwrap()` on an `Err` value: Semantic { path: "architecture.yaml", message: "architecture version 'xyzzy' is not valid semantic versioning: unexpected character 'x' while parsing major version number", suggestion: None }

failures:
    tests::an_empty_architecture_is_valid
    tests::snake_case_field_aliases_are_accepted
    tests::version_defaults_when_omitted

test result: FAILED. 93 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.68s

*** result: Failure(101)
