*** crates/casm-parser/src/error.rs:180:9: replace ParseError::path -> Option<&Path> with None

*** mutation diff:
--- crates/casm-parser/src/error.rs
+++ replace ParseError::path -> Option<&Path> with None
@@ -172,28 +172,17 @@
         message: String,
     },
 }
 
 impl ParseError {
     /// The file this error concerns, if it concerns one.
     #[must_use]
     pub fn path(&self) -> Option<&Path> {
-        match self {
-            Self::UnknownFormat { path }
-            | Self::Syntax { path, .. }
-            | Self::Semantic { path, .. }
-            | Self::UnresolvedReference { path, .. }
-            | Self::UnresolvedBinding { path, .. }
-            | Self::DuplicatePattern { path, .. }
-            | Self::TooManyPatterns { path, .. }
-            | Self::TooLarge { path, .. }
-            | Self::Io { path, .. } => Some(path),
-            Self::Emit { .. } => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Where in the file the failure occurred, when that is known.
     #[must_use]
     pub const fn location(&self) -> Option<Location> {
         match self {
             Self::Syntax { location, .. } => Some(*location),
             Self::UnknownFormat { .. }

---- error::tests::accessors_agree_with_the_variant stdout ----

thread 'error::tests::accessors_agree_with_the_variant' (2275414) panicked at crates/casm-parser/src/error.rs:316:9:
assertion `left == right` failed
  left: None
 right: Some("a.yaml")

failures:
    error::tests::accessors_agree_with_the_variant

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
