*** crates/casm-parser/src/format.rs:34:9: replace Format::label -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace Format::label -> &'static str with "xyzzy"
@@ -26,21 +26,17 @@
 
 impl Format {
     /// Every format CASIMIR can read, in preference order.
     pub const ALL: [Self; 3] = [Self::Yaml, Self::Json, Self::Toml];
 
     /// Returns the canonical lowercase label.
     #[must_use]
     pub const fn label(self) -> &'static str {
-        match self {
-            Self::Yaml => "yaml",
-            Self::Json => "json",
-            Self::Toml => "toml",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// The file extensions conventionally associated with this format.
     #[must_use]
     pub const fn extensions(self) -> &'static [&'static str] {
         match self {
             Self::Yaml => &["yaml", "yml"],
             Self::Json => &["json"],

---- format::tests::every_format_renders_its_own_label stdout ----

thread 'format::tests::every_format_renders_its_own_label' (2279064) panicked at crates/casm-parser/src/format.rs:169:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "yaml"

failures:
    format::tests::every_format_renders_its_own_label

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
