*** crates/casm-parser/src/format.rs:75:61: replace && with || in Format::sniff

*** mutation diff:
--- crates/casm-parser/src/format.rs
+++ replace && with || in Format::sniff
@@ -67,17 +67,17 @@
     /// document whose shape is ambiguous between YAML and TOML is called YAML, because
     /// YAML is the authoring default and produces the more familiar error messages.
     #[must_use]
     pub fn sniff(source: &str) -> Self {
         let Some(first) = Self::first_meaningful_line(source) else {
             return Self::Yaml;
         };
 
-        if first.starts_with('{') || first.starts_with('[') && first.ends_with(',') {
+        if first.starts_with('{') || first.starts_with('[') || /* ~ changed by cargo-mutants ~ */ first.ends_with(',') {
             return Self::Json;
         }
 
         // A TOML table header (`[section]`) is unambiguous; a YAML sequence entry
         // (`- item`) and a mapping (`key: value`) are not TOML at all.
         if first.starts_with('[') && first.ends_with(']') {
             return Self::Toml;
         }

---- format::tests::a_table_header_needs_both_brackets_to_be_toml stdout ----

thread 'format::tests::a_table_header_needs_both_brackets_to_be_toml' (2281162) panicked at crates/casm-parser/src/format.rs:191:9:
assertion `left == right` failed
  left: Json
 right: Toml

---- format::tests::sniff_detects_toml_by_a_table_header stdout ----

thread 'format::tests::sniff_detects_toml_by_a_table_header' (2281170) panicked at crates/casm-parser/src/format.rs:205:9:
assertion `left == right` failed
  left: Json
 right: Toml

failures:
    format::tests::a_table_header_needs_both_brackets_to_be_toml
    format::tests::sniff_detects_toml_by_a_table_header

test result: FAILED. 94 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.70s

*** result: Failure(101)
