*** crates/casm-parser/src/lib.rs:132:23: replace > with >= in parse_file

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace > with >= in parse_file
@@ -124,17 +124,17 @@
 /// - Otherwise as [`parse_str`].
 pub fn parse_file(path: &Path) -> Result<Architecture> {
     let metadata = std::fs::metadata(path).map_err(|error| ParseError::Io {
         path: path.to_path_buf(),
         message: error.to_string(),
     })?;
 
     // Rule 5: check the bound before allocating, not after.
-    if metadata.len() > MAX_DOCUMENT_BYTES {
+    if metadata.len() >= /* ~ changed by cargo-mutants ~ */ MAX_DOCUMENT_BYTES {
         return Err(ParseError::TooLarge {
             path: path.to_path_buf(),
             size: metadata.len(),
             limit: MAX_DOCUMENT_BYTES,
         });
     }
 
     let source = std::fs::read_to_string(path).map_err(|error| ParseError::Io {

---- tests::a_file_at_the_ceiling_is_read_and_one_past_it_is_refused stdout ----

thread 'tests::a_file_at_the_ceiling_is_read_and_one_past_it_is_refused' (2258901) panicked at crates/casm-parser/src/lib.rs:411:9:
a file exactly at the ceiling is within it

failures:
    tests::a_file_at_the_ceiling_is_read_and_one_past_it_is_refused

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.20s

*** result: Failure(101)
