*** crates/casm-parser/src/lib.rs:154:5: replace emit_str -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace emit_str -> Result<String> with Ok("xyzzy".into())
@@ -146,17 +146,17 @@
 }
 
 /// Serialises an architecture back into authoring form.
 ///
 /// # Errors
 ///
 /// Returns [`ParseError::Emit`] if the underlying serialiser fails.
 pub fn emit_str(architecture: &Architecture, format: Format) -> Result<String> {
-    serialize(&Document::from_architecture(architecture), format)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders an authoring document in `format`.
 fn serialize<T: serde::Serialize>(document: &T, format: Format) -> Result<String> {
     match format {
         Format::Yaml => serde_yaml_ng::to_string(document).map_err(|error| ParseError::Emit {
             format: "yaml",
             message: error.to_string(),

---- tests::emitted_json_ends_with_a_newline stdout ----

thread 'tests::emitted_json_ends_with_a_newline' (2261299) panicked at crates/casm-parser/src/lib.rs:599:9:
POSIX text files end with a newline

---- tests::emitted_yaml_reparses_to_an_equal_architecture stdout ----

thread 'tests::emitted_yaml_reparses_to_an_equal_architecture' (2261300) panicked at crates/casm-parser/src/lib.rs:592:51:
called `Result::unwrap()` on an `Err` value: Syntax { path: "architecture.yaml", location: Location { line: 1, column: 1 }, message: "invalid type: string \"xyzzy\", expected struct Document", suggestion: None }

---- tests::parses_the_equivalent_json_document stdout ----

thread 'tests::parses_the_equivalent_json_document' (2261308) panicked at crates/casm-parser/src/lib.rs:317:67:
called `Result::unwrap()` on an `Err` value: Syntax { path: "a.json", location: Location { line: 1, column: 1 }, message: "expected value at line 1 column 1", suggestion: None }

failures:
    tests::emitted_json_ends_with_a_newline
    tests::emitted_yaml_reparses_to_an_equal_architecture
    tests::parses_the_equivalent_json_document
    tests::parses_the_equivalent_toml_document

test result: FAILED. 92 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.67s

*** result: Failure(101)
