*** crates/casm-parser/src/lib.rs:159:5: replace serialize -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace serialize -> Result<String> with Ok("xyzzy".into())
@@ -151,35 +151,17 @@
 ///
 /// Returns [`ParseError::Emit`] if the underlying serialiser fails.
 pub fn emit_str(architecture: &Architecture, format: Format) -> Result<String> {
     serialize(&Document::from_architecture(architecture), format)
 }
 
 /// Renders an authoring document in `format`.
 fn serialize<T: serde::Serialize>(document: &T, format: Format) -> Result<String> {
-    match format {
-        Format::Yaml => serde_yaml_ng::to_string(document).map_err(|error| ParseError::Emit {
-            format: "yaml",
-            message: error.to_string(),
-        }),
-        Format::Json => serde_json::to_string_pretty(document)
-            .map(|mut json| {
-                json.push('\n');
-                json
-            })
-            .map_err(|error| ParseError::Emit {
-                format: "json",
-                message: error.to_string(),
-            }),
-        Format::Toml => toml::to_string_pretty(document).map_err(|error| ParseError::Emit {
-            format: "toml",
-            message: error.to_string(),
-        }),
-    }
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Stage 1: bytes to [`Document`], with format-specific error positioning.
 fn deserialize(source: &str, path: &Path, format: Format) -> Result<Document> {
     deserialize_as(source, path, format)
 }
 
 /// Stage 1 for any authoring grammar: an architecture [`Document`] or a

---- library::tests::a_pattern_round_trips_through_every_format stdout ----

thread 'library::tests::a_pattern_round_trips_through_every_format' (2262059) panicked at crates/casm-parser/src/library.rs:540:18:
called `Result::unwrap()` on an `Err` value: Syntax { path: "secure-web-tier.yaml", location: Location { line: 1, column: 1 }, message: "invalid type: string \"xyzzy\", expected struct PatternDoc", suggestion: None }

---- tests::emitted_yaml_reparses_to_an_equal_architecture stdout ----

thread 'tests::emitted_yaml_reparses_to_an_equal_architecture' (2262095) panicked at crates/casm-parser/src/lib.rs:574:51:
called `Result::unwrap()` on an `Err` value: Syntax { path: "architecture.yaml", location: Location { line: 1, column: 1 }, message: "invalid type: string \"xyzzy\", expected struct Document", suggestion: None }

---- tests::emitted_json_ends_with_a_newline stdout ----

thread 'tests::emitted_json_ends_with_a_newline' (2262093) panicked at crates/casm-parser/src/lib.rs:581:9:
POSIX text files end with a newline

failures:
    library::tests::a_pattern_round_trips_through_every_format
    tests::emitted_json_ends_with_a_newline
    tests::emitted_yaml_reparses_to_an_equal_architecture
    tests::parses_the_equivalent_json_document
    tests::parses_the_equivalent_toml_document

test result: FAILED. 91 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.82s

*** result: Failure(101)
