*** crates/casm-parser/src/lib.rs:235:45: replace && with || in infer_suggestion

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace && with || in infer_suggestion
@@ -227,17 +227,17 @@
 }
 
 /// Extracts a "did you mean" hint from a serde "unknown variant/field" message.
 ///
 /// `serde` already names both the offending token and the permitted set, in backticks;
 /// all that is missing is picking the nearest one. This turns a wall of twelve valid
 /// variants into a single actionable line.
 fn infer_suggestion(message: &str) -> Option<String> {
-    if !message.contains("unknown variant") && !message.contains("unknown field") {
+    if !message.contains("unknown variant") || /* ~ changed by cargo-mutants ~ */ !message.contains("unknown field") {
         return None;
     }
 
     let quoted: Vec<&str> = message
         .split('`')
         .skip(1)
         .step_by(2)
         .filter(|token| !token.is_empty())

---- tests::an_unknown_field_suggests_the_nearest_valid_one stdout ----

thread 'tests::an_unknown_field_suggests_the_nearest_valid_one' (2265621) panicked at crates/casm-parser/src/lib.rs:444:9:
assertion `left == right` failed: rendered: architecture.yaml:3:5: nodes[0]: unknown field `nmae`, expected one of `name`, `type`, `id`, `description`, `interfaces`, `controls`, `metadata` at line 3 column 5
  left: None
 right: Some("did you mean `name`?")

---- tests::an_unknown_node_type_suggests_the_nearest_valid_one stdout ----

thread 'tests::an_unknown_node_type_suggests_the_nearest_valid_one' (2265622) panicked at crates/casm-parser/src/lib.rs:432:9:
assertion `left == right` failed: rendered: architecture.yaml:4:11: nodes[0].type: unknown variant `srvice`, expected one of `service`, `database`, `queue`, `cache`, `gateway`, `storage`, `external-system`, `legacy`, `human`, `boundary` at line 4 column 11
  left: None
 right: Some("did you mean `service`?")

failures:
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 94 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
