*** crates/casm-parser/src/lib.rs:259:47: replace + with - in offset_to_location

*** mutation diff:
--- crates/casm-parser/src/lib.rs
+++ replace + with - in offset_to_location
@@ -251,17 +251,17 @@
     suggest::closest(offender, expected.iter().copied()).map(suggest::did_you_mean)
 }
 
 /// Converts a byte offset into a 1-indexed line and column.
 ///
 /// Used for TOML, whose errors carry a span rather than a position.
 fn offset_to_location(source: &str, offset: usize) -> Location {
     let consumed = source.get(..offset).unwrap_or(source);
-    let line = consumed.matches('\n').count() + 1;
+    let line = consumed.matches('\n').count() - /* ~ changed by cargo-mutants ~ */ 1;
     let column = consumed
         .rsplit_once('\n')
         .map_or(consumed.len(), |(_, tail)| tail.len())
         + 1;
     Location::new(line, column)
 }
 
 #[cfg(test)]

---- tests::offset_conversion_matches_hand_counted_positions stdout ----

thread 'tests::offset_conversion_matches_hand_counted_positions' (2267657) panicked at crates/casm-parser/src/lib.rs:259:16:
attempt to subtract with overflow

---- tests::offset_conversion_tolerates_an_out_of_range_offset stdout ----

thread 'tests::offset_conversion_tolerates_an_out_of_range_offset' (2267658) panicked at crates/casm-parser/src/lib.rs:259:16:
attempt to subtract with overflow

---- tests::toml_syntax_errors_carry_a_position stdout ----

thread 'tests::toml_syntax_errors_carry_a_position' (2267669) panicked at crates/casm-parser/src/lib.rs:533:52:
assertion `left == right` failed: 1:6
  left: 1
 right: 2

failures:
    tests::offset_conversion_matches_hand_counted_positions
    tests::offset_conversion_tolerates_an_out_of_range_offset
    tests::toml_syntax_errors_carry_a_position

test result: FAILED. 93 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
