*** crates/casm-parser/src/library.rs:264:5: replace role_hint -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace role_hint -> Option<String> with Some(String::new())
@@ -256,21 +256,17 @@
     }
 }
 
 /// Suggests the intended role when a relationship names one that does not exist.
 fn role_hint(
     error: &casm_core::error::PatternError,
     declared: &[RequirementDoc],
 ) -> Option<String> {
-    let casm_core::error::PatternError::UnknownRole { role, .. } = error else {
-        return None;
-    };
-
-    suggest::closest(role, declared.iter().map(|doc| doc.role.as_str())).map(suggest::did_you_mean)
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parses a pattern from an in-memory document.
 ///
 /// # Errors
 ///
 /// - [`ParseError::Syntax`] if the document is malformed, with line and column.
 /// - [`ParseError::Semantic`] if a value violates a pattern invariant.

---- library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint stdout ----

thread 'library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint' (2289804) panicked at crates/casm-parser/src/library.rs:565:17:
assertion `left == right` failed
  left: Some("")
 right: Some("did you mean `application`?")

failures:
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.67s

*** result: Failure(101)
