*** crates/casm-parser/src/library.rs:355:9: replace Library::load -> Result<Self, ParseError> with Ok(Default::default())

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::load -> Result<Self, ParseError> with Ok(Default::default())
@@ -347,49 +347,17 @@
     ///
     /// # Errors
     ///
     /// - [`ParseError::Io`] if the directory cannot be read, or if a pattern file cannot.
     /// - [`ParseError::Syntax`] or [`ParseError::Semantic`] for a malformed pattern.
     /// - [`ParseError::TooManyPatterns`] if the directory holds more than
     ///   [`MAX_LIBRARY_PATTERNS`] pattern files.
     pub fn load(directory: &Path) -> Result<Self, ParseError> {
-        let entries = std::fs::read_dir(directory).map_err(|error| ParseError::Io {
-            path: directory.to_path_buf(),
-            message: error.to_string(),
-        })?;
-
-        // Sorted, so that a duplicate-definition error names the same file every run.
-        let mut files: Vec<PathBuf> = Vec::new();
-        for entry in entries {
-            let entry = entry.map_err(|error| ParseError::Io {
-                path: directory.to_path_buf(),
-                message: error.to_string(),
-            })?;
-            let path = entry.path();
-            if path.is_file() && Format::from_path(&path).is_some() {
-                files.push(path);
-            }
-        }
-        files.sort();
-
-        if files.len() > MAX_LIBRARY_PATTERNS {
-            return Err(ParseError::TooManyPatterns {
-                path: directory.to_path_buf(),
-                count: files.len(),
-                limit: MAX_LIBRARY_PATTERNS,
-            });
-        }
-
-        let mut library = Self::new();
-        for file in files {
-            let pattern = parse_pattern_file(&file)?;
-            library.insert(pattern, file)?;
-        }
-        Ok(library)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Adds a pattern, refusing a second definition of the same `name@version`.
     ///
     /// # Errors
     ///
     /// Returns [`ParseError::DuplicatePattern`] naming both files, because "which file
     /// wins" is a question no ordering answers defensibly.

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (2293996) panicked at crates/casm-parser/src/library.rs:669:9:
assertion `left == right` failed
  left: 0
 right: 2

---- library::tests::a_library_refuses_two_definitions_of_the_same_reference stdout ----

thread 'library::tests::a_library_refuses_two_definitions_of_the_same_reference' (2293997) panicked at crates/casm-parser/src/library.rs:698:47:
called `Result::unwrap_err()` on an `Ok` value: Library { patterns: [] }

---- library::tests::a_missing_directory_reports_the_path_it_tried stdout ----

thread 'library::tests::a_missing_directory_reports_the_path_it_tried' (2293999) panicked at crates/casm-parser/src/library.rs:726:71:
called `Result::unwrap_err()` on an `Ok` value: Library { patterns: [] }

failures:
    library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::a_library_refuses_two_definitions_of_the_same_reference
    library::tests::a_library_skips_files_that_are_not_architecture_formats
    library::tests::a_missing_directory_reports_the_path_it_tried
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 87 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
