*** crates/casm-parser/src/library.rs:374:24: replace > with == in Library::load

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace > with == in Library::load
@@ -366,17 +366,17 @@
             })?;
             let path = entry.path();
             if path.is_file() && Format::from_path(&path).is_some() {
                 files.push(path);
             }
         }
         files.sort();
 
-        if files.len() > MAX_LIBRARY_PATTERNS {
+        if files.len() == /* ~ changed by cargo-mutants ~ */ MAX_LIBRARY_PATTERNS {
             return Err(ParseError::TooManyPatterns {
                 path: directory.to_path_buf(),
                 count: files.len(),
                 limit: MAX_LIBRARY_PATTERNS,
             });
         }
 
         let mut library = Self::new();

---- library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not stdout ----

thread 'library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not' (2295615) panicked at crates/casm-parser/src/library.rs:660:9:
assertion `left == right` failed: a library exactly at the ceiling is within it
  left: None
 right: Some(1024)

failures:
    library::tests::a_library_at_the_pattern_ceiling_loads_and_one_past_it_does_not

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
