*** crates/casm-parser/src/library.rs:430:9: replace Library::is_empty -> bool with true

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::is_empty -> bool with true
@@ -422,17 +422,17 @@
     pub fn len(&self) -> usize {
         self.patterns.len()
     }
 
     /// Returns `true` if the library holds no patterns.
     #[inline]
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.patterns.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves a reference to the pattern it names.
     #[must_use]
     pub fn get(&self, reference: &PatternRef) -> Option<&Pattern> {
         self.patterns
             .iter()
             .find(|(pattern, _)| reference.matches(pattern))

---- library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not stdout ----

thread 'library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not' (2299211) panicked at crates/casm-parser/src/library.rs:688:9:
assertion failed: !library.is_empty()

failures:
    library::tests::an_empty_library_reports_itself_as_empty_and_a_loaded_one_does_not

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
