*** crates/casm-parser/src/library.rs:436:9: replace Library::get -> Option<&Pattern> with None

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::get -> Option<&Pattern> with None
@@ -428,20 +428,17 @@
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.patterns.is_empty()
     }
 
     /// Resolves a reference to the pattern it names.
     #[must_use]
     pub fn get(&self, reference: &PatternRef) -> Option<&Pattern> {
-        self.patterns
-            .iter()
-            .find(|(pattern, _)| reference.matches(pattern))
-            .map(|(pattern, _)| pattern)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The file a pattern was loaded from, if it came from one.
     #[must_use]
     pub fn source_of(&self, reference: &PatternRef) -> Option<&Path> {
         self.patterns
             .iter()
             .find(|(pattern, _)| reference.matches(pattern))

---- library::tests::a_library_loads_every_pattern_file_in_a_directory stdout ----

thread 'library::tests::a_library_loads_every_pattern_file_in_a_directory' (2300329) panicked at crates/casm-parser/src/library.rs:700:9:
assertion failed: library.get(&reference).is_some()

---- library::tests::two_versions_of_one_pattern_coexist stdout ----

thread 'library::tests::two_versions_of_one_pattern_coexist' (2300344) panicked at crates/casm-parser/src/library.rs:746:9:
assertion failed: library.get(&PatternRef::parse("p@2.0.0").unwrap()).is_some()

failures:
    library::tests::a_library_loads_every_pattern_file_in_a_directory
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 94 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.66s

*** result: Failure(101)
