*** crates/casm-parser/src/library.rs:453:9: replace Library::versions_of -> impl Iterator<Item =&'a Pattern> with ::std::iter::empty()

*** mutation diff:
--- crates/casm-parser/src/library.rs
+++ replace Library::versions_of -> impl Iterator<Item =&'a Pattern> with ::std::iter::empty()
@@ -445,18 +445,17 @@
         self.patterns
             .iter()
             .find(|(pattern, _)| reference.matches(pattern))
             .map(|(_, path)| path.as_path())
     }
 
     /// Every version of `name` the library holds, in load order.
     pub fn versions_of<'a>(&'a self, name: &'a str) -> impl Iterator<Item = &'a Pattern> {
-        self.patterns()
-            .filter(move |pattern| pattern.name().as_str() == name)
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The nearest reference to `wanted`, for a "did you mean" hint.
     ///
     /// Nearest by name rather than by version: an author who wrote the wrong version
     /// number is better served by being shown the versions that exist.
     #[must_use]
     pub fn closest(&self, wanted: &PatternRef) -> Option<String> {

---- library::tests::two_versions_of_one_pattern_coexist stdout ----

thread 'library::tests::two_versions_of_one_pattern_coexist' (2301195) panicked at crates/casm-parser/src/library.rs:747:9:
assertion `left == right` failed
  left: 0
 right: 2

---- library::tests::a_wrong_version_is_answered_with_the_versions_that_exist stdout ----

thread 'library::tests::a_wrong_version_is_answered_with_the_versions_that_exist' (2301191) panicked at crates/casm-parser/src/library.rs:772:9:
did you mean `p`?

failures:
    library::tests::a_wrong_version_is_answered_with_the_versions_that_exist
    library::tests::two_versions_of_one_pattern_coexist

test result: FAILED. 94 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.99s

*** result: Failure(101)
