*** crates/casm-parser/src/suggest.rs:100:41: replace match guard distance < best_distance with false in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace match guard distance < best_distance with false in closest
@@ -92,17 +92,17 @@
 
     let mut best: Option<(&'a str, usize)> = None;
     let mut tied = false;
 
     for candidate in candidates {
         let distance = edit_distance(input, candidate);
 
         match best {
-            Some((_, best_distance)) if distance < best_distance => {
+            Some((_, best_distance)) if false /* ~ changed by cargo-mutants ~ */ => {
                 best = Some((candidate, distance));
                 tied = false;
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (2311541) panicked at crates/casm-parser/src/document.rs:838:17:
assertion `left == right` failed
  left: None
 right: Some("did you mean `orders-db`?")

failures:
    document::tests::an_unresolvable_endpoint_reports_which_end_failed

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
