*** crates/casm-parser/src/suggest.rs:104:50: replace == with != in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace == with != in closest
@@ -96,17 +96,17 @@
     for candidate in candidates {
         let distance = edit_distance(input, candidate);
 
         match best {
             Some((_, best_distance)) if distance < best_distance => {
                 best = Some((candidate, distance));
                 tied = false;
             }
-            Some((_, best_distance)) if distance == best_distance => tied = true,
+            Some((_, best_distance)) if distance != /* ~ changed by cargo-mutants ~ */ best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }
 
     match best {
         Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
             Some(candidate)

---- suggest::tests::closest_accepts_an_exact_match stdout ----

thread 'suggest::tests::closest_accepts_an_exact_match' (2314632) panicked at crates/casm-parser/src/suggest.rs:260:9:
assertion `left == right` failed
  left: None
 right: Some("api")

---- suggest::tests::closest_declines_on_a_tie stdout ----

thread 'suggest::tests::closest_declines_on_a_tie' (2314633) panicked at crates/casm-parser/src/suggest.rs:240:9:
assertion `left == right` failed
  left: Some("abc")
 right: None

---- suggest::tests::closest_finds_an_obvious_typo stdout ----

thread 'suggest::tests::closest_finds_an_obvious_typo' (2314635) panicked at crates/casm-parser/src/suggest.rs:202:9:
assertion `left == right` failed
  left: None
 right: Some("orders-db")

failures:
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_declines_on_a_tie
    suggest::tests::closest_finds_an_obvious_typo
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 90 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.69s

*** result: Failure(101)
