*** crates/casm-parser/src/suggest.rs:111:75: replace && with || in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace && with || in closest
@@ -103,17 +103,17 @@
             }
             Some((_, best_distance)) if distance == best_distance => tied = true,
             Some(_) => {}
             None => best = Some((candidate, distance)),
         }
     }
 
     match best {
-        Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
+        Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE || /* ~ changed by cargo-mutants ~ */ !tied => {
             Some(candidate)
         }
         _ => None,
     }
 }
 
 /// Formats a "did you mean" hint for a misspelled reference.
 #[must_use]

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (2315576) panicked at crates/casm-parser/src/document.rs:850:67:
assertion `left == right` failed
  left: Some("did you mean `orders-db`?")
 right: None

---- suggest::tests::closest_declines_on_a_tie stdout ----

thread 'suggest::tests::closest_declines_on_a_tie' (2315677) panicked at crates/casm-parser/src/suggest.rs:240:9:
assertion `left == right` failed
  left: Some("abc")
 right: None

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    suggest::tests::closest_declines_on_a_tie

test result: FAILED. 94 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.72s

*** result: Failure(101)
