*** crates/casm-parser/src/suggest.rs:121:5: replace did_you_mean -> String with String::new()

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace did_you_mean -> String with String::new()
@@ -113,17 +113,17 @@
         }
         _ => None,
     }
 }
 
 /// Formats a "did you mean" hint for a misspelled reference.
 #[must_use]
 pub fn did_you_mean(candidate: &str) -> String {
-    format!("did you mean `{candidate}`?")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,
     clippy::indexing_slicing

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (2317631) panicked at crates/casm-parser/src/document.rs:838:17:
assertion `left == right` failed
  left: Some("")
 right: Some("did you mean `orders-db`?")

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (2317687) panicked at crates/casm-parser/src/library.rs:784:9:
assertion `left == right` failed
  left: ""
 right: "did you mean `secure-web-tier`?"

---- library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint stdout ----

thread 'library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint' (2317700) panicked at crates/casm-parser/src/library.rs:569:17:
assertion `left == right` failed
  left: Some("")
 right: Some("did you mean `application`?")

failures:
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    suggest::tests::hint_is_formatted_for_a_terminal
    tests::a_typo_in_a_relationship_endpoint_suggests_the_nearest_node
    tests::an_unknown_field_suggests_the_nearest_valid_one
    tests::an_unknown_node_type_suggests_the_nearest_valid_one

test result: FAILED. 89 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
