*** crates/casm-parser/src/suggest.rs:52:24: replace + with - in edit_distance

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace + with - in edit_distance
@@ -44,17 +44,17 @@
     for (i, left_char) in left.iter().enumerate() {
         if let Some(slot) = current.first_mut() {
             *slot = i + 1;
         }
 
         for (j, right_char) in right.iter().enumerate() {
             let substitution_cost = usize::from(left_char != right_char);
             let deletion = previous
-                .get(j + 1)
+                .get(j - /* ~ changed by cargo-mutants ~ */ 1)
                 .copied()
                 .unwrap_or(usize::MAX)
                 .saturating_add(1);
             let insertion = current
                 .get(j)
                 .copied()
                 .unwrap_or(usize::MAX)
                 .saturating_add(1);

---- document::tests::an_identifier_that_is_well_formed_but_undeclared_is_unresolvable stdout ----

thread 'document::tests::an_identifier_that_is_well_formed_but_undeclared_is_unresolvable' (2306981) panicked at crates/casm-parser/src/suggest.rs:52:22:
attempt to subtract with overflow

---- document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so stdout ----

thread 'document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so' (2306977) panicked at crates/casm-parser/src/suggest.rs:52:22:
attempt to subtract with overflow

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (2306983) panicked at crates/casm-parser/src/suggest.rs:52:22:
attempt to subtract with overflow

failures:
    document::tests::a_binding_resolves_to_the_node_it_names_or_fails_saying_so
    document::tests::an_identifier_that_is_well_formed_but_undeclared_is_unresolvable
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    library::tests::an_unknown_field_is_rejected_rather_than_silently_ignored
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_declines_on_a_tie
    suggest::tests::closest_declines_when_nothing_is_near
    suggest::tests::closest_finds_an_obvious_typo
    suggest::tests::distance_accumulates_edits_rather_than_multiplying_them

test result: FAILED. 73 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
