*** crates/casm-parser/src/suggest.rs:89:20: replace > with == in closest

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace > with == in closest
@@ -81,17 +81,17 @@
 /// [`MAX_PLAUSIBLE_DISTANCE`], or when two candidates tie — an ambiguous suggestion
 /// misleads more than it helps.
 #[must_use]
 pub fn closest<'a, I>(input: &str, candidates: I) -> Option<&'a str>
 where
     I: IntoIterator<Item = &'a str>,
 {
     // Rule 4: bound the work regardless of what the document contains.
-    if input.len() > MAX_NAME_LEN {
+    if input.len() == /* ~ changed by cargo-mutants ~ */ MAX_NAME_LEN {
         return None;
     }
 
     let mut best: Option<(&'a str, usize)> = None;
     let mut tied = false;
 
     for candidate in candidates {
         let distance = edit_distance(input, candidate);

---- suggest::tests::the_suggestion_threshold_is_a_strict_comparison stdout ----

thread 'suggest::tests::the_suggestion_threshold_is_a_strict_comparison' (2309679) panicked at crates/casm-parser/src/suggest.rs:213:9:
assertion `left == right` failed: a name exactly at the ceiling is still worth a suggestion
  left: None
 right: Some("aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa")

failures:
    suggest::tests::the_suggestion_threshold_is_a_strict_comparison

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
