*** crates/casm-parser/src/suggest.rs:89:5: replace closest -> Option<&'a str> with Some("xyzzy")

*** mutation diff:
--- crates/casm-parser/src/suggest.rs
+++ replace closest -> Option<&'a str> with Some("xyzzy")
@@ -81,43 +81,17 @@
 /// [`MAX_PLAUSIBLE_DISTANCE`], or when two candidates tie — an ambiguous suggestion
 /// misleads more than it helps.
 #[must_use]
 pub fn closest<'a, I>(input: &str, candidates: I) -> Option<&'a str>
 where
     I: IntoIterator<Item = &'a str>,
 {
     // Rule 4: bound the work regardless of what the document contains.
-    if input.len() > MAX_NAME_LEN {
-        return None;
-    }
-
-    let mut best: Option<(&'a str, usize)> = None;
-    let mut tied = false;
-
-    for candidate in candidates {
-        let distance = edit_distance(input, candidate);
-
-        match best {
-            Some((_, best_distance)) if distance < best_distance => {
-                best = Some((candidate, distance));
-                tied = false;
-            }
-            Some((_, best_distance)) if distance == best_distance => tied = true,
-            Some(_) => {}
-            None => best = Some((candidate, distance)),
-        }
-    }
-
-    match best {
-        Some((candidate, distance)) if distance <= MAX_PLAUSIBLE_DISTANCE && !tied => {
-            Some(candidate)
-        }
-        _ => None,
-    }
+    Some("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 /// Formats a "did you mean" hint for a misspelled reference.
 #[must_use]
 pub fn did_you_mean(candidate: &str) -> String {
     format!("did you mean `{candidate}`?")
 }

---- document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close stdout ----

thread 'document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close' (2309411) panicked at crates/casm-parser/src/document.rs:850:67:
assertion `left == right` failed
  left: Some("did you mean `xyzzy`?")
 right: None

---- document::tests::an_unresolvable_endpoint_reports_which_end_failed stdout ----

thread 'document::tests::an_unresolvable_endpoint_reports_which_end_failed' (2309412) panicked at crates/casm-parser/src/document.rs:838:17:
assertion `left == right` failed
  left: Some("did you mean `xyzzy`?")
 right: Some("did you mean `orders-db`?")

---- library::tests::a_misspelt_name_is_answered_with_the_nearest_one stdout ----

thread 'library::tests::a_misspelt_name_is_answered_with_the_nearest_one' (2309473) panicked at crates/casm-parser/src/library.rs:784:9:
assertion `left == right` failed
  left: "did you mean `xyzzy`?"
 right: "did you mean `secure-web-tier`?"

failures:
    document::tests::an_unresolvable_endpoint_omits_a_hint_when_nothing_is_close
    document::tests::an_unresolvable_endpoint_reports_which_end_failed
    library::tests::a_misspelt_name_is_answered_with_the_nearest_one
    library::tests::a_relationship_naming_an_undeclared_role_is_rejected_with_a_hint
    library::tests::an_empty_library_suggests_nothing
    suggest::tests::closest_accepts_an_exact_match
    suggest::tests::closest_declines_on_a_tie
    suggest::tests::closest_declines_when_nothing_is_near
    suggest::tests::closest_finds_an_obvious_typo
    suggest::tests::closest_handles_an_empty_candidate_set
    suggest::tests::closest_refuses_pathologically_long_input
    suggest::tests::the_suggestion_threshold_is_a_strict_comparison

test result: FAILED. 80 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
