*** crates/casm-validator/src/config.rs:91:49: replace == with != in ValidatorConfig::is_allowed

*** mutation diff:
--- crates/casm-validator/src/config.rs
+++ replace == with != in ValidatorConfig::is_allowed
@@ -83,17 +83,17 @@
             self.allow.push(rule_id);
         }
         self
     }
 
     /// Returns `true` if `rule_id` has been suppressed.
     #[must_use]
     pub fn is_allowed(&self, rule_id: &str) -> bool {
-        self.allow.iter().any(|allowed| allowed == rule_id)
+        self.allow.iter().any(|allowed| allowed != /* ~ changed by cargo-mutants ~ */ rule_id)
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- config::tests::suppression_is_by_exact_id stdout ----

thread 'config::tests::suppression_is_by_exact_id' (2022778) panicked at crates/casm-validator/src/config.rs:128:9:
assertion failed: config.is_allowed("no-isolated-nodes")

---- tests::suppressed_rules_do_not_fire stdout ----

thread 'tests::suppressed_rules_do_not_fire' (2022864) panicked at crates/casm-validator/src/lib.rs:307:9:
still reported:
warning[stateful-nodes-require-controls]: node 'db': is a database holding persistent state but declares no controls
  help: declare controls covering encryption at rest, backup and restore, and access restriction

failures:
    config::tests::suppression_is_by_exact_id
    tests::suppressed_rules_do_not_fire

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
