*** crates/casm-validator/src/diagnostic.rs:192:36: replace == with != in Report::count

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace == with != in Report::count
@@ -184,17 +184,17 @@
         }
     }
 
     /// Counts findings at a given severity.
     #[must_use]
     pub fn count(&self, severity: Severity) -> usize {
         self.diagnostics
             .iter()
-            .filter(|d| d.severity == severity)
+            .filter(|d| d.severity != /* ~ changed by cargo-mutants ~ */ severity)
             .count()
     }
 
     /// Returns `true` if any finding is an [`Severity::Error`].
     #[must_use]
     pub fn has_errors(&self) -> bool {
         self.diagnostics
             .iter()

---- diagnostic::tests::summary_counts_each_severity stdout ----

thread 'diagnostic::tests::summary_counts_each_severity' (2028079) panicked at crates/casm-validator/src/diagnostic.rs:473:9:
assertion `left == right` failed
  left: "1 error(s), 1 warning(s), 2 info"
 right: "1 error(s), 1 warning(s), 0 info"

---- diagnostic::tests::counts_and_filters_agree stdout ----

thread 'diagnostic::tests::counts_and_filters_agree' (2028065) panicked at crates/casm-validator/src/diagnostic.rs:395:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    diagnostic::tests::counts_and_filters_agree
    diagnostic::tests::summary_counts_each_severity

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
