*** crates/casm-validator/src/diagnostic.rs:209:33: replace == with != in Report::has_warnings

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace == with != in Report::has_warnings
@@ -201,17 +201,17 @@
             .any(|d| d.severity == Severity::Error)
     }
 
     /// Returns `true` if any finding is a [`Severity::Warning`].
     #[must_use]
     pub fn has_warnings(&self) -> bool {
         self.diagnostics
             .iter()
-            .any(|d| d.severity == Severity::Warning)
+            .any(|d| d.severity != /* ~ changed by cargo-mutants ~ */ Severity::Warning)
     }
 
     /// Returns `true` if nothing at all was found.
     #[must_use]
     pub fn is_clean(&self) -> bool {
         self.diagnostics.is_empty()
     }

---- diagnostic::tests::has_warnings_distinguishes_a_warning_from_every_other_severity stdout ----

thread 'diagnostic::tests::has_warnings_distinguishes_a_warning_from_every_other_severity' (2031118) panicked at crates/casm-validator/src/diagnostic.rs:353:9:
info is not a warning

failures:
    diagnostic::tests::has_warnings_distinguishes_a_warning_from_every_other_severity

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
