*** crates/casm-validator/src/diagnostic.rs:215:9: replace Report::is_clean -> bool with false

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::is_clean -> bool with false
@@ -207,17 +207,17 @@
         self.diagnostics
             .iter()
             .any(|d| d.severity == Severity::Warning)
     }
 
     /// Returns `true` if nothing at all was found.
     #[must_use]
     pub fn is_clean(&self) -> bool {
-        self.diagnostics.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns only the findings at a given severity.
     #[must_use]
     pub fn at(&self, severity: Severity) -> Vec<&Diagnostic> {
         self.diagnostics
             .iter()
             .filter(|d| d.severity == severity)

---- diagnostic::tests::an_empty_report_is_clean_and_exits_zero stdout ----

thread 'diagnostic::tests::an_empty_report_is_clean_and_exits_zero' (2031486) panicked at crates/casm-validator/src/diagnostic.rs:311:9:
assertion failed: report.is_clean()

---- diagnostic::tests::clean_summary_says_so_plainly stdout ----

thread 'diagnostic::tests::clean_summary_says_so_plainly' (2031487) panicked at crates/casm-validator/src/diagnostic.rs:462:9:
assertion `left == right` failed
  left: "0 error(s), 0 warning(s), 0 info"
 right: "architecture is valid: 0 errors, 0 warnings"

---- tests::an_empty_architecture_is_clean stdout ----

thread 'tests::an_empty_architecture_is_clean' (2031560) panicked at crates/casm-validator/src/lib.rs:278:9:
assertion failed: Validator::new().validate(&architecture).is_clean()

failures:
    diagnostic::tests::an_empty_report_is_clean_and_exits_zero
    diagnostic::tests::clean_summary_says_so_plainly
    tests::a_healthy_architecture_produces_a_clean_report
    tests::an_empty_architecture_is_clean
    tests::an_empty_validator_reports_nothing
    tests::suppressed_rules_do_not_fire

test result: FAILED. 81 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
