*** crates/casm-validator/src/diagnostic.rs:221:9: replace Report::at -> Vec<&Diagnostic> with vec![]

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::at -> Vec<&Diagnostic> with vec![]
@@ -213,20 +213,17 @@
     #[must_use]
     pub fn is_clean(&self) -> bool {
         self.diagnostics.is_empty()
     }
 
     /// Returns only the findings at a given severity.
     #[must_use]
     pub fn at(&self, severity: Severity) -> Vec<&Diagnostic> {
-        self.diagnostics
-            .iter()
-            .filter(|d| d.severity == severity)
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// The process exit code this report implies.
     ///
     /// `0` clean or informational, `1` warnings, `2` errors. Every CASIMIR surface —
     /// CLI, CI, pre-commit hook — derives its exit status from here, so they cannot
     /// drift apart.
     #[must_use]

---- diagnostic::tests::counts_and_filters_agree stdout ----

thread 'diagnostic::tests::counts_and_filters_agree' (2032374) panicked at crates/casm-validator/src/diagnostic.rs:395:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    diagnostic::tests::counts_and_filters_agree

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
