*** crates/casm-validator/src/diagnostic.rs:264:9: replace Report::summary -> String with String::new()

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Report::summary -> String with String::new()
@@ -256,25 +256,17 @@
             .map(Diagnostic::render)
             .collect::<Vec<_>>()
             .join("\n")
     }
 
     /// A one-line summary suitable for the last line of CI output.
     #[must_use]
     pub fn summary(&self) -> String {
-        if self.is_clean() {
-            return "architecture is valid: 0 errors, 0 warnings".to_owned();
-        }
-        format!(
-            "{} error(s), {} warning(s), {} info",
-            self.count(Severity::Error),
-            self.count(Severity::Warning),
-            self.count(Severity::Info)
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,
     clippy::expect_used,
     clippy::panic,

---- diagnostic::tests::clean_summary_says_so_plainly stdout ----

thread 'diagnostic::tests::clean_summary_says_so_plainly' (2035618) panicked at crates/casm-validator/src/diagnostic.rs:454:9:
assertion `left == right` failed
  left: ""
 right: "architecture is valid: 0 errors, 0 warnings"

---- diagnostic::tests::summary_counts_each_severity stdout ----

thread 'diagnostic::tests::summary_counts_each_severity' (2035641) panicked at crates/casm-validator/src/diagnostic.rs:465:9:
assertion `left == right` failed
  left: ""
 right: "1 error(s), 1 warning(s), 0 info"

failures:
    diagnostic::tests::clean_summary_says_so_plainly
    diagnostic::tests::summary_counts_each_severity

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
