*** crates/casm-validator/src/diagnostic.rs:34:9: replace Severity::label -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace Severity::label -> &'static str with ""
@@ -26,21 +26,17 @@
     /// A violation: the architecture is not fit to build against.
     Error,
 }
 
 impl Severity {
     /// Returns the canonical lowercase label.
     #[must_use]
     pub const fn label(self) -> &'static str {
-        match self {
-            Self::Info => "info",
-            Self::Warning => "warning",
-            Self::Error => "error",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// The SARIF 2.1.0 level string for this severity.
     #[must_use]
     pub const fn sarif_level(self) -> &'static str {
         match self {
             Self::Info => "note",
             Self::Warning => "warning",

---- diagnostic::tests::a_rendered_report_names_what_it_found stdout ----

thread 'diagnostic::tests::a_rendered_report_names_what_it_found' (2024546) panicked at crates/casm-validator/src/diagnostic.rs:375:9:
the severity: [test-rule]: architecture: something happened

---- diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity stdout ----

thread 'diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity' (2024554) panicked at crates/casm-validator/src/diagnostic.rs:424:9:
[test-rule]: architecture: something happened

failures:
    diagnostic::tests::a_rendered_report_names_what_it_found
    diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
