*** crates/casm-validator/src/diagnostic.rs:95:9: replace <impl core::fmt::Display for Subject>::fmt -> core::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/casm-validator/src/diagnostic.rs
+++ replace <impl core::fmt::Display for Subject>::fmt -> core::fmt::Result with Ok(Default::default())
@@ -87,25 +87,17 @@
     Pattern {
         /// The `name@version` reference, as claimed.
         reference: String,
     },
 }
 
 impl core::fmt::Display for Subject {
     fn fmt(&self, f: &mut core::fmt::Formatter<'_>) -> core::fmt::Result {
-        match self {
-            Self::Architecture => f.write_str("architecture"),
-            Self::Node { name, .. } => write!(f, "node '{name}'"),
-            Self::Relationship { source, target } => {
-                write!(f, "relationship '{source}' -> '{target}'")
-            }
-            Self::NodeSet { names } => write!(f, "nodes [{}]", names.join(", ")),
-            Self::Pattern { reference } => write!(f, "pattern '{reference}'"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A single validation finding.
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 pub struct Diagnostic {
     /// The stable identifier of the rule that produced this finding.
     ///

---- diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity stdout ----

thread 'diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity' (2026355) panicked at crates/casm-validator/src/diagnostic.rs:421:9:
error[test-rule]: : something happened

---- diagnostic::tests::subject_display_names_the_element stdout ----

thread 'diagnostic::tests::subject_display_names_the_element' (2026363) panicked at crates/casm-validator/src/diagnostic.rs:438:9:
assertion `left == right` failed
  left: ""
 right: "node 'api'"

failures:
    diagnostic::tests::diagnostic_render_includes_rule_subject_and_severity
    diagnostic::tests::subject_display_names_the_element

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
