*** crates/casm-validator/src/graph.rs:133:9: replace DependencyGraph::roots -> Vec<NodeId> with vec![Default::default()]

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::roots -> Vec<NodeId> with vec![Default::default()]
@@ -125,30 +125,17 @@
         }
 
         Some(longest.values().copied().max().unwrap_or(0))
     }
 
     /// Returns the nodes nothing depends on: the entry points of the architecture.
     #[must_use]
     pub fn roots(&self) -> Vec<NodeId> {
-        let mut roots: Vec<NodeId> = self
-            .graph
-            .node_indices()
-            .filter(|index| {
-                self.graph
-                    .neighbors_directed(*index, petgraph::Direction::Incoming)
-                    .next()
-                    .is_none()
-            })
-            .filter_map(|index| self.graph.node_weight(index))
-            .copied()
-            .collect();
-        roots.sort_unstable();
-        roots
+        vec![Default::default()] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the nodes that depend on nothing: the leaves of the architecture.
     #[must_use]
     pub fn leaves(&self) -> Vec<NodeId> {
         let mut leaves: Vec<NodeId> = self
             .graph
             .node_indices()

---- graph::tests::roots_and_leaves_are_identified stdout ----

thread 'graph::tests::roots_and_leaves_are_identified' (2043155) panicked at crates/casm-validator/src/graph.rs:442:9:
assertion `left == right` failed
  left: [""]
 right: ["a"]

failures:
    graph::tests::roots_and_leaves_are_identified

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
