*** crates/casm-validator/src/graph.rs:73:9: replace DependencyGraph::cycles -> Vec<Vec<NodeId>> with vec![]

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::cycles -> Vec<Vec<NodeId>> with vec![]
@@ -65,32 +65,17 @@
 
     /// Returns every set of nodes that mutually depend on each other.
     ///
     /// Each returned group has at least two members and is a genuine cycle. Node order
     /// within a group is sorted by `NodeId` — which, since ids are time-ordered, means
     /// declaration order — so output is deterministic (NASA Rule 8).
     #[must_use]
     pub fn cycles(&self) -> Vec<Vec<NodeId>> {
-        let mut cycles: Vec<Vec<NodeId>> = tarjan_scc(&self.graph)
-            .into_iter()
-            .filter(|component| component.len() > 1)
-            .map(|component| {
-                let mut ids: Vec<NodeId> = component
-                    .iter()
-                    .filter_map(|index| self.graph.node_weight(*index))
-                    .copied()
-                    .collect();
-                ids.sort_unstable();
-                ids
-            })
-            .collect();
-
-        cycles.sort();
-        cycles
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the blocking dependency structure is acyclic.
     #[must_use]
     pub fn is_acyclic(&self) -> bool {
         self.cycles().is_empty()
     }

---- graph::tests::a_blocking_cycle_is_detected stdout ----

thread 'graph::tests::a_blocking_cycle_is_detected' (2037323) panicked at crates/casm-validator/src/graph.rs:251:9:
assertion failed: !graph.is_acyclic()

---- rules::tests::a_diagnostic_names_the_nodes_it_is_about stdout ----

thread 'rules::tests::a_diagnostic_names_the_nodes_it_is_about' (2037345) panicked at crates/casm-validator/src/rules.rs:834:14:
the cycle is reported

---- rules::tests::a_dependency_cycle_is_an_error stdout ----

thread 'rules::tests::a_dependency_cycle_is_an_error' (2037344) panicked at crates/casm-validator/src/rules.rs:594:9:
assertion failed: report.has_errors()

failures:
    graph::tests::a_blocking_cycle_is_detected
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::a_diagnostic_names_the_nodes_it_is_about

test result: FAILED. 84 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
