*** crates/casm-validator/src/graph.rs:73:9: replace DependencyGraph::cycles -> Vec<Vec<NodeId>> with vec![vec![]]

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::cycles -> Vec<Vec<NodeId>> with vec![vec![]]
@@ -65,32 +65,17 @@
 
     /// Returns every set of nodes that mutually depend on each other.
     ///
     /// Each returned group has at least two members and is a genuine cycle. Node order
     /// within a group is sorted by `NodeId` — which, since ids are time-ordered, means
     /// declaration order — so output is deterministic (NASA Rule 8).
     #[must_use]
     pub fn cycles(&self) -> Vec<Vec<NodeId>> {
-        let mut cycles: Vec<Vec<NodeId>> = tarjan_scc(&self.graph)
-            .into_iter()
-            .filter(|component| component.len() > 1)
-            .map(|component| {
-                let mut ids: Vec<NodeId> = component
-                    .iter()
-                    .filter_map(|index| self.graph.node_weight(*index))
-                    .copied()
-                    .collect();
-                ids.sort_unstable();
-                ids
-            })
-            .collect();
-
-        cycles.sort();
-        cycles
+        vec![vec![]] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the blocking dependency structure is acyclic.
     #[must_use]
     pub fn is_acyclic(&self) -> bool {
         self.cycles().is_empty()
     }

---- graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle stdout ----

thread 'graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle' (2037880) panicked at crates/casm-validator/src/graph.rs:292:9:
assertion failed: DependencyGraph::build(&architecture).is_acyclic()

---- graph::tests::a_blocking_cycle_is_detected stdout ----

thread 'graph::tests::a_blocking_cycle_is_detected' (2037879) panicked at crates/casm-validator/src/graph.rs:253:9:
assertion `left == right` failed
  left: 0
 right: 3

---- graph::tests::an_acyclic_graph_reports_no_cycles stdout ----

thread 'graph::tests::an_acyclic_graph_reports_no_cycles' (2037882) panicked at crates/casm-validator/src/graph.rs:236:9:
assertion failed: graph.is_acyclic()

failures:
    graph::tests::a_blocking_cycle_is_detected
    graph::tests::a_mixed_cycle_with_one_blocking_edge_is_not_a_cycle
    graph::tests::an_acyclic_graph_reports_no_cycles
    graph::tests::an_async_loop_is_not_a_cycle
    graph::tests::an_event_driven_loop_is_not_a_cycle
    rules::tests::a_diagnostic_names_the_nodes_it_is_about
    tests::a_healthy_architecture_produces_a_clean_report
    tests::an_empty_architecture_is_clean
    tests::suppressed_rules_do_not_fire

test result: FAILED. 78 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
