*** crates/casm-validator/src/graph.rs:94:9: replace DependencyGraph::is_acyclic -> bool with true

*** mutation diff:
--- crates/casm-validator/src/graph.rs
+++ replace DependencyGraph::is_acyclic -> bool with true
@@ -86,17 +86,17 @@
 
         cycles.sort();
         cycles
     }
 
     /// Returns `true` if the blocking dependency structure is acyclic.
     #[must_use]
     pub fn is_acyclic(&self) -> bool {
-        self.cycles().is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Computes the highest total latency budget along any blocking path.
     ///
     /// This is the architecture's *critical path*: the arithmetic floor on end-to-end
     /// latency, assuming every hop consumes its whole budget. Comparing it against a
     /// target SLO answers "is this SLO achievable at all?" before anything is built.
     ///

---- graph::tests::a_blocking_cycle_is_detected stdout ----

thread 'graph::tests::a_blocking_cycle_is_detected' (2039475) panicked at crates/casm-validator/src/graph.rs:266:9:
assertion failed: !graph.is_acyclic()

failures:
    graph::tests::a_blocking_cycle_is_detected

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
