*** crates/casm-validator/src/lib.rs:112:9: replace Validator::with_rule -> Self with Default::default()

*** mutation diff:
--- crates/casm-validator/src/lib.rs
+++ replace Validator::with_rule -> Self with Default::default()
@@ -104,18 +104,17 @@
             rules: Vec::new(),
             patterns: Vec::new(),
         }
     }
 
     /// Adds a rule to this validator.
     #[must_use]
     pub fn with_rule(mut self, rule: Box<dyn Rule>) -> Self {
-        self.rules.push(rule);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Supplies the patterns that conformance claims are checked against.
     ///
     /// Loading them is the caller's job — `casm-validator` reads no files, and a
     /// validator handed no patterns still runs: a claim it cannot check is reported as
     /// unchecked rather than assumed true.
     #[must_use]

---- rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error stdout ----

thread 'rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error' (2023075) panicked at crates/casm-validator/src/rules.rs:1186:9:
  left: 3
 right: 1

---- rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied stdout ----

thread 'rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied' (2023074) panicked at crates/casm-validator/src/rules.rs:1207:9:
  left: 3
 right: 1

---- rules::tests::a_decision_and_an_edit_get_different_suggestions stdout ----

thread 'rules::tests::a_decision_and_an_edit_get_different_suggestions' (2023078) panicked at crates/casm-validator/src/rules.rs:1224:9:

failures:
    rules::tests::a_claim_naming_an_absent_version_lists_what_was_supplied
    rules::tests::a_claim_with_no_library_is_a_warning_rather_than_an_error
    rules::tests::a_decision_and_an_edit_get_different_suggestions
    rules::tests::a_satisfied_claim_produces_no_finding
    rules::tests::an_architecture_that_claims_nothing_is_never_touched_by_this_rule
    rules::tests::an_unsatisfied_claim_is_an_error_naming_the_pattern
    tests::a_custom_rule_can_be_added

test result: FAILED. 80 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
