*** crates/casm-validator/src/lib.rs:92:9: replace Validator::with_config -> Self with Default::default()

*** mutation diff:
--- crates/casm-validator/src/lib.rs
+++ replace Validator::with_config -> Self with Default::default()
@@ -84,21 +84,17 @@
     #[must_use]
     pub fn new() -> Self {
         Self::with_config(ValidatorConfig::default())
     }
 
     /// A validator with the built-in rule library and explicit thresholds.
     #[must_use]
     pub fn with_config(config: ValidatorConfig) -> Self {
-        Self {
-            config,
-            rules: rules::built_in(),
-            patterns: Vec::new(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// A validator with no rules at all, for building a custom set.
     #[must_use]
     pub fn empty(config: ValidatorConfig) -> Self {
         Self {
             config,
             rules: Vec::new(),

*** result: Failure(101)
