*** crates/casm-validator/src/rules.rs:124:9: replace <impl Rule for NoPubliclyExposedDatastores>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoPubliclyExposedDatastores>::id -> &'static str with ""
@@ -116,17 +116,17 @@
 
 /// A datastore must not be reachable directly from outside the control boundary.
 ///
 /// The canonical "no database on the public internet" rule.
 pub struct NoPubliclyExposedDatastores;
 
 impl Rule for NoPubliclyExposedDatastores {
     fn id(&self) -> &'static str {
-        "no-publicly-exposed-datastores"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "external systems and humans must not connect directly to a database, queue, or store"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for edge in context.architecture.relationships() {

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2049726) panicked at crates/casm-validator/src/rules.rs:895:36:
no rule with id "no-publicly-exposed-datastores"

---- rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract stdout ----

thread 'rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract' (2049727) panicked at crates/casm-validator/src/rules.rs:917:9:
assertion `left == right` failed: the identifiers and the order they are reported in are both a contract: SARIF output and `casm rules` are read by machines
  left: ["no-dependency-cycles", "", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces", "patterns-are-satisfied"]
 right: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-node

---- rules::tests::an_external_system_reaching_a_database_is_an_error stdout ----

thread 'rules::tests::an_external_system_reaching_a_database_is_an_error' (2049717) panicked at crates/casm-validator/src/rules.rs:621:9:
assertion failed: has(&architecture, "no-publicly-exposed-datastores")

failures:
    rules::tests::an_external_system_reaching_a_database_is_an_error
    rules::tests::every_rule_describes_itself_rather_than_something_else
    rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::the_default_validator_exposes_its_rule_set

test result: FAILED. 82 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
