*** crates/casm-validator/src/rules.rs:140:50: replace || with && in <impl Rule for NoPubliclyExposedDatastores>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace || with && in <impl Rule for NoPubliclyExposedDatastores>::check
@@ -132,17 +132,17 @@
         for edge in context.architecture.relationships() {
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {
                 continue;
             };
 
-            if !source.node_type().is_external() || !target.node_type().is_stateful() {
+            if !source.node_type().is_external() && /* ~ changed by cargo-mutants ~ */ !target.node_type().is_stateful() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Error,
                     Subject::Relationship {

---- rules::tests::a_service_fronting_the_database_clears_the_exposure_rule stdout ----

thread 'rules::tests::a_service_fronting_the_database_clears_the_exposure_rule' (2051461) panicked at crates/casm-validator/src/rules.rs:649:9:
assertion failed: !has(&architecture, "no-publicly-exposed-datastores")

---- tests::a_healthy_architecture_produces_a_clean_report stdout ----

thread 'tests::a_healthy_architecture_produces_a_clean_report' (2051597) panicked at crates/casm-validator/src/lib.rs:256:9:
unexpected findings:
error[no-publicly-exposed-datastores]: relationship 'orders' -> 'orders-db': 'orders' is outside the control boundary and connects directly to the database 'orders-db'
  help: route the access through a service or gateway that can enforce authentication, authorisation, and rate limiting

failures:
    rules::tests::a_service_fronting_the_database_clears_the_exposure_rule
    tests::a_healthy_architecture_produces_a_clean_report

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
