*** crates/casm-validator/src/rules.rs:140:53: delete ! in <impl Rule for NoPubliclyExposedDatastores>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for NoPubliclyExposedDatastores>::check
@@ -132,17 +132,17 @@
         for edge in context.architecture.relationships() {
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {
                 continue;
             };
 
-            if !source.node_type().is_external() || !target.node_type().is_stateful() {
+            if !source.node_type().is_external() ||  /* ~ changed by cargo-mutants ~ */target.node_type().is_stateful() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Error,
                     Subject::Relationship {

---- rules::tests::a_service_fronting_the_database_clears_the_exposure_rule stdout ----

thread 'rules::tests::a_service_fronting_the_database_clears_the_exposure_rule' (2053086) panicked at crates/casm-validator/src/rules.rs:649:9:
assertion failed: !has(&architecture, "no-publicly-exposed-datastores")

---- rules::tests::an_external_system_reaching_a_database_is_an_error stdout ----

thread 'rules::tests::an_external_system_reaching_a_database_is_an_error' (2053092) panicked at crates/casm-validator/src/rules.rs:620:9:
assertion failed: report.has_errors()

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (2053117) panicked at crates/casm-validator/src/lib.rs:424:9:
["services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

failures:
    rules::tests::a_service_fronting_the_database_clears_the_exposure_rule
    rules::tests::an_external_system_reaching_a_database_is_an_error
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 84 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
