*** crates/casm-validator/src/rules.rs:222:9: replace <impl Rule for StatefulNodesRequireControls>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for StatefulNodesRequireControls>::id -> &'static str with "xyzzy"
@@ -214,17 +214,17 @@
 /// Stateful nodes must declare at least one control.
 ///
 /// A database with no declared controls is a database nobody has thought about backing
 /// up, encrypting, or restricting.
 pub struct StatefulNodesRequireControls;
 
 impl Rule for StatefulNodesRequireControls {
     fn id(&self) -> &'static str {
-        "stateful-nodes-require-controls"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "nodes that hold state must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {

---- rules::tests::an_uncontrolled_database_warns stdout ----

thread 'rules::tests::an_uncontrolled_database_warns' (2056722) panicked at crates/casm-validator/src/rules.rs:707:9:
assertion failed: has(&architecture, "stateful-nodes-require-controls")

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2056727) panicked at crates/casm-validator/src/rules.rs:895:36:
no rule with id "stateful-nodes-require-controls"

---- rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract stdout ----

thread 'rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract' (2056728) panicked at crates/casm-validator/src/rules.rs:917:9:
assertion `left == right` failed: the identifiers and the order they are reported in are both a contract: SARIF output and `casm rules` are read by machines
  left: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "xyzzy", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces", "patterns-are-satisfied"]
 right: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-

failures:
    rules::tests::an_uncontrolled_database_warns
    rules::tests::every_rule_describes_itself_rather_than_something_else
    rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::reports_render_and_serialise_to_sarif
    tests::suppressed_rules_do_not_fire

test result: FAILED. 81 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
