*** crates/casm-validator/src/rules.rs:226:9: replace <impl Rule for StatefulNodesRequireControls>::description -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for StatefulNodesRequireControls>::description -> &'static str with "xyzzy"
@@ -218,17 +218,17 @@
 pub struct StatefulNodesRequireControls;
 
 impl Rule for StatefulNodesRequireControls {
     fn id(&self) -> &'static str {
         "stateful-nodes-require-controls"
     }
 
     fn description(&self) -> &'static str {
-        "nodes that hold state must declare at least one control"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
             if !node.node_type().is_stateful() || !node.controls().is_empty() {
                 continue;
             }

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2058366) panicked at crates/casm-validator/src/rules.rs:897:13:
stateful-nodes-require-controls: description "xyzzy" does not mention "state"

failures:
    rules::tests::every_rule_describes_itself_rather_than_something_else

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
