*** crates/casm-validator/src/rules.rs:230:9: replace <impl Rule for StatefulNodesRequireControls>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for StatefulNodesRequireControls>::check with ()
@@ -222,37 +222,17 @@
         "stateful-nodes-require-controls"
     }
 
     fn description(&self) -> &'static str {
         "nodes that hold state must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
-        for node in context.architecture.nodes() {
-            if !node.node_type().is_stateful() || !node.controls().is_empty() {
-                continue;
-            }
-
-            report.push(
-                Diagnostic::new(
-                    self.id(),
-                    Severity::Warning,
-                    RuleContext::subject(node),
-                    format!(
-                        "is a {} holding persistent state but declares no controls",
-                        node.node_type()
-                    ),
-                )
-                .with_suggestion(
-                    "declare controls covering encryption at rest, backup and restore, \
-                     and access restriction",
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The critical path's latency budget must stay within the configured ceiling.
 pub struct CriticalPathWithinBudget;
 
 impl Rule for CriticalPathWithinBudget {
     fn id(&self) -> &'static str {

---- rules::tests::an_uncontrolled_database_warns stdout ----

thread 'rules::tests::an_uncontrolled_database_warns' (2058489) panicked at crates/casm-validator/src/rules.rs:687:9:
assertion failed: has(&architecture, "stateful-nodes-require-controls")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (2058523) panicked at crates/casm-validator/src/lib.rs:428:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

---- tests::reports_render_and_serialise_to_sarif stdout ----

thread 'tests::reports_render_and_serialise_to_sarif' (2058550) panicked at crates/casm-validator/src/lib.rs:455:9:
assertion failed: !report.render().is_empty()

failures:
    rules::tests::an_uncontrolled_database_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once
    tests::reports_render_and_serialise_to_sarif
    tests::suppressed_rules_do_not_fire

test result: FAILED. 83 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
