*** crates/casm-validator/src/rules.rs:231:16: delete ! in <impl Rule for StatefulNodesRequireControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for StatefulNodesRequireControls>::check
@@ -223,17 +223,17 @@
     }
 
     fn description(&self) -> &'static str {
         "nodes that hold state must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for node in context.architecture.nodes() {
-            if !node.node_type().is_stateful() || !node.controls().is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */node.node_type().is_stateful() || !node.controls().is_empty() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,
                     RuleContext::subject(node),

---- rules::tests::a_stateless_service_does_not_trip_the_stateful_rule stdout ----

thread 'rules::tests::a_stateless_service_does_not_trip_the_stateful_rule' (2058264) panicked at crates/casm-validator/src/rules.rs:717:9:
assertion failed: !has(&architecture, "stateful-nodes-require-controls")

---- rules::tests::an_uncontrolled_database_warns stdout ----

thread 'rules::tests::an_uncontrolled_database_warns' (2058271) panicked at crates/casm-validator/src/rules.rs:707:9:
assertion failed: has(&architecture, "stateful-nodes-require-controls")

---- tests::reports_render_and_serialise_to_sarif stdout ----

thread 'tests::reports_render_and_serialise_to_sarif' (2058298) panicked at crates/casm-validator/src/lib.rs:455:9:
assertion failed: !report.render().is_empty()

failures:
    rules::tests::a_stateless_service_does_not_trip_the_stateful_rule
    rules::tests::an_uncontrolled_database_warns
    tests::reports_render_and_serialise_to_sarif
    tests::suppressed_rules_do_not_fire

test result: FAILED. 83 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
