*** crates/casm-validator/src/rules.rs:259:9: replace <impl Rule for CriticalPathWithinBudget>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for CriticalPathWithinBudget>::id -> &'static str with ""
@@ -251,17 +251,17 @@
     }
 }
 
 /// The critical path's latency budget must stay within the configured ceiling.
 pub struct CriticalPathWithinBudget;
 
 impl Rule for CriticalPathWithinBudget {
     fn id(&self) -> &'static str {
-        "critical-path-within-budget"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "the summed latency budget along the longest blocking path must stay within the SLO"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         // A cyclic graph has no defined longest path. `NoDependencyCycles` already

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2060136) panicked at crates/casm-validator/src/rules.rs:895:36:
no rule with id "critical-path-within-budget"

---- rules::tests::an_over_budget_critical_path_warns stdout ----

thread 'rules::tests::an_over_budget_critical_path_warns' (2060123) panicked at crates/casm-validator/src/rules.rs:741:9:
assertion failed: has(&architecture, "critical-path-within-budget")

---- rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract stdout ----

thread 'rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract' (2060137) panicked at crates/casm-validator/src/rules.rs:917:9:
assertion `left == right` failed: the identifiers and the order they are reported in are both a contract: SARIF output and `casm rules` are read by machines
  left: ["no-dependency-cycles", "no-publicly-exposed-datastores", "", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces", "patterns-are-satisfied"]
 right: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-n

failures:
    rules::tests::an_over_budget_critical_path_warns
    rules::tests::every_rule_describes_itself_rather_than_something_else
    rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract

test result: FAILED. 84 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
