*** crates/casm-validator/src/rules.rs:301:9: replace <impl Rule for BoundaryCrossingsRequireControls>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for BoundaryCrossingsRequireControls>::id -> &'static str with ""
@@ -293,17 +293,17 @@
     }
 }
 
 /// Edges crossing the control boundary must declare controls.
 pub struct BoundaryCrossingsRequireControls;
 
 impl Rule for BoundaryCrossingsRequireControls {
     fn id(&self) -> &'static str {
-        "boundary-crossings-require-controls"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "relationships that cross the trust boundary must declare at least one control"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for edge in context.architecture.relationships() {

---- rules::tests::an_uncontrolled_boundary_crossing_warns stdout ----

thread 'rules::tests::an_uncontrolled_boundary_crossing_warns' (2061897) panicked at crates/casm-validator/src/rules.rs:956:9:
assertion failed: has(&architecture, "boundary-crossings-require-controls")

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2061903) panicked at crates/casm-validator/src/rules.rs:895:36:
no rule with id "boundary-crossings-require-controls"

---- rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract stdout ----

thread 'rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract' (2061904) panicked at crates/casm-validator/src/rules.rs:917:9:
assertion `left == right` failed: the identifiers and the order they are reported in are both a contract: SARIF output and `casm rules` are read by machines
  left: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "", "no-isolated-nodes", "sync-targets-should-declare-interfaces", "patterns-are-satisfied"]
 right: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "

failures:
    rules::tests::an_uncontrolled_boundary_crossing_warns
    rules::tests::every_rule_describes_itself_rather_than_something_else
    rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 83 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
