*** crates/casm-validator/src/rules.rs:318:28: delete ! in <impl Rule for BoundaryCrossingsRequireControls>::check

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ delete ! in <impl Rule for BoundaryCrossingsRequireControls>::check
@@ -310,17 +310,17 @@
             let (Some(source), Some(target)) = (
                 context.architecture.node(edge.source()),
                 context.architecture.node(edge.target()),
             ) else {
                 continue;
             };
 
             let crosses = source.node_type().is_external() != target.node_type().is_external();
-            if !crosses || !edge.controls().is_empty() {
+            if !crosses ||  /* ~ changed by cargo-mutants ~ */edge.controls().is_empty() {
                 continue;
             }
 
             report.push(
                 Diagnostic::new(
                     self.id(),
                     Severity::Warning,
                     Subject::Relationship {

---- rules::tests::a_controlled_boundary_crossing_is_quiet stdout ----

thread 'rules::tests::a_controlled_boundary_crossing_is_quiet' (2065420) panicked at crates/casm-validator/src/rules.rs:981:9:
assertion failed: !has(&architecture, "boundary-crossings-require-controls")

---- rules::tests::an_uncontrolled_boundary_crossing_warns stdout ----

thread 'rules::tests::an_uncontrolled_boundary_crossing_warns' (2065435) panicked at crates/casm-validator/src/rules.rs:956:9:
assertion failed: has(&architecture, "boundary-crossings-require-controls")

---- tests::a_broken_architecture_reports_every_independent_problem_at_once stdout ----

thread 'tests::a_broken_architecture_reports_every_independent_problem_at_once' (2065457) panicked at crates/casm-validator/src/lib.rs:432:9:
["no-publicly-exposed-datastores", "services-require-security-controls", "stateful-nodes-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces"]

failures:
    rules::tests::a_controlled_boundary_crossing_is_quiet
    rules::tests::an_uncontrolled_boundary_crossing_warns
    tests::a_broken_architecture_reports_every_independent_problem_at_once

test result: FAILED. 84 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
