*** crates/casm-validator/src/rules.rs:389:9: replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for SyncTargetsShouldDeclareInterfaces>::check with ()
@@ -381,44 +381,17 @@
         "sync-targets-should-declare-interfaces"
     }
 
     fn description(&self) -> &'static str {
         "a node called synchronously should declare the interface that is being called"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
-        for node in context.architecture.nodes() {
-            if !node.interfaces().is_empty() || node.node_type().is_external() {
-                continue;
-            }
-
-            let called_synchronously = context
-                .architecture
-                .incoming(node.id())
-                .any(|edge| edge.relationship_type() == RelationshipType::Sync);
-
-            if !called_synchronously {
-                continue;
-            }
-
-            report.push(
-                Diagnostic::new(
-                    self.id(),
-                    Severity::Info,
-                    RuleContext::subject(node),
-                    "is called synchronously but declares no interfaces, so its contract \
-                     cannot be version-checked",
-                )
-                .with_suggestion(
-                    "add an 'interfaces' entry naming the protocol and semantic version \
-                     callers depend on",
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Every pattern an architecture claims to conform to must actually be satisfied.
 ///
 /// A conformance claim is a statement the architecture makes about itself, and this rule
 /// is what stops it from quietly becoming false. See ADR-0012 for why a pattern is a
 /// shape to check rather than a template to re-stamp.

---- rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only stdout ----

thread 'rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only' (2072258) panicked at crates/casm-validator/src/rules.rs:982:14:
rule should have fired

failures:
    rules::tests::a_sync_target_without_interfaces_is_reported_as_info_only

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
