*** crates/casm-validator/src/rules.rs:429:9: replace <impl Rule for PatternsAreSatisfied>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for PatternsAreSatisfied>::id -> &'static str with ""
@@ -421,17 +421,17 @@
 ///
 /// A conformance claim is a statement the architecture makes about itself, and this rule
 /// is what stops it from quietly becoming false. See ADR-0012 for why a pattern is a
 /// shape to check rather than a template to re-stamp.
 pub struct PatternsAreSatisfied;
 
 impl Rule for PatternsAreSatisfied {
     fn id(&self) -> &'static str {
-        "patterns-are-satisfied"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "every pattern the architecture claims conformance to must be satisfied"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for claim in context.architecture.conformance() {

---- rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract stdout ----

thread 'rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract' (2073890) panicked at crates/casm-validator/src/rules.rs:917:9:
assertion `left == right` failed: the identifiers and the order they are reported in are both a contract: SARIF output and `casm rules` are read by machines
  left: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isolated-nodes", "sync-targets-should-declare-interfaces", ""]
 right: ["no-dependency-cycles", "no-publicly-exposed-datastores", "critical-path-within-budget", "services-require-security-controls", "stateful-nodes-require-controls", "boundary-crossings-require-controls", "no-isola

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2073889) panicked at crates/casm-validator/src/rules.rs:895:36:
no rule with id "patterns-are-satisfied"

failures:
    rules::tests::every_rule_describes_itself_rather_than_something_else
    rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
