*** crates/casm-validator/src/rules.rs:433:9: replace <impl Rule for PatternsAreSatisfied>::description -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for PatternsAreSatisfied>::description -> &'static str with "xyzzy"
@@ -425,17 +425,17 @@
 pub struct PatternsAreSatisfied;
 
 impl Rule for PatternsAreSatisfied {
     fn id(&self) -> &'static str {
         "patterns-are-satisfied"
     }
 
     fn description(&self) -> &'static str {
-        "every pattern the architecture claims conformance to must be satisfied"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for claim in context.architecture.conformance() {
             let reference = claim.pattern().to_string();
             let subject = Subject::Pattern {
                 reference: reference.clone(),
             };

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2075016) panicked at crates/casm-validator/src/rules.rs:897:13:
patterns-are-satisfied: description "xyzzy" does not mention "conformance"

failures:
    rules::tests::every_rule_describes_itself_rather_than_something_else

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
