*** crates/casm-validator/src/rules.rs:58:9: replace RuleContext<'_>::name_of -> String with String::new()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace RuleContext<'_>::name_of -> String with String::new()
@@ -50,19 +50,17 @@
         Subject::Node {
             id: node.id(),
             name: node.name().as_str().to_owned(),
         }
     }
 
     /// Resolves a node's name for diagnostic text, falling back to its id.
     fn name_of(&self, id: casm_core::NodeId) -> String {
-        self.architecture
-            .node(id)
-            .map_or_else(|| id.to_string(), |node| node.name().as_str().to_owned())
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A single validation rule.
 pub trait Rule {
     /// The rule's stable, kebab-case identifier. Part of the public contract.
     fn id(&self) -> &'static str;

---- rules::tests::a_diagnostic_names_the_nodes_it_is_about stdout ----

thread 'rules::tests::a_diagnostic_names_the_nodes_it_is_about' (2046696) panicked at crates/casm-validator/src/rules.rs:836:17:
["", ""]

failures:
    rules::tests::a_diagnostic_names_the_nodes_it_is_about

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
