*** crates/casm-validator/src/rules.rs:84:9: replace <impl Rule for NoDependencyCycles>::id -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoDependencyCycles>::id -> &'static str with ""
@@ -76,17 +76,17 @@
 /// Blocking dependencies must not form a cycle.
 ///
 /// A cycle among blocking edges means no deployment order exists and a failure anywhere
 /// in the ring propagates to every member.
 pub struct NoDependencyCycles;
 
 impl Rule for NoDependencyCycles {
     fn id(&self) -> &'static str {
-        "no-dependency-cycles"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn description(&self) -> &'static str {
         "blocking dependencies (sync, depends-on, composed, quantum-entangled) must be acyclic"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for cycle in context.graph.cycles() {

---- rules::tests::a_dependency_cycle_is_an_error stdout ----

thread 'rules::tests::a_dependency_cycle_is_an_error' (2046906) panicked at crates/casm-validator/src/rules.rs:595:9:
assertion failed: has(&architecture, "no-dependency-cycles")

---- rules::tests::a_diagnostic_names_the_nodes_it_is_about stdout ----

thread 'rules::tests::a_diagnostic_names_the_nodes_it_is_about' (2046907) panicked at crates/casm-validator/src/rules.rs:834:14:
the cycle is reported

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2046932) panicked at crates/casm-validator/src/rules.rs:895:36:
no rule with id "no-dependency-cycles"

failures:
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::a_diagnostic_names_the_nodes_it_is_about
    rules::tests::every_rule_describes_itself_rather_than_something_else
    rules::tests::every_rule_identifier_is_pinned_because_it_is_a_public_contract
    tests::the_default_validator_exposes_its_rule_set

test result: FAILED. 82 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
