*** crates/casm-validator/src/rules.rs:88:9: replace <impl Rule for NoDependencyCycles>::description -> &'static str with ""

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoDependencyCycles>::description -> &'static str with ""
@@ -80,17 +80,17 @@
 pub struct NoDependencyCycles;
 
 impl Rule for NoDependencyCycles {
     fn id(&self) -> &'static str {
         "no-dependency-cycles"
     }
 
     fn description(&self) -> &'static str {
-        "blocking dependencies (sync, depends-on, composed, quantum-entangled) must be acyclic"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for cycle in context.graph.cycles() {
             let names: Vec<String> = cycle.iter().map(|id| context.name_of(*id)).collect();
 
             report.push(
                 Diagnostic::new(

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2048280) panicked at crates/casm-validator/src/rules.rs:897:13:
no-dependency-cycles: description "" does not mention "acyclic"

---- rules::tests::every_built_in_rule_documents_itself stdout ----

thread 'rules::tests::every_built_in_rule_documents_itself' (2048277) panicked at crates/casm-validator/src/rules.rs:1069:13:
no-dependency-cycles has no description

failures:
    rules::tests::every_built_in_rule_documents_itself
    rules::tests::every_rule_describes_itself_rather_than_something_else

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
