*** crates/casm-validator/src/rules.rs:88:9: replace <impl Rule for NoDependencyCycles>::description -> &'static str with "xyzzy"

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoDependencyCycles>::description -> &'static str with "xyzzy"
@@ -80,17 +80,17 @@
 pub struct NoDependencyCycles;
 
 impl Rule for NoDependencyCycles {
     fn id(&self) -> &'static str {
         "no-dependency-cycles"
     }
 
     fn description(&self) -> &'static str {
-        "blocking dependencies (sync, depends-on, composed, quantum-entangled) must be acyclic"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
         for cycle in context.graph.cycles() {
             let names: Vec<String> = cycle.iter().map(|id| context.name_of(*id)).collect();
 
             report.push(
                 Diagnostic::new(

---- rules::tests::every_rule_describes_itself_rather_than_something_else stdout ----

thread 'rules::tests::every_rule_describes_itself_rather_than_something_else' (2048495) panicked at crates/casm-validator/src/rules.rs:897:13:
no-dependency-cycles: description "xyzzy" does not mention "acyclic"

failures:
    rules::tests::every_rule_describes_itself_rather_than_something_else

test result: FAILED. 86 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
