*** crates/casm-validator/src/rules.rs:92:9: replace <impl Rule for NoDependencyCycles>::check with ()

*** mutation diff:
--- crates/casm-validator/src/rules.rs
+++ replace <impl Rule for NoDependencyCycles>::check with ()
@@ -84,38 +84,17 @@
         "no-dependency-cycles"
     }
 
     fn description(&self) -> &'static str {
         "blocking dependencies (sync, depends-on, composed, quantum-entangled) must be acyclic"
     }
 
     fn check(&self, context: &RuleContext<'_>, report: &mut Report) {
-        for cycle in context.graph.cycles() {
-            let names: Vec<String> = cycle.iter().map(|id| context.name_of(*id)).collect();
-
-            report.push(
-                Diagnostic::new(
-                    self.id(),
-                    Severity::Error,
-                    Subject::NodeSet {
-                        names: names.clone(),
-                    },
-                    format!(
-                        "{} nodes form a blocking dependency cycle, so no deployment order \
-                         exists and a failure in any member propagates to all",
-                        names.len()
-                    ),
-                )
-                .with_suggestion(
-                    "break the ring by making one hop 'async' or 'event-driven', or by \
-                     extracting the shared concern into a node both can depend on",
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A datastore must not be reachable directly from outside the control boundary.
 ///
 /// The canonical "no database on the public internet" rule.
 pub struct NoPubliclyExposedDatastores;

---- rules::tests::a_diagnostic_names_the_nodes_it_is_about stdout ----

thread 'rules::tests::a_diagnostic_names_the_nodes_it_is_about' (2049217) panicked at crates/casm-validator/src/rules.rs:813:14:
the cycle is reported

---- rules::tests::a_dependency_cycle_is_an_error stdout ----

thread 'rules::tests::a_dependency_cycle_is_an_error' (2049216) panicked at crates/casm-validator/src/rules.rs:573:9:
assertion failed: report.has_errors()

failures:
    rules::tests::a_dependency_cycle_is_an_error
    rules::tests::a_diagnostic_names_the_nodes_it_is_about

test result: FAILED. 85 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
